-- phpMyAdmin SQL Dump
-- version 4.3.11
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2015 �?06 ??23 ??22:34
-- 伺服器版本: 5.6.24
-- PHP 版本： 5.6.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 資料庫： `movie`
--

-- --------------------------------------------------------

--
-- 資料表結構 `comment`
--

CREATE TABLE IF NOT EXISTS `comment` (
  `board_id` int(11) NOT NULL,
  `title` varchar(40) NOT NULL,
  `name` varchar(20) NOT NULL,
  `messages` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `comment`
--

INSERT INTO `comment` (`board_id`, `title`, `name`, `messages`) VALUES
(1, '安安 大家好', '這是測試', '對 這就只是測試'),
(2, '安安 大家好', 'OJJ', '齁齁齁齁齁齁歐'),
(3, 'ㄚㄚㄚㄚㄚ', '乾乾乾乾', '咦咦咦咦?'),
(4, '我恨', 'EGG', '我想睡覺'),
(5, '乖乖', 'OJJ', '我陪你一起爆肝肝肝肝肝~~ XD'),
(6, '乖乖的', 'OJJ', '對阿~我超乖的~ :)');

-- --------------------------------------------------------

--
-- 資料表結構 `counthit`
--

CREATE TABLE IF NOT EXISTS `counthit` (
  `id_count` int(11) NOT NULL,
  `name` char(30) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `hit` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `counthit`
--

INSERT INTO `counthit` (`id_count`, `name`, `type`, `hit`) VALUES
(54, 'CIA追緝令', '動作冒險', 0),
(63, '一路玩到掛', '喜劇', 158),
(48, '不願面對的真相', '其他', 200),
(68, '世界Battle', '', 89),
(28, '今天暫時停止', '劇情', 76),
(0, '以愛之名：翁山蘇姬', '歷史傳記', 3),
(26, '伊莉莎白：輝煌年代', '歷史傳記', 43),
(24, '侏儸紀公園', '動作冒險', 2),
(32, '侏儸紀公園2：失落的世界', '動作冒險', 2),
(27, '出竅情人', '愛情文藝', 99),
(43, '化妝間那些事', '喜劇', 8),
(17, '史酷比：格鬥狂熱迷', '動畫', 125),
(58, '哥吉拉', '科幻神怪', 2),
(33, '國定殺戮日', '靈異驚悚', 111),
(8, '國定殺戮日：無法無天', '靈異驚悚', 233),
(57, '地心引力', '靈異驚悚', 133),
(38, '地獄醫院', '靈異驚悚', 142),
(4, '大明星世界末日', '喜劇', 54),
(10, '奶爸安親班', '喜劇', 3),
(19, '好球天團_第1季 #1', '喜劇', 53),
(73, '好球天團_第1季 #2', '喜劇', 53),
(2, '好萊塢好好看 #601', '其他', 8),
(21, '好萊塢好好看 #602', '其他', 8),
(86, '好萊塢好好看 #603', '', 0),
(90, '好萊塢好好看 603', '', 0),
(60, '家庭派對：就在今夜', '喜劇', 211),
(39, '家有跳狗', '家庭溫馨', 200),
(0, '尋找心樂章', '歌舞音樂', 36),
(37, '對面的惡女看過來', '愛情文藝', 178),
(88, '小屁蛋出任務', '', 0),
(5, '小魔女', '喜劇', 205),
(87, '尖頭外星人', '', 0),
(44, '強棒巨猩', '喜劇', 72),
(12, '復仇者聯盟', '動作冒險', 32),
(70, '怒海劫', '', 50),
(92, '思維空間', '', 0),
(66, '愛情無限譜', '', 25),
(0, '戀夏小情歌', '歌舞音樂', 37),
(75, '我的野蠻網友', '喜劇', 68),
(31, '戰火情人', '愛情文藝', 99),
(20, '救世鼎立戰_第1季 #1', '喜劇', 112),
(74, '救世鼎立戰_第1季 #2', '喜劇', 63),
(40, '新娘百分百', '愛情文藝', 223),
(85, '星光大盜', '', 0),
(0, '曼哈頓戀習曲', '歌舞音樂', 21),
(0, '歌喉讚', '歌舞音樂', 222),
(42, '浪人47', '動作冒險', 102),
(25, '浴血任務3', '動作冒險', 85),
(9, '海底總動員', '動畫', 156),
(52, '海綿寶寶歷險記', '動畫', 210),
(18, '無間警探_第2季 #1', '劇情', 207),
(72, '無間警探_第2季 #2', '劇情', 207),
(14, '特攻聯盟2', '喜劇', 8),
(45, '王牌大賤諜3-夠Man吧', '喜劇', 36),
(91, '玩命關頭', '', 0),
(34, '生命沒有歸處', '劇情', 176),
(64, '白宮末日', '', 210),
(23, '石頭族樂園2：賭城萬歲', '喜劇', 24),
(1, '硫磺島的英雄們', '戰爭災難', 8),
(7, '神鬼傳奇2', '動作冒險', 143),
(46, '科學怪犬', '動畫', 155),
(78, '空中危機', '劇情', 177),
(59, '立地成佛', '靈異驚悚', 165),
(13, '終棘警探', '喜劇', 2),
(29, '給我一個家', '劇情', 68),
(50, '美國黑幫', '歷史傳記', 9),
(22, '美麗境界', '歷史傳記', 18),
(3, '聯航93', '動作冒險', 214),
(47, '脫線教父', '喜劇', 5),
(0, '舞鬥', '歌舞音樂', 96),
(61, '荒野生存', '歷史傳記', 167),
(76, '蒙娜麗莎的微笑', '家庭溫馨', 83),
(16, '蠻荒歷險記', '動畫', 75),
(53, '贖罪', '劇情', 203),
(77, '超人：鋼鐵英雄', '科幻神怪', 168),
(89, '超級大間諜', '', 0),
(11, '超級選秀日', '劇情', 8),
(30, '辣媽辣妹', '家庭溫馨', 41),
(65, '醉後末日', '', 104),
(55, '醉鄉民謠', '劇情', 0),
(69, '鋼鐵人3', '', 87),
(56, '鋼鐵墳墓', '動作冒險', 26),
(71, '鎖命橫財', '動作冒險', 4),
(67, '阿爾法爸爸', '', 41),
(35, '陰兒房第2章：陰魂守舍', '靈異驚悚', 85),
(49, '雲端情人', '愛情文藝', 155),
(51, '靈異第六感', '靈異驚悚', 2),
(36, '餘燼追思', '劇情', 189),
(41, '驚聲尖笑4', '喜劇', 85),
(15, '鬼頭天兵', '喜劇', 165),
(6, '黑幫追殺令', '喜劇', 99),
(62, '黑色豪門企業', '劇情', 123);

-- --------------------------------------------------------

--
-- 資料表結構 `send_emil`
--

CREATE TABLE IF NOT EXISTS `send_emil` (
  `countid` int(11) NOT NULL,
  `e_mail` char(100) COLLATE utf8_unicode_ci NOT NULL,
  `name` char(50) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `date` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `channel` char(10) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `send_emil`
--

INSERT INTO `send_emil` (`countid`, `e_mail`, `name`, `type`, `date`, `time`, `channel`) VALUES
(4, 'u0224032@mis.nkfust.edu.tw', '化妝間那些事', '喜劇', '06/25', '00:00~01:20', 'HBO'),
(5, 'u0224032@mis.nkfust.edu.tw', '雲端情人', '愛情文藝', '06/25', '19:00~21:00', 'HBO'),
(6, 'u0224032@mis.nkfust.edu.tw', '哥吉拉', '科幻神怪', '06/26', '21:00~23:00', 'HBO'),
(7, 'u0224032@mis.nkfust.edu.tw', '國定殺戮日：無法無天', '靈異驚悚', '06/21', '14:15~16:00', 'HBO'),
(8, 'u0224032@mis.nkfust.edu.tw', '救世鼎立戰_第1季 #1', '喜劇', '06/22', '10:30~11:00', 'HBO'),
(9, 'u0224032@mis.nkfust.edu.tw', '侏儸紀公園', '動作冒險', '06/22', '18:55~21:00', 'HBO'),
(10, 'u0224026@nkfust.edu.tw', '醉後末日', '喜劇', '06/28', '02:45~04:30', 'HBO'),
(11, 'u0224026@nkfust.edu.tw', '不願面對的真相', '其他', '06/25', '17:25~19:00', 'HBO'),
(12, 'u0224032@mis.nkfust.edu.tw', '無間警探_第2季 #2', '劇情', '06/29', '09:00~10:00', 'HBO');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150610`
--

CREATE TABLE IF NOT EXISTS `t20150610` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150610`
--

INSERT INTO `t20150610` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '23:30~01:40', '浴血任務3', '', '動作冒險', '', '', ''),
(2, 'HBO', '01:40~03:30', '伊莉莎白：輝煌年代', '', '歷史傳記', '', '', ''),
(3, 'HBO', '03:30~06:00', '黑色豪門企業', '', '劇情', '', '', ''),
(4, 'HBO', '06:00~07:50', '老爺潛艇少爺兵', '', '喜劇', '', '', ''),
(5, 'HBO', '07:50~09:20', '完美第三者', '', '靈異驚悚', '', '', ''),
(6, 'HBO', '09:20~11:20', '贖罪', '', '劇情', '', '', ''),
(7, 'HBO', '11:20~13:50', '美國黑幫', '', '歷史傳記', '', '', ''),
(8, 'HBO', '13:50~16:00', '浴血任務3', '', '動作冒險', '', '', ''),
(9, 'HBO', '16:00~17:45', '小屁蛋出任務', '', '喜劇', '', '', ''),
(10, 'HBO', '17:45~19:20', '強棒巨猩', '', '喜劇', '', '', ''),
(11, 'HBO', '19:20~21:00', '亞當等大人2', '', '喜劇', '', '', ''),
(12, 'HBO', '21:00~22:50', 'CIA追緝令', '', '動作冒險', '', '', ''),
(13, 'HBO', '22:50~23:50', '冰與火之歌：權力遊戲_第5季 #9', '', '動作冒險', '', '', ''),
(14, 'HBO', '23:50~02:15', '大亨小傳', '', '愛情文藝', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150611`
--

CREATE TABLE IF NOT EXISTS `t20150611` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150611`
--

INSERT INTO `t20150611` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '23:50~02:15', '大亨小傳', '', '愛情文藝', '', '', ''),
(2, 'HBO', '02:15~04:15', '贖罪', '', '劇情', '', '', ''),
(3, 'HBO', '04:15~06:00', '銀線風暴', '', '動作冒險', '', '', ''),
(4, 'HBO', '06:00~07:50', '貓眼', '', '劇情', '', '', ''),
(5, 'HBO', '07:50~09:30', '亞當等大人2', '', '喜劇', '', '', ''),
(6, 'HBO', '09:30~11:10', '不願面對的真相', '', '其他', '', '', ''),
(7, 'HBO', '11:10~13:00', 'CIA追緝令', '', '動作冒險', '', '', ''),
(8, 'HBO', '13:00~14:00', '冰與火之歌：權力遊戲_第5季 #9', '', '動作冒險', '', '', ''),
(9, 'HBO', '14:00~16:05', '戰火情人', '', '愛情文藝', '', '', ''),
(10, 'HBO', '16:05~17:25', '森林保衛戰', '', '動畫', '', '', ''),
(11, 'HBO', '17:25~19:15', '世界Battle', '', '歌舞音樂', '', '', ''),
(12, 'HBO', '19:15~21:00', '醉後末日', '', '喜劇', '', '', ''),
(13, 'HBO', '21:00~23:20', '復仇者聯盟', '', '動作冒險', '', '', ''),
(14, 'HBO', '23:20~01:10', '血熱之心', '', '劇情', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150612`
--

CREATE TABLE IF NOT EXISTS `t20150612` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150612`
--

INSERT INTO `t20150612` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '23:20~01:10', '血熱之心', '', '劇情', '', '', ''),
(2, 'HBO', '01:10~01:40', '矽谷群瞎傳_第2季 #9', '', '喜劇', '', '', ''),
(3, 'HBO', '01:40~02:10', '副人之仁_第4季 #9', '', '喜劇', '', '', ''),
(4, 'HBO', '02:10~03:40', '鎖命橫財', '', '動作冒險', '', '', ''),
(5, 'HBO', '03:40~04:10', '好萊塢好好看 #600', '', '其他', '', '', ''),
(6, 'HBO', '04:10~06:00', '聯航93', '', '動作冒險', '', '', ''),
(7, 'HBO', '06:00~07:45', '世界Battle', '', '歌舞音樂', '', '', ''),
(8, 'HBO', '07:45~09:15', '脫線教父', '', '喜劇', '', '', ''),
(9, 'HBO', '09:15~10:50', '王牌大賤諜3-夠Man吧', '', '喜劇', '', '', ''),
(10, 'HBO', '10:50~13:00', '硫磺島的英雄們', '', '戰爭災難', '', '', ''),
(11, 'HBO', '13:00~13:30', '矽谷群瞎傳_第2季 #9', '', '喜劇', '', '', ''),
(12, 'HBO', '13:30~14:00', '副人之仁_第4季 #9', '', '喜劇', '', '', ''),
(13, 'HBO', '14:00~15:50', '醉後末日', '', '喜劇', '', '', ''),
(14, 'HBO', '15:50~17:25', '小魔女', '', '喜劇', '', '', ''),
(15, 'HBO', '17:25~18:55', '打獵季節', '', '動畫', '', '', ''),
(16, 'HBO', '18:55~21:00', '侏儸紀公園', '', '動作冒險', '', '', ''),
(17, 'HBO', '21:00~23:10', '侏儸紀公園2：失落的世界', '', '動作冒險', '', '', ''),
(18, 'HBO', '23:10~01:00', '進擊的大佬', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150613`
--

CREATE TABLE IF NOT EXISTS `t20150613` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150613`
--

INSERT INTO `t20150613` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '23:10~01:00', '進擊的大佬', '', '喜劇', '', '', ''),
(2, 'HBO', '01:00~03:00', '全家就是米家', '', '喜劇', '', '', ''),
(3, 'HBO', '03:00~04:20', '化妝間那些事', '', '喜劇', '', '', ''),
(4, 'HBO', '04:20~06:00', '小屁蛋出任務', '', '喜劇', '', '', ''),
(5, 'HBO', '06:00~07:40', '今天暫時停止', '', '劇情', '', '', ''),
(6, 'HBO', '07:40~08:10', '好萊塢好好看 #600', '', '其他', '', '', ''),
(7, 'HBO', '08:10~09:55', '我的野蠻網友', '', '喜劇', '', '', ''),
(8, 'HBO', '09:55~11:50', '進擊的大佬', '', '喜劇', '', '', ''),
(9, 'HBO', '11:50~13:20', '石頭族樂園2：賭城萬歲', '', '喜劇', '', '', ''),
(10, 'HBO', '13:20~15:25', '侏儸紀公園', '', '動作冒險', '', '', ''),
(11, 'HBO', '15:25~17:30', '侏儸紀公園2：失落的世界', '', '動作冒險', '', '', ''),
(12, 'HBO', '17:30~19:15', '樂高玩電影', '', '動畫', '', '', ''),
(13, 'HBO', '19:15~21:00', '空中救援', '', '懸疑推理', '', '', ''),
(14, 'HBO', '21:00~22:50', '超級選秀日', '', '劇情', '', '', ''),
(15, 'HBO', '22:50~00:30', '特攻聯盟2', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150614`
--

CREATE TABLE IF NOT EXISTS `t20150614` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150614`
--

INSERT INTO `t20150614` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '22:50~00:30', '特攻聯盟2', '', '喜劇', '', '', ''),
(2, 'HBO', '00:30~02:40', '戰火情人', '', '愛情文藝', '', '', ''),
(3, 'HBO', '02:40~04:25', '我的野蠻網友', '', '喜劇', '', '', ''),
(4, 'HBO', '04:25~06:00', '空中危機', '', '劇情', '', '', ''),
(5, 'HBO', '06:00~07:25', '蠻荒歷險記', '', '動畫', '', '', ''),
(6, 'HBO', '07:25~09:00', '強棒巨猩', '', '喜劇', '', '', ''),
(7, 'HBO', '09:00~10:25', '海綿寶寶歷險記', '', '動畫', '', '', ''),
(8, 'HBO', '10:25~12:05', '樂高玩電影', '', '動畫', '', '', ''),
(9, 'HBO', '12:05~13:50', '空中救援', '', '懸疑推理', '', '', ''),
(10, 'HBO', '13:50~15:55', '雲端情人', '', '愛情文藝', '', '', ''),
(11, 'HBO', '15:55~17:45', '超級選秀日', '', '劇情', '', '', ''),
(12, 'HBO', '17:45~19:05', '魔法靈貓', '', '喜劇', '', '', ''),
(13, 'HBO', '19:05~21:00', '浪人47', '', '動作冒險', '', '', ''),
(14, 'HBO', '21:00~22:35', '立地成佛', '', '靈異驚悚', '', '', ''),
(15, 'HBO', '22:35~00:05', '惡鄰纏身', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150615`
--

CREATE TABLE IF NOT EXISTS `t20150615` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150615`
--

INSERT INTO `t20150615` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '22:35~00:05', '惡鄰纏身', '', '喜劇', '', '', ''),
(2, 'HBO', '00:05~01:30', '國定殺戮日', '', '靈異驚悚', '', '', ''),
(3, 'HBO', '01:30~03:10', '空中危機', '', '劇情', '', '', ''),
(4, 'HBO', '03:10~04:35', '尖頭外星人', '', '喜劇', '', '', ''),
(5, 'HBO', '04:35~06:00', '完美第三者', '', '靈異驚悚', '', '', ''),
(6, 'HBO', '06:00~07:20', '魔法靈貓', '', '喜劇', '', '', ''),
(7, 'HBO', '07:20~09:00', '給我一個家', '', '劇情', '', '', ''),
(8, 'HBO', '09:00~10:00', '冰與火之歌：權力遊戲_第5季 #10', '', '動作冒險', '', '', ''),
(9, 'HBO', '10:00~10:30', '矽谷群瞎傳_第2季 #10', '', '喜劇', '', '', ''),
(10, 'HBO', '10:30~11:00', '副人之仁_第4季 #10', '', '喜劇', '', '', ''),
(11, 'HBO', '11:00~12:40', '立地成佛', '', '靈異驚悚', '', '', ''),
(12, 'HBO', '12:40~14:35', '浪人47', '', '動作冒險', '', '', ''),
(13, 'HBO', '14:35~17:05', '黑色豪門企業', '', '劇情', '', '', ''),
(14, 'HBO', '17:05~17:35', '好萊塢好好看 #601', '', '其他', '', '', ''),
(15, 'HBO', '17:35~19:20', '隨身變2', '', '喜劇', '', '', ''),
(16, 'HBO', '19:20~21:00', '思維空間', '', '靈異驚悚', '', '', ''),
(17, 'HBO', '21:00~22:00', '冰與火之歌：權力遊戲_第5季 #10', '', '動作冒險', '', '', ''),
(18, 'HBO', '22:00~22:30', '矽谷群瞎傳_第2季 #10', '', '喜劇', '', '', ''),
(19, 'HBO', '22:30~23:00', '副人之仁_第4季 #10', '', '喜劇', '', '', ''),
(20, 'HBO', '23:00~00:45', '大明星世界末日', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150616`
--

CREATE TABLE IF NOT EXISTS `t20150616` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150616`
--

INSERT INTO `t20150616` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '23:00~00:45', '大明星世界末日', '', '喜劇', '', '', ''),
(2, 'HBO', '00:45~02:20', '家庭派對：就在今夜', '', '喜劇', '', '', ''),
(3, 'HBO', '02:20~04:15', '貓眼', '', '劇情', '', '', ''),
(4, 'HBO', '04:15~06:00', '給我一個家', '', '劇情', '', '', ''),
(5, 'HBO', '06:00~07:45', '隨身變2', '', '喜劇', '', '', ''),
(6, 'HBO', '07:45~09:15', '打獵季節', '', '動畫', '', '', ''),
(7, 'HBO', '09:15~11:00', '醉鄉民謠', '', '劇情', '', '', ''),
(8, 'HBO', '11:00~11:30', '矽谷群瞎傳_第2季 #10', '', '喜劇', '', '', ''),
(9, 'HBO', '11:30~12:00', '副人之仁_第4季 #10', '', '喜劇', '', '', ''),
(10, 'HBO', '12:00~13:00', '冰與火之歌：權力遊戲_第5季 #10', '', '動作冒險', '', '', ''),
(11, 'HBO', '13:00~15:30', '大亨小傳', '', '愛情文藝', '', '', ''),
(12, 'HBO', '15:30~17:10', '今天暫時停止', '', '劇情', '', '', ''),
(13, 'HBO', '17:10~18:35', '史酷比：格鬥狂熱迷', '', '動畫', '', '', ''),
(14, 'HBO', '18:35~21:00', '達文西密碼', '', '懸疑推理', '', '', ''),
(15, 'HBO', '21:00~22:50', '超級選秀日', '', '劇情', '', '', ''),
(16, 'HBO', '22:50~01:15', '銀幕大角頭2：傳奇再續', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150617`
--

CREATE TABLE IF NOT EXISTS `t20150617` (
  `movie_id` int(11) NOT NULL,
  `movie_channel` char(10) NOT NULL,
  `movie_time` char(20) NOT NULL,
  `movie_nameCH` char(20) NOT NULL,
  `movie_nameEN` char(20) NOT NULL,
  `type` char(8) NOT NULL,
  `movie_director` char(40) NOT NULL,
  `movie_actor` char(200) NOT NULL,
  `movie_main` char(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `t20150617`
--

INSERT INTO `t20150617` (`movie_id`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`) VALUES
(1, 'HBO', '22:50~01:15', '銀幕大角頭2：傳奇再續', '', '喜劇', '', '', '');

-- --------------------------------------------------------

--
-- 資料表結構 `t20150621`
--

CREATE TABLE IF NOT EXISTS `t20150621` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150621`
--

INSERT INTO `t20150621` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/21', 'HBO', '00:00~02:10', '硫磺島的英雄們', '', '戰爭災難', '\r\n克林伊斯威特 (Clint Eastwood)', '', '  (2006)1945年二月，歐洲戰場已幾近獲勝進入反攻尾聲，但太平洋戰場仍然陷入膠著狀態，其中最艱困的一場遭遇戰役就發生在硫磺島上，其中一段經典影像：五位海軍陸戰隊員與一位海軍看護兵一起在摺缽山頂豎起美國國旗，更被拍成照片名留青史。這張捕捉到歷史時刻的照片，讓開始厭倦戰爭的美國找到勝利的象徵，也讓護旗的這六位美國戰士一夕之間成為全國英雄，雖然其中有人很快就為國捐軀，不知道他們將被永遠紀念歌頌；但是倖存的護旗者卻沒有興趣當個表面形象符號，甚至也不認為自己是英雄，他們只想陪同袍們一起駐守前線，絲毫不宣揚炫耀地戰鬥與犧牲。\n\r\n   改編自詹姆斯布萊德利與隆包爾的暢銷書，由奧斯卡金獎導演克林伊斯威特繼【登峰造擊】、「殺無赦」之後所執導二次大戰電影【硫磺島的英雄們】，並與多項奧斯卡得主史帝芬史匹柏，其知名作品包括【搶救雷恩大兵】、【辛德勒名單】，以及製片【神秘河流】勞勃羅倫茲等三人共同監製。', 'http://www.niotv.com/epg_content.php?epg_no=1583162&content_id=&ch_id=46&epg_name=硫磺島的英雄們&stype=name', '06211', 0),
(2, '06/21', 'HBO', '02:10~02:35', '好萊塢好好看 #601', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583163&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '06212', 0),
(3, '06/21', 'HBO', '02:35~04:20', '聯航93', '', '動作冒險', '\r\n保羅葛林葛瑞斯(Paul Greengrass)', '', '(2006)時間回到二○○一年九一一恐怖攻擊期間，四架商業客機遭到挾持，恐怖份子成功駕駛地其中三架撞擊極具戰略價值的建築物。本片則是描述第四架也是最後一架起飛的飛機「聯合航空93號班機」的故事，機上乘客克服恐懼起身反擊，不惜犧牲自己性命，阻止劫機客遂行恐怖攻擊的意圖。', 'http://www.niotv.com/epg_content.php?epg_no=1583164&content_id=&ch_id=46&epg_name=聯航93&stype=name', '06213', 0),
(4, '06/21', 'HBO', '04:20~06:00', '大明星世界末日', '', '喜劇', '\r\n塞斯羅根 (Seth Rogen)', '', '(2013)一連串奇怪的災難重創洛杉磯後，六位好友被困在一棟屋子內，等待救援。當糧食逐漸耗盡、心理壓力也越來越大的時候，這六人開始考慮走出這棟房子主動尋求生路……。喜劇片，演員們在片中飾演在虛構世界中的自己。\n\r\n本片為《青蜂俠》塞斯羅根自編自導自演的喜劇電影，雖然片中的世界與故事是虛構的，但是演員們都在這部片中飾演他們自己。在美國上映時，獲得不少正面評價。 \n\r\n塞斯羅根一位同為演員的朋友傑巴魯契來洛杉磯探訪他，羅根便邀請巴魯契一起去參加詹姆斯法蘭科慶祝新居落成的轟趴。那是一個充滿了酒、性、毒品和噪音的瘋狂派對，也有許多明星出席，譬如說喬納希爾和艾瑪華特森等人。然而，面對那麼多陌生人讓巴魯契覺得不是很舒服，羅根便跟隨巴魯契暫時離開那棟房子，去便利商店買香煙。 \n\r\n此時，天空忽然出現了數道藍色的光束，並將一些路人吸走；因此而急忙趕回詹姆斯法蘭科新家的塞斯羅根和傑巴魯契，一路上遇見了不少車禍和混亂的場面，卻在進入法蘭科的屋子之後，驚訝地發現派對仍然熱熱鬧鬧地進行當中，和外面的情勢形成強烈對比，而且大家都不相信塞斯羅根和傑巴魯契所描述的屋外的狀況；直到開始出現地震。 \n\r\n眾人倉皇地逃到屋外，卻因為地震而喪生了不少人，導致最後能夠再度躲回法蘭科的屋子的只剩六個人，而且他們相信憑他們的知名度，救援人員很快就趕到。但是，事情真的會按照他們所以為的那樣順利嗎……？ \n\r\n塞斯羅根和伊凡·古柏格是本片的共同編導，只是伊凡·古柏格並沒有演出。塞斯羅根表示能夠和一群好朋友一同拍攝這樣的一部電影，是一件很棒的事情，尤其是大家都不介意開自己的玩笑；而那也是這部電影之所以可以拍成的原因之一。', 'http://www.niotv.com/epg_content.php?epg_no=1583165&content_id=&ch_id=46&epg_name=大明星世界末日&stype=name', '06214', 0),
(5, '06/21', 'HBO', '06:00~07:40', '小魔女', '', '喜劇', '\r\n丹尼狄維多 (Danny DeVito)', '', '(1996)瑪蒂達生在一個亂糟糟的家庭裡，她卻出奇地甜美且善體人意，同時，也是個天才兒童。但她很快便發現到，這個世界竟是如此醜陋，險惡的學校校長、欺負小動物的壞蛋、和變態怪異的家人都給她上了一課；她也發現自己有改變這一切的超能力，她努力想讓父母別那麼無情，而意外釋放自己心靈感應的能量。最後她將學到愛的可貴，和公平競爭的道理。', 'http://www.niotv.com/epg_content.php?epg_no=1583166&content_id=&ch_id=46&epg_name=小魔女&stype=name', '06215', 0),
(6, '06/21', 'HBO', '07:40~08:10', '好萊塢好好看 #601', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583167&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '06216', 0),
(7, '06/21', 'HBO', '08:10~10:20', '硫磺島的英雄們', '', '戰爭災難', '\r\n克林伊斯威特 (Clint Eastwood)', '', '  (2006)1945年二月，歐洲戰場已幾近獲勝進入反攻尾聲，但太平洋戰場仍然陷入膠著狀態，其中最艱困的一場遭遇戰役就發生在硫磺島上，其中一段經典影像：五位海軍陸戰隊員與一位海軍看護兵一起在摺缽山頂豎起美國國旗，更被拍成照片名留青史。這張捕捉到歷史時刻的照片，讓開始厭倦戰爭的美國找到勝利的象徵，也讓護旗的這六位美國戰士一夕之間成為全國英雄，雖然其中有人很快就為國捐軀，不知道他們將被永遠紀念歌頌；但是倖存的護旗者卻沒有興趣當個表面形象符號，甚至也不認為自己是英雄，他們只想陪同袍們一起駐守前線，絲毫不宣揚炫耀地戰鬥與犧牲。\n\r\n   改編自詹姆斯布萊德利與隆包爾的暢銷書，由奧斯卡金獎導演克林伊斯威特繼【登峰造擊】、「殺無赦」之後所執導二次大戰電影【硫磺島的英雄們】，並與多項奧斯卡得主史帝芬史匹柏，其知名作品包括【搶救雷恩大兵】、【辛德勒名單】，以及製片【神秘河流】勞勃羅倫茲等三人共同監製。', 'http://www.niotv.com/epg_content.php?epg_no=1583168&content_id=&ch_id=46&epg_name=硫磺島的英雄們&stype=name', '06217', 0),
(8, '06/21', 'HBO', '10:20~12:05', '黑幫追殺令', '', '喜劇', ' \r\n盧貝松 (Luc Besson)', '', '(2013)本片改編自同名小說，盧貝松自編自導。勞勃狄尼洛、湯米李瓊斯以及蜜雪兒菲佛主演的黑色喜劇。 \n\r\n在紐約大名鼎鼎的黑手黨黑道份子曼索尼(勞勃狄尼諾飾演)，這回惹了會禍及全家的麻煩事。因為舉發了紐約五大家族首腦唐老大的犯罪事證，曼索尼一家人便在證人保護措施的運作之下，舉家搬遷至法國一處慵懶的小鎮，而一名CIA探員（湯米李瓊斯飾）就住在他們家對面以茲保護。 \n\r\n儘管化名為布萊克的曼索尼一家想要保持低調、融入當地的生活，但是他們就是難以自制地以他們所習慣的「家族方式」去處理生活中發生的問題，像是女主人（蜜雪兒菲佛飾演）因為買不到花生醬、又被嘲笑其法文發音，在惱羞成怒之下就把那間超市給炸了；女兒（戴安娜艾格倫飾演）遇到想佔她便宜的男生，拿起網球拍就是一陣猛K，毫不手軟；兒子即使在學校被其他學生霸凌，他也知道該如何扭轉形勢、每天都過得好好的。 \n\r\n這家人的行事風格很快地就引起了相當程度的注意，也傳到了昔日和他們家十分要好的親信朋友耳中，讓他們得以循跡來到法國、找到他們的藏身之處……。 \n\r\n這部影片是勞勃狄尼洛和蜜雪兒菲佛自《星塵傳奇》之後、再次於同部電影中演出；然而，這次扮演夫妻的兩位不但「關係」更為緊密，也有許多在搞笑之餘仍要保有說服力的趣味演出。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583169&content_id=&ch_id=46&epg_name=黑幫追殺令&stype=name', '06218', 0),
(9, '06/21', 'HBO', '12:05~14:15', '神鬼傳奇2', '', '動作冒險', '\r\n史蒂芬桑莫斯(Stephen Sommers)', '', '(2001)時間是1935年，在收服了可怕的印何闐之後，事隔十年，瑞克歐肯納及艾佛琳有情人終成眷屬，不但結婚成家，而且還有一個八歲大的兒子艾力克。艾力克遺傳了他父親的冒險精神，也繼承了他母親對古文明的興趣，他的舅舅強納森更是不斷激發他無窮的想像力。但是遠在 撒哈拉 沙漠的黃沙土底，一股更可怕的邪惡力量正在醞釀成形。六千年前，一名驍勇擅戰的武士魔蠍大帝曾向古埃及神祇阿努比立約，但是卻違背誓約，於是他受到永生永世的詛咒，現在他將率領阿努比大軍重返人間，摧毀現有的文明世界。另外有一群殘暴兇狠的魔鬼信徒一心想將印何闐起死回生，並且利用他來對付法力強大的魔蠍大帝，因此三千年後仍不得安息的印何闐再度降臨人世，引起一場軒然大波...', 'http://www.niotv.com/epg_content.php?epg_no=1583170&content_id=&ch_id=46&epg_name=神鬼傳奇2&stype=name', '06219', 0),
(10, '06/21', 'HBO', '14:15~16:00', '國定殺戮日：無法無天', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583171&content_id=&ch_id=46&epg_name=國定殺戮日：無法無天&stype=name', '062110', 0),
(11, '06/21', 'HBO', '16:00~17:40', '海底總動員', '', '動畫', ' \r\n安德魯史丹頓(Andrew Stanton)', '', '(2003)迪士尼皮克斯合作電腦動畫電影【海底總動員】首度在暑假推出，這是迪士尼公司以及皮克斯工作室繼【玩具總動員】、【 蟲蟲危機 】、【玩具總動員２】、【 怪獸電力公司 】後第五部合作推出的作品，故事來到了海底世界，主角則是一對小丑魚父子。有一天兒子 Nemo 從他們所居住的珊瑚礁被給抓走，被帶到澳洲的一家牙醫診所當中，魚爸爸Marlin 知道後心急如焚，為了找回他寶貝兒子，如今必須尋遍大海，跟上澳洲洋流才能帶回兒子，在途中他遇到形形色色的朋友，也遭遇各式各樣的危機，他到底能否克服萬難找到兒子呢？', 'http://www.niotv.com/epg_content.php?epg_no=1583172&content_id=&ch_id=46&epg_name=海底總動員&stype=name', '062111', 0),
(12, '06/21', 'HBO', '17:40~19:10', '奶爸安親班', '', '喜劇', '\r\n史提夫卡耳 (Steve Carr)', '', '(2003)查理(艾迪墨菲飾) 與好友兩人同時在一夕之間丟掉了飯碗，臉上無光的兩人雖然想趕緊找份像樣的工作，卻一直找不到.，所以只好待在家中照顧自己的小孩。一天，看著自己的小兒子，查理突然閃過了一個念頭：開一家「奶爸安親班」。在眾人都不看好的情況下，查理還是堅持己見，而從開張的第一天開始，查理才恍然大悟，照顧小孩的工作並不是一般人可以做的工作！而查理的麻煩並不只於此，更大的危機則是來自於同一學區超級貴族安親班的恐怖女董事 – 安潔莉卡赫斯頓！他要如何度過重重危機呢?」。', 'http://www.niotv.com/epg_content.php?epg_no=1583173&content_id=&ch_id=46&epg_name=奶爸安親班&stype=name', '062112', 0),
(13, '06/21', 'HBO', '19:10~21:00', '超級選秀日', '', '劇情', ' \r\n伊凡萊蔓 (Ivan Reitman)', '', '(2014)面對球團內的壓力，敵對經理人的算計，甚至被開除的威脅，桑尼該如何在這超級選秀日中運籌帷幄、機關算盡，挑選出陣容最堅強的夢幻球隊呢？\n\r\n本片由《型男飛行日誌》製作團隊操刀，《飯飯之交》導演艾凡瑞特曼執導，《傑克萊恩︰詭影任務》凱文科斯納、《藥命俱樂部》珍妮佛嘉納領銜主演。 \n\r\n國家美式足球聯盟選秀日到來了，總經理桑尼威佛有權這天為克里夫蘭隊在第一輪優先挑選球員，但他必須面對上百個懷抱夢想的青年，並在專業和私人情感間做出正確決定。 \n\r\n同時，他也面臨球團內的壓力、敵對經理人的算計、被開除的威脅，要在這超級選秀日中運籌帷幄，挑選出陣容最堅強的夢幻球隊！ \n\r\n曾演出許多運動片的凱文科斯納表示並不想拍重複的故事，但他認為《超級選秀日》並未將重心放在球場上的比賽，而是探索比賽背後球隊營運的商業機密，因此有興趣演出，也拜訪了許多國家美式足球聯盟的球隊總經理。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583174&content_id=&ch_id=46&epg_name=超級選秀日&stype=name', '062113', 0),
(14, '06/21', 'HBO', '21:00~23:20', '復仇者聯盟', '', '動作冒險', '\r\n喬斯溫登 (Joss Whedon)', '', '(2012)由漫威影業所推出的超級英雄系列電影，鋼鐵人、浩克、雷神索爾、美國隊長、鷹眼與黑寡婦現身，共同組成「復仇者聯盟」向邪惡勢力宣戰。\n\r\n本片耗資2.2億美元，由小勞勃道尼、克里斯伊凡、馬克魯法洛、克里斯漢斯沃、史嘉蕾喬韓森、傑瑞米雷納與山謬傑克森主演，喬斯溫登執導的漫威影業(Marvel Studio)年度鉅片，改編自1963年的同名暢銷漫畫。\n\r\n邪惡勢力悄悄集結，力量已龐大到極為驚人的地步，危機已非任何英雄能獨力面對。為了保護地球的安危，神盾局(S.H.I.E.L.D)局長尼克福瑞(山謬傑克森飾)費盡心力將各方超級英雄聚集一堂，包括鋼鐵人、綠巨人浩克、雷神索爾、鷹眼與黑寡婦，還有剛從冰獄裡甦醒的美國隊長。\n\r\n於是，「復仇者聯盟」就此組成，然而各自擁有強大神力或武器的超級英雄，必須能夠放下彼此之間的偏見，同心協力找到合作的模式，才有機會與邪惡勢力一博。而要阻止邪惡計畫的他們，團結的力量真能成功擊敗敵人？\n\r\n漫威影業(Marvel Studio)結合旗下著名漫畫人物，延伸出二部「復仇者」系列電影，本片為第二部，由《X戰警3：最後戰役》編劇塞克潘執筆撰寫劇本，而第一部為《美國隊長》。\n\r\n為推出《復仇者聯盟》系列，漫威影業早已為各路英雄推出電影，並在片尾留下伏筆，也因此飾演個別英雄人物的影星通通到齊。眾星雲集的程度前所未見。\n\r\n而性感女星史嘉蕾喬韓森飾演的頂尖間諜黑寡婦，則在眾多英雄中注入一點女人味。飾演綠巨人的馬克魯法洛則從默默無名的配角到入圍奧斯卡，終於接演首部商業大片，為飾演第三代浩克還特地減重15磅。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583175&content_id=&ch_id=46&epg_name=復仇者聯盟&stype=name', '062114', 0),
(15, '06/21', 'HBO', '23:20~01:20', '終棘警探', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2007)尼可拉斯安傑是全倫敦最強的條子，破案率高達400%，遠遠凌駕於其他警察同僚之上。但安傑的表現實在太出色，要叫其他同事的臉往哪裡擺？所以上級決定將他發派「邊彊」，調到一個與犯罪絕緣的純樸小鎮去。 \n\r\n安傑一抵達山佛小鎮，就受到搭擋丹尼的超熱情歡迎，丹尼是老好人警長之子，更是頭號動作片迷，如今終於從大城市裡來了個夠格的條子，這讓丹尼相信，他那些槍戰、警車追逐的警察夢終於要實現了！可惜的是安傑對他那些小學生般的美夢並不領情，有夠煩的丹尼更讓英雄無用武之地的他日益沮喪。 \n\r\n某天大事件真的發生了，突然的意外襲捲小鎮，而安傑更發現這座小鎮不如外表看來平靜，某種陰謀正在等待他們去發掘…爆破、飆車追逐與槍戰也要從丹尼的夢想中走進現實，現在，是小鎮警察們團結起來執行正義的時候了！ ', 'http://www.niotv.com/epg_content.php?epg_no=1583176&content_id=&ch_id=46&epg_name=終棘警探&stype=name', '062115', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150622`
--

CREATE TABLE IF NOT EXISTS `t20150622` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150622`
--

INSERT INTO `t20150622` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/22', 'HBO', '23:20~01:20', '終棘警探', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2007)尼可拉斯安傑是全倫敦最強的條子，破案率高達400%，遠遠凌駕於其他警察同僚之上。但安傑的表現實在太出色，要叫其他同事的臉往哪裡擺？所以上級決定將他發派「邊彊」，調到一個與犯罪絕緣的純樸小鎮去。 \n\r\n安傑一抵達山佛小鎮，就受到搭擋丹尼的超熱情歡迎，丹尼是老好人警長之子，更是頭號動作片迷，如今終於從大城市裡來了個夠格的條子，這讓丹尼相信，他那些槍戰、警車追逐的警察夢終於要實現了！可惜的是安傑對他那些小學生般的美夢並不領情，有夠煩的丹尼更讓英雄無用武之地的他日益沮喪。 \n\r\n某天大事件真的發生了，突然的意外襲捲小鎮，而安傑更發現這座小鎮不如外表看來平靜，某種陰謀正在等待他們去發掘…爆破、飆車追逐與槍戰也要從丹尼的夢想中走進現實，現在，是小鎮警察們團結起來執行正義的時候了！ ', 'http://www.niotv.com/epg_content.php?epg_no=1583176&content_id=&ch_id=46&epg_name=終棘警探&stype=name', '06221', 0),
(2, '06/22', 'HBO', '01:20~03:00', '特攻聯盟2', '', '喜劇', '\r\n杰夫瓦德洛 (Jeff Wadlow)', '', '(2013)本片為《特攻聯盟》的續集電影，不但找回之前的原班人馬再度出飾同樣的角色，這一集中，還請來好萊塢喜劇天王金凱瑞前來助陣！ \n\r\n許多在漫畫原著裡所有的超限制級和超低級的內容與畫面，雖然很多人都認為根本不可能出現在大銀幕上，但是，請漫迷們不用覺得掃興，因為在第二集當中，這些被認為超誇張的部份，都會毫不保留地在大銀幕上呈現！ \n\r\n「超殺女」這個角色，在第一集中就很搶眼，並擁有極多的粉絲，到了第二集，將會有更多、更深入的篇幅放在她身上。另外，「赤霧人」到了這一集，將會進化成進階版的大反片臭B王，因為他要報「屌爆俠」殺害他父親的血海深仇，同時也可以證明自己的能力。而臭B王在這一集裡頭依舊是由克里斯多福米茲布拉斯所擔綱演出。事實上，因為當一位平常形象良好的演員來飾演電影中大反派的角色時，一種視覺和觀眾腦中理解的反差衝擊會出現，並帶給觀眾一種很新鮮很「跳」的感受。 \n\r\n導演在一開始選角的時候，就十分中意克里斯多福米茲布拉斯萊出任這個角色，雖然很多人一開始都不看好諧星有能力將正經嚴肅的角色表現好，但其實，克里斯多斯福不但能夠勝任，他甚至是一名可以演出各種不同類型角色的全方面的演員。觀眾在第一集電影中看他詮釋「赤霧人」使壞，就會自動地產生一種顛覆性的不適應感，而這也是導演當初選角的用意。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583177&content_id=&ch_id=46&epg_name=特攻聯盟2&stype=name', '06222', 0),
(3, '06/22', 'HBO', '03:00~04:35', '鬼頭天兵', '', '喜劇', '\r\n強納生林恩 (Jonathan Lynn)', '', '(1996)華盛頓，艾森豪威爾，巴頓等全都是美國大名鼎鼎的將軍，他們為國民捨身成仁，但傳統優良的美軍中，卻有一個害群之馬，他就是畢可中士（史提夫馬丁）。畢可是一個天生的賭徒，雖然他的正職是巴克斯堡基地的主管，但其實暗地裡在兵營從事賭業，一直以來，兩身份毫無衝突，直到一日，已榮升少校的仇家突然前來基地，要舉行檢查及核點帳目。而一向帳目不清的畢可今次如何化解這場挑戰，且看他的賭運如何？', 'http://www.niotv.com/epg_content.php?epg_no=1583178&content_id=&ch_id=46&epg_name=鬼頭天兵&stype=name', '06223', 0),
(4, '06/22', 'HBO', '04:35~06:00', '蠻荒歷險記', '', '動畫', '\r\n凱西麥凱森 (Cathy Malkasian)', '', '(2002)這部動畫是取材自五分錢電影院大受歡迎的電視影集。伊莉莎（拉塞查伯特配音，「辣妹過招」、「奶爸安親班」）是個愛冒險的12歲小孩，擁有和動物交談的能力。她極想拯救一頭幼豹免於被獵人捕殺，因此搭船前往倫敦的寄宿學校，然而到了倫敦後，她感到非常不適應，極想回到故鄉塞倫蓋提大草原。在室友的幫助下，伊莉莎拿到一張回非洲的船票，她卻意外發現獵人史龍和布里（由魯伯特艾瑞特，「 新娘不是我」、「 仲夏夜之夢」與奧斯卡得主瑪莉莎湯美，「 意外邊緣」、「 男人百分百」、「 性福大師」擔任配音）有個更凶殘的計劃，意圖想獵捕象群，並將之殺害以取得珍貴漂亮的象牙。伊莉莎瞭解到自己掌握著家人和心愛動物的命運，必須起之與壞人對抗！', 'http://www.niotv.com/epg_content.php?epg_no=1583179&content_id=&ch_id=46&epg_name=蠻荒歷險記&stype=name', '06224', 0),
(5, '06/22', 'HBO', '06:00~07:20', '史酷比：格鬥狂熱迷', '', '動畫', '\r\n布蘭登維耶蒂 (Brandon Vietti)', '', '(2014)薛奇和史酷奇贏得世界摔角大賽的入場券，大夥坐上車準備到世界摔角城參與這場盛會。然而，一隻神秘的幽靈熊出現，威脅要破壞比賽。史酷奇、薛奇、葳瑪、黛芬和弗雷德必須和世界摔角大賽的超級明星Triple H、約翰希南、肯恩、米茲、布羅狄斯克雷、桑提諾馬瑞拉、辛卡拉及艾珍李合作破解此案。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583180&content_id=&ch_id=46&epg_name=史酷比：格鬥狂熱迷&stype=name', '06225', 0),
(6, '06/22', 'HBO', '07:20~09:00', '海底總動員', '', '動畫', ' \r\n安德魯史丹頓(Andrew Stanton)', '', '(2003)迪士尼皮克斯合作電腦動畫電影【海底總動員】首度在暑假推出，這是迪士尼公司以及皮克斯工作室繼【玩具總動員】、【 蟲蟲危機 】、【玩具總動員２】、【 怪獸電力公司 】後第五部合作推出的作品，故事來到了海底世界，主角則是一對小丑魚父子。有一天兒子 Nemo 從他們所居住的珊瑚礁被給抓走，被帶到澳洲的一家牙醫診所當中，魚爸爸Marlin 知道後心急如焚，為了找回他寶貝兒子，如今必須尋遍大海，跟上澳洲洋流才能帶回兒子，在途中他遇到形形色色的朋友，也遭遇各式各樣的危機，他到底能否克服萬難找到兒子呢？', 'http://www.niotv.com/epg_content.php?epg_no=1583181&content_id=&ch_id=46&epg_name=海底總動員&stype=name', '06226', 0),
(7, '06/22', 'HBO', '09:00~10:00', '無間警探_第2季 #1', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583182&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '06227', 0),
(8, '06/22', 'HBO', '10:00~10:30', '好球天團_第1季 #1', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583183&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06228', 0),
(9, '06/22', 'HBO', '10:30~11:00', '救世鼎立戰_第1季 #1', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583184&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '06229', 0),
(10, '06/22', 'HBO', '11:00~13:00', '終棘警探', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2007)尼可拉斯安傑是全倫敦最強的條子，破案率高達400%，遠遠凌駕於其他警察同僚之上。但安傑的表現實在太出色，要叫其他同事的臉往哪裡擺？所以上級決定將他發派「邊彊」，調到一個與犯罪絕緣的純樸小鎮去。 \n\r\n安傑一抵達山佛小鎮，就受到搭擋丹尼的超熱情歡迎，丹尼是老好人警長之子，更是頭號動作片迷，如今終於從大城市裡來了個夠格的條子，這讓丹尼相信，他那些槍戰、警車追逐的警察夢終於要實現了！可惜的是安傑對他那些小學生般的美夢並不領情，有夠煩的丹尼更讓英雄無用武之地的他日益沮喪。 \n\r\n某天大事件真的發生了，突然的意外襲捲小鎮，而安傑更發現這座小鎮不如外表看來平靜，某種陰謀正在等待他們去發掘…爆破、飆車追逐與槍戰也要從丹尼的夢想中走進現實，現在，是小鎮警察們團結起來執行正義的時候了！ ', 'http://www.niotv.com/epg_content.php?epg_no=1583185&content_id=&ch_id=46&epg_name=終棘警探&stype=name', '062210', 0),
(11, '06/22', 'HBO', '13:00~14:50', '超級選秀日', '', '劇情', ' \r\n伊凡萊蔓 (Ivan Reitman)', '', '(2014)面對球團內的壓力，敵對經理人的算計，甚至被開除的威脅，桑尼該如何在這超級選秀日中運籌帷幄、機關算盡，挑選出陣容最堅強的夢幻球隊呢？\n\r\n本片由《型男飛行日誌》製作團隊操刀，《飯飯之交》導演艾凡瑞特曼執導，《傑克萊恩︰詭影任務》凱文科斯納、《藥命俱樂部》珍妮佛嘉納領銜主演。 \n\r\n國家美式足球聯盟選秀日到來了，總經理桑尼威佛有權這天為克里夫蘭隊在第一輪優先挑選球員，但他必須面對上百個懷抱夢想的青年，並在專業和私人情感間做出正確決定。 \n\r\n同時，他也面臨球團內的壓力、敵對經理人的算計、被開除的威脅，要在這超級選秀日中運籌帷幄，挑選出陣容最堅強的夢幻球隊！ \n\r\n曾演出許多運動片的凱文科斯納表示並不想拍重複的故事，但他認為《超級選秀日》並未將重心放在球場上的比賽，而是探索比賽背後球隊營運的商業機密，因此有興趣演出，也拜訪了許多國家美式足球聯盟的球隊總經理。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583186&content_id=&ch_id=46&epg_name=超級選秀日&stype=name', '062211', 0),
(12, '06/22', 'HBO', '14:50~15:15', '好萊塢好好看 #602', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583187&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '062212', 0),
(13, '06/22', 'HBO', '15:15~17:25', '美麗境界', '', '歷史傳記', '\r\n朗霍華(Ron Howard)', '', '(2001)約翰奈許於1947年進入普林斯頓大學數學系研究所就讀，對普林斯頓大學來說，這名絕頂聰明但是個性偏激的傑出青年卻成為一名問題學生。他不但和同學無法相處，而且還時常曠課，他心中只有一個念頭：發明出一個原創理論。他深信這是成功的唯一方法。 雖然他的同儕都希望看到他失敗，但是卻在無意間激發出他的鬥志，有一天他們在酒吧閒聊，看到一名身材火辣的金髮美女，於是慫恿奈許去追她，但是這卻激發了他的靈感，促使他發現一個突破性的理論，後來他所寫的論文推翻了現代經濟學之父亞當史密斯一百五十年來牢不可破的經濟理論，從此改變了他的一生。 奈許以這篇論文得到在麻省理工學院的研究計畫和教職，當時世界正值冷戰時期，而他也希望能對美國有所貢獻，這時突然出現一名情治人員威廉帕奇，請他參與一項機密的解碼任務。他抓住機會全力投入這項任務，同時也在校內認識一位美麗的女學生愛莉莎賴德，這位傑出的研究生讓奈許接觸到一個他從來沒認真考慮過的概念，那就是愛情。 他們的感情進展神速，很快就決定結婚，但是奈許的機密任務也變得越來越危險，他完全沉迷在一個妄想的世界，他異常的行為舉止終於被診斷為妄想性的精神分裂症。 從這時開始他就開始了和精神病的長期抗爭，而他的妻子愛莉莎雖然飽受她丈夫異常行為的折磨，但是卻仍然守在他身邊，以她的愛包容他的瘋狂行徑，經過多年的奮鬥後，雖然他仍有不正常的幻覺，但是奈許卻能接受自己的精神異常，重返普林斯頓大學教書，並且於１９９４年獲得諾貝爾獎，而他的理論則成為二十世紀最有影響力的理論之一，証明了他不只是擁有一個絕頂聰明的腦袋，同時還擁有一個美麗的心靈.....', 'http://www.niotv.com/epg_content.php?epg_no=1583188&content_id=&ch_id=46&epg_name=美麗境界&stype=name', '062213', 0),
(14, '06/22', 'HBO', '17:25~18:55', '石頭族樂園2：賭城萬歲', '', '喜劇', '\r\n布萊恩拉文 (Brian Levant)', '', '(2000)史佛雷和賴巴尼在盤岩鎮的採石場工作，認識貝蒂與富家女史威瑪後，在快樂的四人約會後，雙雙墜入愛河，但是富有的賭場老闆奇普洛克斐對威瑪有不良企圖，他策劃陷阱將這四人引至"蠟石維加"，準備破壞這對佳偶，奪取史家家產……\n\r\n本片網羅英美影視界演員合力演出，包括崛起新星「脫線舞男」馬克艾迪與「七月四日誕生」史蒂芬鮑德溫，片中可愛的小恐龍等史前動物皆由得獎無數的吉姆漢森工作室打造，為觀眾帶來新鮮驚奇的感受。', 'http://www.niotv.com/epg_content.php?epg_no=1583189&content_id=&ch_id=46&epg_name=石頭族樂園2：賭城萬歲&stype=name', '062214', 0),
(15, '06/22', 'HBO', '18:55~21:00', '侏儸紀公園', '', '動作冒險', ' \r\n史蒂芬史匹柏(Steven Spielberg)', '', '(1993)億萬富翁李查艾登保祿邀請了兩位古生物學家羅拉鄧和山姆尼爾以及數學家傑夫高布倫一同前往他所開發的遊樂園：活生生的野生恐龍主題公園，進行勘察與背書。而一同前行的還包括億萬富翁兩個可愛的孫女孫子。勘察的日子來臨，但發現其中隱藏的問題卻不是想像中那麼簡單，一場可怕的災難即將降臨至他們這群人身上……。', 'http://www.niotv.com/epg_content.php?epg_no=1583190&content_id=&ch_id=46&epg_name=侏儸紀公園&stype=name', '062215', 0),
(16, '06/22', 'HBO', '21:00~22:00', '無間警探_第2季 #1', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583191&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '062216', 0),
(17, '06/22', 'HBO', '22:00~22:30', '好球天團_第1季 #1', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583192&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '062217', 0),
(18, '06/22', 'HBO', '22:30~23:00', '救世鼎立戰_第1季 #1', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583193&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '062218', 0),
(19, '06/22', 'HBO', '23:00~01:05', '浴血任務3', '', '動作冒險', ' \r\n派屈克休斯 (Patrick Hughes)', '', '(2014)多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。\n\r\n《浴血任務》系列前2集熱賣171億元台幣，因此原班人馬這次推出續集，並加入新的老牌硬漢主演。這次演員陣容包括了阿諾史瓦辛格、席維斯史塔龍、安東尼歐班德拉斯、梅爾吉勃遜、拳王維克多奧提茲以及李連杰等將一同演出。 \n\r\n巴尼（席維斯史特龍飾）、聖誕（傑森史塔森飾）和陰陽（李連杰 飾）等人這回對上了「浴血幫」的另一元老康拉德史東班克斯（梅爾吉勃遜 飾）。多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。 \n\r\n面對這個昔日夢魘並空前強大的惡勢力，一向出奇制勝的巴尼招募一批年輕力盛並具有高科技能力的「浴血新兵」，一場新舊對決的史上最強「浴血大戰」就此展開。 \n\r\n首度加入演出的安東尼奧班德拉斯親力親為，除了從大樓往直昇機上跳之外，一連串的爆破等精彩動作與特技都親自上陣。而在一票硬漢巨星中，《浴血任務3》還找來曾代表美國拿下北京奧運銅牌的格鬥美女龍達魯西，將在片中有精彩的拳腳演出。', 'http://www.niotv.com/epg_content.php?epg_no=1583194&content_id=&ch_id=46&epg_name=浴血任務3&stype=name', '062219', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150623`
--

CREATE TABLE IF NOT EXISTS `t20150623` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150623`
--

INSERT INTO `t20150623` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/23', 'HBO', '23:00~01:05', '浴血任務3', '', '動作冒險', ' \r\n派屈克休斯 (Patrick Hughes)', '', '(2014)多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。\n\r\n《浴血任務》系列前2集熱賣171億元台幣，因此原班人馬這次推出續集，並加入新的老牌硬漢主演。這次演員陣容包括了阿諾史瓦辛格、席維斯史塔龍、安東尼歐班德拉斯、梅爾吉勃遜、拳王維克多奧提茲以及李連杰等將一同演出。 \n\r\n巴尼（席維斯史特龍飾）、聖誕（傑森史塔森飾）和陰陽（李連杰 飾）等人這回對上了「浴血幫」的另一元老康拉德史東班克斯（梅爾吉勃遜 飾）。多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。 \n\r\n面對這個昔日夢魘並空前強大的惡勢力，一向出奇制勝的巴尼招募一批年輕力盛並具有高科技能力的「浴血新兵」，一場新舊對決的史上最強「浴血大戰」就此展開。 \n\r\n首度加入演出的安東尼奧班德拉斯親力親為，除了從大樓往直昇機上跳之外，一連串的爆破等精彩動作與特技都親自上陣。而在一票硬漢巨星中，《浴血任務3》還找來曾代表美國拿下北京奧運銅牌的格鬥美女龍達魯西，將在片中有精彩的拳腳演出。', 'http://www.niotv.com/epg_content.php?epg_no=1583194&content_id=&ch_id=46&epg_name=浴血任務3&stype=name', '06231', 0),
(2, '06/23', 'HBO', '01:05~03:00', '伊莉莎白：輝煌年代', '', '歷史傳記', '\r\n謝科卡普 (Shekhar Kapur)', '', '(2007)本片為曾獲得多項奧斯卡提名的《伊莉莎白》的續集，凱特布蘭琪主演。影片緊接著《伊莉莎白》沒有講完的史實，講述這位女王帶領英國走向世界霸主的過程，加入由克萊夫歐文所扮演的華特羅利角色。 \n\r\n1589年，伊莉莎白一世(凱特布蘭琪飾)統治英國將近30年，卻仍然受到王室成員背叛的威脅。這時位於對岸的歐洲諸國由西班牙國王菲利浦二世(荷帝莫拉飾)正率領一股天主教基本教義派的風暴襲捲歐洲。菲利浦二世仗著羅馬教廷宗教大審判的撐腰，以及西班牙在海上所向無敵的艦隊，對伊莉莎白一世及她統治的英國造成不容忽視的威脅，因為當時英國的國教已經改為基督新教，因此西班牙國王菲利浦二世一心想要讓伊莉莎白一世這名異端女王下台，讓英國重返羅馬天主教廷的榮耀。 \n\r\n伊莉莎白一世為了捍衛英國，不惜和勢力強大的菲利浦二世展開大戰，同時又不自主地愛上平民身份的華特羅利(克里夫歐文飾)，這段不可能有結果的戀情讓伊莉莎白一世身心備受煎熬。 \n\r\n她為了讓華特羅利待在她身邊，故意鼓勵她最寵愛的侍女貝絲(艾碧蔻妮希飾)和他交往。但是她的這種做法也讓自己陷入痛苦的深淵，因為她必須眼睜睜看著自己心愛的男人和她的侍女發展親蜜關係。 \n\r\n伊莉莎白女王深深受到相貌堂堂、熱愛冒險的華特羅利的吸引，對她來說，他不只是在心與靈上和她契合的對象，也代表了她從未嚐過的自由。但是她受限於英國王室的傳統，不能與平民百姓交往，只能抱著破碎的的心靈，被迫在成為一國之君和一個女人之間做出抉擇。 \n\r\n正當伊莉莎白一世蓄勢待發，準備和西班牙展開大戰的同時，她最信任的國務大臣法蘭西斯沃辛漢也繼續運用他高超的政治手腕，鞏固伊莉莎白一世絕對的權力。沃辛漢透過綿密複雜的情報網，揭發一場企圖推翻英國王位的暗殺行動，而且出乎他的意料之外，其中一名叛亂份子竟然是伊莉莎白的親表妹，蘇格蘭女王瑪麗斯圖亞特(珊曼莎摩頓飾)，而他不知不覺正將英國帶向毀滅之路。', 'http://www.niotv.com/epg_content.php?epg_no=1583195&content_id=&ch_id=46&epg_name=伊莉莎白：輝煌年代&stype=name', '06232', 0),
(3, '06/23', 'HBO', '03:00~04:25', '蠻荒歷險記', '', '動畫', '\r\n凱西麥凱森 (Cathy Malkasian)', '', '(2002)這部動畫是取材自五分錢電影院大受歡迎的電視影集。伊莉莎（拉塞查伯特配音，「辣妹過招」、「奶爸安親班」）是個愛冒險的12歲小孩，擁有和動物交談的能力。她極想拯救一頭幼豹免於被獵人捕殺，因此搭船前往倫敦的寄宿學校，然而到了倫敦後，她感到非常不適應，極想回到故鄉塞倫蓋提大草原。在室友的幫助下，伊莉莎拿到一張回非洲的船票，她卻意外發現獵人史龍和布里（由魯伯特艾瑞特，「 新娘不是我」、「 仲夏夜之夢」與奧斯卡得主瑪莉莎湯美，「 意外邊緣」、「 男人百分百」、「 性福大師」擔任配音）有個更凶殘的計劃，意圖想獵捕象群，並將之殺害以取得珍貴漂亮的象牙。伊莉莎瞭解到自己掌握著家人和心愛動物的命運，必須起之與壞人對抗！', 'http://www.niotv.com/epg_content.php?epg_no=1583196&content_id=&ch_id=46&epg_name=蠻荒歷險記&stype=name', '06233', 0),
(4, '06/23', 'HBO', '04:25~06:00', '出竅情人', '', '愛情文藝', '\r\n馬克華特斯 (Mark Waters)', '', '(2005)大衛(馬克‧魯法洛飾演)是個景觀設計師，新近喪偶的他為了平復心情，住進了舊金山一棟美麗的公寓中。不過事與願違，他發現前任房客伊莉莎白(瑞絲‧薇斯朋飾演)還沒將東西清空，甚至能夠隨意進出公寓，進而干擾了他的新生活。伊莉莎白其實是個急診室醫生，因為全心全意地投入工作中，而從未好好享受人生，固執的她堅稱自己仍住在公寓中，還不明白自己因為三個月以前的一樁意外而陷入昏迷。大衛的遷入讓伊莉莎白逐漸了解事情的真相，兩人也互相為彼此吸引，而他們是否能在所剩無幾的時間內讓伊莉莎白起死回生呢？', 'http://www.niotv.com/epg_content.php?epg_no=1583197&content_id=&ch_id=46&epg_name=出竅情人&stype=name', '06234', 0),
(5, '06/23', 'HBO', '06:00~07:35', '石頭族樂園2：賭城萬歲', '', '喜劇', '\r\n布萊恩拉文 (Brian Levant)', '', '(2000)史佛雷和賴巴尼在盤岩鎮的採石場工作，認識貝蒂與富家女史威瑪後，在快樂的四人約會後，雙雙墜入愛河，但是富有的賭場老闆奇普洛克斐對威瑪有不良企圖，他策劃陷阱將這四人引至"蠟石維加"，準備破壞這對佳偶，奪取史家家產……\n\r\n本片網羅英美影視界演員合力演出，包括崛起新星「脫線舞男」馬克艾迪與「七月四日誕生」史蒂芬鮑德溫，片中可愛的小恐龍等史前動物皆由得獎無數的吉姆漢森工作室打造，為觀眾帶來新鮮驚奇的感受。', 'http://www.niotv.com/epg_content.php?epg_no=1583198&content_id=&ch_id=46&epg_name=石頭族樂園2：賭城萬歲&stype=name', '06235', 0),
(6, '06/23', 'HBO', '07:35~09:20', '今天暫時停止', '', '劇情', ' \r\n哈洛雷米斯(Harold Ramis)', '', '(1993)如果你有一天醒來，發現自己從此將日復一日，過著完全一樣的日子，你會有何反應？性格"顧人怨"的氣象播報員菲爾(比爾莫瑞，「王牌保齡球」)便面臨了這令人哭笑不得的詭異情境；菲爾奉命到一處小鎮報導當地頗富盛名的"土撥鼠日"盛會，在短短的一天之中，周遭所有人都領教到他令人不敢恭維的壞脾氣，包括美麗的製作人莉塔(安蒂麥道威爾，「妳是我今生的新娘」)。\n\r\n  原本打算採訪完當天便趕回城市的一行人，卻因大風雪而被迫在鎮上停留一日，然而，第二天早上醒來後不久，菲爾便發現自己不知為何原因，竟被困在二月二日這一天！他要用什麼方法才能擺脫這個可怕的夢魘？這部充滿奇想和現代寓言意味的傑出喜劇片，曾獲得英國金像獎最佳原著劇本以及倫敦影評人協會年度最佳劇本。', 'http://www.niotv.com/epg_content.php?epg_no=1583199&content_id=&ch_id=46&epg_name=今天暫時停止&stype=name', '06236', 0),
(7, '06/23', 'HBO', '09:20~11:00', '給我一個家', '', '劇情', '\r\nRon Krauss\r\n演員', '', '(2013)懷孕少女艾尼格絲（凡妮莎哈金 飾）逃離虐待她的母親，並想尋找她的父親收留，但他的父親卻有了另一個家庭而拒絕了艾尼格絲的請求，被迫在街頭生存，直到富有同情心的陌生人提供了一個庇護所，讓她的人生有了希望的轉折…。本片由《歌舞青春》凡妮莎哈金、《索命記憶》蘿莎莉道森以及《神鬼傳奇》布蘭登費雪主演，影片勾勒出新世代的社會問題，而溫暖的筆觸令人動容！', 'http://www.niotv.com/epg_content.php?epg_no=1583200&content_id=&ch_id=46&epg_name=給我一個家&stype=name', '06237', 0),
(8, '06/23', 'HBO', '11:00~11:30', '好球天團_第1季 #1', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583201&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06238', 0),
(9, '06/23', 'HBO', '11:30~12:00', '救世鼎立戰_第1季 #1', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583202&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '06239', 0),
(10, '06/23', 'HBO', '12:00~13:00', '無間警探_第2季 #1', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583203&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '062310', 0),
(11, '06/23', 'HBO', '13:00~15:10', '浴血任務3', '', '動作冒險', ' \r\n派屈克休斯 (Patrick Hughes)', '', '(2014)多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。\n\r\n《浴血任務》系列前2集熱賣171億元台幣，因此原班人馬這次推出續集，並加入新的老牌硬漢主演。這次演員陣容包括了阿諾史瓦辛格、席維斯史塔龍、安東尼歐班德拉斯、梅爾吉勃遜、拳王維克多奧提茲以及李連杰等將一同演出。 \n\r\n巴尼（席維斯史特龍飾）、聖誕（傑森史塔森飾）和陰陽（李連杰 飾）等人這回對上了「浴血幫」的另一元老康拉德史東班克斯（梅爾吉勃遜 飾）。多年前走入歧途的康拉德成為心狠手辣的軍火販子，也因而成為巴尼受命剷除的頭號目標，但巴尼萬萬沒想到的是，並沒有被他刺殺成功的康拉德捲土重來，並誓死殲滅浴血幫。 \n\r\n面對這個昔日夢魘並空前強大的惡勢力，一向出奇制勝的巴尼招募一批年輕力盛並具有高科技能力的「浴血新兵」，一場新舊對決的史上最強「浴血大戰」就此展開。 \n\r\n首度加入演出的安東尼奧班德拉斯親力親為，除了從大樓往直昇機上跳之外，一連串的爆破等精彩動作與特技都親自上陣。而在一票硬漢巨星中，《浴血任務3》還找來曾代表美國拿下北京奧運銅牌的格鬥美女龍達魯西，將在片中有精彩的拳腳演出。', 'http://www.niotv.com/epg_content.php?epg_no=1583204&content_id=&ch_id=46&epg_name=浴血任務3&stype=name', '062311', 0),
(12, '06/23', 'HBO', '15:10~16:50', '辣媽辣妹', '', '家庭溫馨', '\r\n馬克華特斯(Mark Waters)', '', '(2003)泰絲是個獨力扶養一對兒女的單親媽媽，但是她同時也是個專業的心理醫師，專門幫病人排解心理問題。但是泰絲似乎完全無法理解正值青春期的大女兒─安娜的心理。泰絲與論及婚嫁的男友準備在星期五晚間舉行婚禮的預演，但是身為伴娘的安娜卻有個非到不可的演唱會。為此兩人在晚餐時發生一段爭吵，隔天一覺醒來兩人同時發現兩人的身體居然互換。在尚未找出解決辦法以前，兩人必須角色互換，媽媽泰絲得去安娜的學校上學，而女兒安娜則是得到診所去赴泰絲與病人的約會。一天的時間內，兩人的生活被搞的 天翻地 覆 ，但是兩人卻也逐漸了解對方的想法。', 'http://www.niotv.com/epg_content.php?epg_no=1583205&content_id=&ch_id=46&epg_name=辣媽辣妹&stype=name', '062312', 0),
(13, '06/23', 'HBO', '16:50~18:55', '戰火情人', '', '愛情文藝', '\r\n馬丁坎貝爾(Martin Campbell)', '', '(2003)一段在戰火中滋長的淒美愛情，一對在戰火中共患難的苦命鴛鴦。莎拉(奧斯卡暨金球獎得主安潔莉娜裘莉，「史密斯任務」、「古墓奇兵：風起雲湧」)是個嫁給英國工業鉅子的美國女子，過著安逸的生活，但是當英俊反骨的醫生尼克(榮獲奧斯卡暨金球獎提名的克里夫歐文，「偷情」、「萬惡城市」、「亞瑟王」)進入她的生活後，她的世界開始動搖。尼克積極地呼籲世人援助戰火頻仍的非洲，莎拉為他的熱情深深感動，因此莎拉展開了她的非洲之旅。這趟危險的旅程帶領她前往一個未知的世界，也讓她開始ㄧ段刻骨銘心的愛情。', 'http://www.niotv.com/epg_content.php?epg_no=1583206&content_id=&ch_id=46&epg_name=戰火情人&stype=name', '062313', 0),
(14, '06/23', 'HBO', '18:55~21:00', '侏儸紀公園2：失落的世界', '', '動作冒險', '\r\n史蒂芬史匹柏 (Steven Spielberg)', '', '(1997)在《失落的世界-侏羅紀公園》中，人類不但要對抗兇猛的恐龍，還得彼此勾心鬥角，也許人心的險惡還勝過恐龍呢！而這集的故事內容是說，「侏羅紀公園」的創造者約翰哈蒙德的姪子，無所不用其極的想把「侏羅紀公園」的恐龍賣給全球的動物園，想藉此大撈一筆，他姪子找來了獵人小組幫助他完成這項野心！哈德蒙得知他姪子的計劃後，就立刻請來伊恩馬康姆博士和茱莉安摩爾飾演的古代生物學家，不顧一切的來拯救恐龍﹗在這場人與恐龍的大戰中，根據導演的透露，許多人都不可避免的成為"食物鏈中的犧牲品"，其實這種情況與人類社會也是挺相似的。\n\r\n《失落的世界-侏羅紀公園2》是好萊塢黃金票房大導演史蒂芬史匹柏，在拍完《辛德的名單》之後休息三年再持導演筒的新作，《辛德的名單》使得史蒂芬史匹柏的導演生涯走向巔峰，因為在此之前史蒂芬史匹柏的作品一直都是票房的保証，但卻都與奧斯卡金像獎無緣，這難免會使咱們的大導演心中感到些許遺憾，但《辛德勒的名單》可讓史匹柏板回了十足的面子！證明他不但能拍充滿娛樂價值的賣座電影，那種符合學院派欣賞具有高度內涵的題材，他拍起來也是絲毫都不含糊！而史匹柏在休息了三年後，以選擇拍攝《失落的世界-侏羅紀公園2》當作再出發的作品其實也是一項很大的挑戰，因為續集的作品對觀眾來講，可能會有一種已經沒有第一次觀看此片時大開眼界的驚喜情況，而要如何再創造出新的故事架構及高潮，吸引觀眾再進戲院觀賞續集，這是相當不容易的一件事，但對史蒂芬史匹柏來說，這是一項對自己能力的莫大考驗。', 'http://www.niotv.com/epg_content.php?epg_no=1583207&content_id=&ch_id=46&epg_name=侏儸紀公園2：失落的世界&stype=name', '062314', 0),
(15, '06/23', 'HBO', '21:00~22:25', '國定殺戮日', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583208&content_id=&ch_id=46&epg_name=國定殺戮日&stype=name', '062315', 0),
(16, '06/23', 'HBO', '22:25~00:10', '國定殺戮日：無法無天', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583209&content_id=&ch_id=46&epg_name=國定殺戮日：無法無天&stype=name', '062316', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150624`
--

CREATE TABLE IF NOT EXISTS `t20150624` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150624`
--

INSERT INTO `t20150624` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/24', 'HBO', '22:25~00:10', '國定殺戮日：無法無天', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583209&content_id=&ch_id=46&epg_name=國定殺戮日：無法無天&stype=name', '06241', 0),
(2, '06/24', 'HBO', '00:10~02:00', '生命沒有歸處', '', '劇情', ' \r\n威廉梅西 (William H. Macy)', '', '(2014)一個傷心絕望的父親在家中打掃時，無意間找到了剛去世的兒子生前錄製的demo帶和歌詞。被這從未發現的才華震懾，父親組了一個樂團，希望為兒子一圓生前的夢。', 'http://www.niotv.com/epg_content.php?epg_no=1583210&content_id=&ch_id=46&epg_name=生命沒有歸處&stype=name', '06242', 0),
(3, '06/24', 'HBO', '02:00~04:15', '美麗境界', '', '歷史傳記', '\r\n朗霍華(Ron Howard)', '', '(2001)約翰奈許於1947年進入普林斯頓大學數學系研究所就讀，對普林斯頓大學來說，這名絕頂聰明但是個性偏激的傑出青年卻成為一名問題學生。他不但和同學無法相處，而且還時常曠課，他心中只有一個念頭：發明出一個原創理論。他深信這是成功的唯一方法。 雖然他的同儕都希望看到他失敗，但是卻在無意間激發出他的鬥志，有一天他們在酒吧閒聊，看到一名身材火辣的金髮美女，於是慫恿奈許去追她，但是這卻激發了他的靈感，促使他發現一個突破性的理論，後來他所寫的論文推翻了現代經濟學之父亞當史密斯一百五十年來牢不可破的經濟理論，從此改變了他的一生。 奈許以這篇論文得到在麻省理工學院的研究計畫和教職，當時世界正值冷戰時期，而他也希望能對美國有所貢獻，這時突然出現一名情治人員威廉帕奇，請他參與一項機密的解碼任務。他抓住機會全力投入這項任務，同時也在校內認識一位美麗的女學生愛莉莎賴德，這位傑出的研究生讓奈許接觸到一個他從來沒認真考慮過的概念，那就是愛情。 他們的感情進展神速，很快就決定結婚，但是奈許的機密任務也變得越來越危險，他完全沉迷在一個妄想的世界，他異常的行為舉止終於被診斷為妄想性的精神分裂症。 從這時開始他就開始了和精神病的長期抗爭，而他的妻子愛莉莎雖然飽受她丈夫異常行為的折磨，但是卻仍然守在他身邊，以她的愛包容他的瘋狂行徑，經過多年的奮鬥後，雖然他仍有不正常的幻覺，但是奈許卻能接受自己的精神異常，重返普林斯頓大學教書，並且於１９９４年獲得諾貝爾獎，而他的理論則成為二十世紀最有影響力的理論之一，証明了他不只是擁有一個絕頂聰明的腦袋，同時還擁有一個美麗的心靈.....', 'http://www.niotv.com/epg_content.php?epg_no=1583211&content_id=&ch_id=46&epg_name=美麗境界&stype=name', '06243', 0),
(4, '06/24', 'HBO', '04:15~06:00', '陰兒房第2章：陰魂守舍', '', '靈異驚悚', ' \r\n詹姆斯溫 (James Wan)', '', '(2013)令人毛骨悚然的《陰兒房》續集。受幽靈侵擾的藍伯特一家人試圖挖掘那個導致他們與惡靈產生危險連結的神秘的童年秘密。他們必須依靠家人的力量驅逐緊跟他們不放的惡靈，同時揭露這個秘密，但一切都必須趕在它繼續奪命之前。\n\r\n《厲陰宅》華裔導演溫子仁和編劇雷沃納爾再度合作，加上《陰兒房》原班人馬，有口皆碑的幕前幕後人員合力拍攝《陰兒房第２章:陰魂守舍》，延續第一集的故事與風格。 \n\r\n蘭伯特一家滿心歡喜地準備開始新生活，卻在某天，蘭伯特家的兒子收到一件禮物，在那之後，他們所期待的新生活開始起了變化……。蘭伯特家的屋子開始出現無法以科學解釋的詭異現象，像是家中忽然出現一名輕飄飄的白衣女子，留下一抹詭異的微笑就消失不見……等事件。 \n\r\n蘭伯特家開始著手調查，漸漸整理出事情的輪廓，並發現這一連串靈異現象的背後隱藏著不為人知的秘密。然而，就在挖掘秘密的過程當中，蘭伯特家卻在無意間與「另一個世界」產生了危險的連結……。 \n\r\n本片配樂採用同一首童謠貫穿全片，暗指片中關於童年陰影的背後原因；至於溫子仁導演在《奪魂鋸》中利用密閉空間營造驚悚氣氛的手法也在本片中重現。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583212&content_id=&ch_id=46&epg_name=陰兒房第2章：陰魂守舍&stype=name', '06244', 0),
(5, '06/24', 'HBO', '06:00~07:25', '餘燼追思', '', '劇情', '\r\nJim Simpson \r\n', '', '(2002)尼克（金球獎得主安東尼拉帕格利亞，《老大靠邊閃》）是紐約消防隊隊長，在911事件發生時，為了撤空紐約世貿大樓，他的12名隊友有8名喪生其中，他內心的傷痛可想而知。但是尼克是個不擅言語的人，如此便很難抒發他的情緒，經驗豐富的記者瓊安（雪歌妮薇佛，《異形》、《陰森林》）決心要幫助他。在911過後的連續幾天，瓊安訪問了尼克，藉此他得以用言語，來悼念那些英勇的救火兄弟。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583213&content_id=&ch_id=46&epg_name=餘燼追思&stype=name', '06245', 0),
(6, '06/24', 'HBO', '07:25~09:05', '生命沒有歸處', '', '劇情', ' \r\n威廉梅西 (William H. Macy)', '', '(2014)一個傷心絕望的父親在家中打掃時，無意間找到了剛去世的兒子生前錄製的demo帶和歌詞。被這從未發現的才華震懾，父親組了一個樂團，希望為兒子一圓生前的夢。', 'http://www.niotv.com/epg_content.php?epg_no=1583214&content_id=&ch_id=46&epg_name=生命沒有歸處&stype=name', '06246', 0),
(7, '06/24', 'HBO', '09:05~10:45', '辣媽辣妹', '', '家庭溫馨', '\r\n馬克華特斯(Mark Waters)', '', '(2003)泰絲是個獨力扶養一對兒女的單親媽媽，但是她同時也是個專業的心理醫師，專門幫病人排解心理問題。但是泰絲似乎完全無法理解正值青春期的大女兒─安娜的心理。泰絲與論及婚嫁的男友準備在星期五晚間舉行婚禮的預演，但是身為伴娘的安娜卻有個非到不可的演唱會。為此兩人在晚餐時發生一段爭吵，隔天一覺醒來兩人同時發現兩人的身體居然互換。在尚未找出解決辦法以前，兩人必須角色互換，媽媽泰絲得去安娜的學校上學，而女兒安娜則是得到診所去赴泰絲與病人的約會。一天的時間內，兩人的生活被搞的 天翻地 覆 ，但是兩人卻也逐漸了解對方的想法。', 'http://www.niotv.com/epg_content.php?epg_no=1583215&content_id=&ch_id=46&epg_name=辣媽辣妹&stype=name', '06247', 0),
(8, '06/24', 'HBO', '10:45~12:25', '對面的惡女看過來', '', '愛情文藝', ' \r\n吉爾楊格 (Gil Junger)', '', '(1999)史塞福家二個姐妹有個截然不同的性格，他們唯一共同之處就是他們是全校唯二沒有約會的女生。史家老爸有條苛刻的規定，妹妹畢安卡（賴瑞莎歐蕾尼可飾）在高中畢業前不得有約會，除非怪胎姊姊，凱特（茱莉亞史緹爾飾）先找到約會的對象。這可是個難題，因為沒有人願意跟凱特約會。\n\r\n　新來的轉學生，柯邁隆（約塞夫高登盧維特飾）對畢安卡一見鍾情。在聽聞史家的家規後，他與死黨麥克（大衛克萊姆赫茲飾） 決定利用也喜歡畢安卡的大帥哥─喬依的錢財買通校園裡另一個公認的大怪胎派崔克（希斯萊傑）去約凱特。誰知凱特兇猛無比連派崔克都難以將其馴服。\n\r\n　凱特，這個桀傲不屈的世紀末最大惡女到底有沒有人可以收服她呢？有喬依從中作梗，經過一連串的努力的柯邁隆，是否可以美夢成真與畢安卡約會呢？', 'http://www.niotv.com/epg_content.php?epg_no=1583216&content_id=&ch_id=46&epg_name=對面的惡女看過來&stype=name', '06248', 0),
(9, '06/24', 'HBO', '12:25~14:05', '國定殺戮日：無法無天', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583217&content_id=&ch_id=46&epg_name=國定殺戮日：無法無天&stype=name', '06249', 0),
(10, '06/24', 'HBO', '14:05~16:00', '地獄醫院', '', '靈異驚悚', '\r\n布萊德艾德森 (Brad Anderson)', '', '(2014)本片改編自愛倫·坡短篇小說《塔爾博士和費瑟爾教授的療法》(The System of Doctor Tarr and Professor Fether)，講述一個精神病院的醫生愛上了美麗女病患的故事。 \n\r\n一位哈佛醫科畢業的學生來到一家精神病院就職，一開始他並沒有發現任何異常，但隨著時間的推移，他逐漸注意到醫院已經被那些歇斯底里的病人們所控制，醫生護士都成為了可憐的犧牲品。', 'http://www.niotv.com/epg_content.php?epg_no=1583218&content_id=&ch_id=46&epg_name=地獄醫院&stype=name', '062410', 0),
(11, '06/24', 'HBO', '16:00~17:35', '家有跳狗', '', '家庭溫馨', ' \r\n傑羅素(Jay Russell)', '', '(2000)溫馨喜劇「家有跳狗」是得獎暢銷作家威利莫里斯的童年自傳所改編，描述他與小狗史奇間的深刻友誼。這段童年往事不但改變了他的生活，並且成為他一生中最重要的時光。在1942年密西西比州亞肅鎮的八歲小男孩—威利身上。天性害羞沈靜的他一看到生人就渾身不自在，見到女孩子更是尷尬。於是威利成為學校中被玩弄的倒楣鬼，久而久之，自信心難以建立，加上是家中獨子，一個人過著安靜封閉的生活。 爸爸傑克（凱文貝肯飾）是個因傷光榮退役的軍人，看似堅強，其實脆弱，過度保護小威利，怕他受傷害。媽媽愛倫（黛安蓮恩飾）剛好相反，知道威利需要朋友建立信心，於是就在他九歲生日那一天，送了一隻可愛的小獵犬—史奇作為生日禮物。雖然爸爸極力反對，認為威利還負不起養狗的責任，但媽媽卻努力爭取，要幫威利找個知己。媽媽這招果然奏效，小狗史奇與威利從此形影不離，成了患難之交，但威利從沒想到，這隻狗不但建立他的信心，更長遠的影響了他的一生。 史奇活潑外向的個性，幫助威利追到校花麗芙，也與欺負他的小孩們打成一片，甚至加入了棒球隊，證明威利也有好動的一面。他們共同探險、解決麻煩，全鎮每個角落幾乎都有他們的足跡。史奇讓威利的成長不再寂寞，童年成為一生中最燦爛的歲月。因為史奇，威利不但發現了自己的潛能，更發現了豐富的人生。', 'http://www.niotv.com/epg_content.php?epg_no=1583219&content_id=&ch_id=46&epg_name=家有跳狗&stype=name', '062411', 0),
(12, '06/24', 'HBO', '17:35~19:40', '新娘百分百', '', '愛情文藝', ' \r\n羅傑米歇爾 (Roger Michell)', '', '(1999)威廉塞克(休葛蘭飾)住在倫敦西部的諾丁丘，他已經離婚，和一位行為怪異、不修邊幅的室友史派克(賴斯伊凡斯飾)住在一起，並在諾丁丘的中心，擁有一家慘澹經營的旅遊書店。一個平凡無奇的星期三，威廉赫然發現世界最紅的電影明星安娜史考特(茱莉亞羅勃茲飾)走進店裡，也走進了他的生命中，在一個陰錯陽差的偶然機會裡，好萊塢最紅的明星竟然親了一個倫敦的書店主人，兩人都不明白為什麼會發生這種事，但故事就從威廉濺灑安娜一身的柳橙汁開始。\n\r\n 　從此，威廉一成不變的生活起了漣猗，在一次電話聯絡裡，安娜邀他去飯店喝茶，但是他挑的時候不對，他被擠在一堆採訪安娜的記者裡面。他最後只好假裝成一位雜誌記者，並在她的經紀人面前問安娜一部自己沒看過的電影，但最後訪問卻很成功，安娜也答應和他約會，但是當晚威廉必須參加朋友的一個生日宴會。\n\r\n　接下來發生的事是每個男人的夢想--威廉挽著全世界最有名的女人的手，走進了朋友的大門，威廉度過了一個美好的夜晚。當他們並肩走過諾丁丘的花園，回到了飯店，卻發現安娜的男朋友從美國飛了過來，威廉只好帶著一顆破碎的心逃了出來。\n\r\n　 威廉渡過了一段失意的日子，半年之後，安娜為了逃開裸照風波，又來到了倫敦找威廉，整整一個禮拜裡，安娜與威廉同住，兩人再次陷入愛河。威廉能把握這次的機會嗎？住在諾丁丘的書店主人真的能夠排除萬難，贏得好萊塢巨星的芳心嗎？兩人要如何面對他們不同的身分，做出抉擇？ 本片結局讓全世界的新聞媒體都大吃一驚。', 'http://www.niotv.com/epg_content.php?epg_no=1583220&content_id=&ch_id=46&epg_name=新娘百分百&stype=name', '062412', 0),
(13, '06/24', 'HBO', '19:40~21:00', '驚聲尖笑4', '', '喜劇', '\r\n大衛查克(David Zucker)', '', '(2006)深受歡迎的惡搞電影「驚聲尖笑」第四度出擊！這回目標對準「不死咒怨」、「奪魂鋸」、「世界大戰」、「斷背山」、「陰森林」、「登峰造擊」等賣座電影，更把玩笑開到麥可傑克森、湯姆克魯斯頭上，對這些大明星極盡調侃戲謔。再次大收旺場，全美取得逾九千美元票房。\n\r\n   這回辛蒂(安娜法莉絲)找到一份居家看護的工作，不料這屋子有怪異現象，幸好鄰居湯姆頻頻送上關懷。原以為就要墜入愛河，豈料此時，外星生物突然侵略地球，辛蒂也發現原來屋裡有個日本小男孩的鬼魂。儘管美國總統(萊斯里尼爾森)聲稱已掌握反制外星人的方法，但唯有辛蒂了解，只有日本小鬼的親生父親才能制止外星人的攻擊。為了地球的存亡，辛蒂與阿湯哥只能暫時分開。在恐怖外星人和陰魂不散的鬼魅糾纏下，辛蒂將如何逃過追殺，找得小鬼生父，以拯救全世界? ', 'http://www.niotv.com/epg_content.php?epg_no=1583221&content_id=&ch_id=46&epg_name=驚聲尖笑4&stype=name', '062413', 0),
(14, '06/24', 'HBO', '21:00~23:00', '浪人47', '', '動作冒險', '\r\n卡爾里辛(Carl Rinsch) \r\n', '', '(2013)重拍1947年的同名日本電影。基努李維、真田廣之、淺野忠信、菊地凛子主演。以西方的敘述手法重新打造日本著名歷史「忠臣藏」的故事。\n\r\n本片由卡爾里辛執導，基努李維主演，以西方的敘述手法，融入獨特的奇幻特效和生猛異獸，重新改編18世紀日本江戶時代最悲壯的復仇事件「忠臣藏」。 \n\r\n1800年代的日本是一個虛無縹緲的國度，充滿暴戾之氣和懾人之美，也是歷史和幻想的交界處。一群日本武士因主子遇害身亡而慘遭流放，從此過著顛沛流離的生活，為了報仇並洗脫污名，他們決定向曾被放逐的混血浪人（基努李維飾）尋求協助；這名曾被驅逐而淪為奴隸的浪人是至今最致命的殺手，他將帶領這群落魄武士穿越妖魔蟄伏、危機重重的蠻荒異域，向仇敵步步追擊。 \n\r\n這個在日本家喻戶曉的故事曾經過不同年代的改編，如今又被賦予新意；47名浪人赤膽忠心、視死如歸的傳奇將再次驚奇呈現。\n\r\n除了巨星基努李維，這部3D史詩動作冒險片也號召了一群相當受歡迎的日本演員，包括《末代武士》真田廣之、《雷神索爾2：黑暗世界》淺野忠信、曾獲金獎提名的菊地凜子、《在世界的中心呼喊愛情 》柴崎幸。', 'http://www.niotv.com/epg_content.php?epg_no=1583222&content_id=&ch_id=46&epg_name=浪人47&stype=name', '062414', 0),
(15, '06/24', 'HBO', '23:00~00:00', '無間警探_第2季 #1', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583223&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '062415', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150625`
--

CREATE TABLE IF NOT EXISTS `t20150625` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150625`
--

INSERT INTO `t20150625` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/25', 'HBO', '00:00~01:20', '化妝間那些事', '', '喜劇', ' \r\nMJ狄蘭尼(M.J. Delaney)\r\n演員', '', '(2013)和大學同學重聚的珊重新評估自己的生活，她編造出一個完美的表象，來說服自己和朋友她已經擁有了一切。 \n\r\n然而當她那三個不按牌理出牌的熱心好友插手時，她精心的偽裝便開始在菸酒及化妝間裡的胡鬧行為下瓦解。面對一些殘酷真相的同時，珊必須努力對自己坦承，並認真評估她真正想要的生活。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583224&content_id=&ch_id=46&epg_name=化妝間那些事&stype=name', '06251', 0),
(2, '06/25', 'HBO', '01:20~02:55', '強棒巨猩', '', '喜劇', ' \r\n比爾科特利 (Bill Couturie)', '', '(1996)乍看之下，本片想必是個「動物災難電影」，一個男人被一隻猩猩弄得團團轉？不過事實上，不但娛樂效果極佳，而且令人開懷大笑，令人意想不到的愉悅驚喜。這個男人就是麥特拉布蘭克（電視影集「六人行」、「 LIS太空號 」），他在本片飾演一名小聯盟的投手庫柏，正面臨職業生涯的低潮期。\n\r\n　不知是走運還是倒楣，來了個意外的室友─”他”是新來的三壘手艾德，一隻有驚人傳球能力的猩猩。庫柏從來沒想過自己的人生和投球生涯。會因為艾德的幫助而全然改觀，讓他對比賽進入新的境界，並重新面對自己所愛的人。這部笑料不斷的喜劇饗宴，是由奧斯卡得主比爾科特立執導，一同飆戲搞笑的還有珍布魯克和查理史萊特。', 'http://www.niotv.com/epg_content.php?epg_no=1583225&content_id=&ch_id=46&epg_name=強棒巨猩&stype=name', '06252', 0),
(3, '06/25', 'HBO', '02:55~04:30', '對面的惡女看過來', '', '愛情文藝', ' \r\n吉爾楊格 (Gil Junger)', '', '(1999)史塞福家二個姐妹有個截然不同的性格，他們唯一共同之處就是他們是全校唯二沒有約會的女生。史家老爸有條苛刻的規定，妹妹畢安卡（賴瑞莎歐蕾尼可飾）在高中畢業前不得有約會，除非怪胎姊姊，凱特（茱莉亞史緹爾飾）先找到約會的對象。這可是個難題，因為沒有人願意跟凱特約會。\n\r\n　新來的轉學生，柯邁隆（約塞夫高登盧維特飾）對畢安卡一見鍾情。在聽聞史家的家規後，他與死黨麥克（大衛克萊姆赫茲飾） 決定利用也喜歡畢安卡的大帥哥─喬依的錢財買通校園裡另一個公認的大怪胎派崔克（希斯萊傑）去約凱特。誰知凱特兇猛無比連派崔克都難以將其馴服。\n\r\n　凱特，這個桀傲不屈的世紀末最大惡女到底有沒有人可以收服她呢？有喬依從中作梗，經過一連串的努力的柯邁隆，是否可以美夢成真與畢安卡約會呢？', 'http://www.niotv.com/epg_content.php?epg_no=1583226&content_id=&ch_id=46&epg_name=對面的惡女看過來&stype=name', '06253', 0),
(4, '06/25', 'HBO', '04:30~06:00', '王牌大賤諜3-夠Man吧', '', '喜劇', '  \r\n傑洛奇(Jay Roach)', '', '(2002)這一天是奧斯汀保威最驕傲的一天，他被英國女王封為爵士，更讓他感到尾椎翹起來的是，他從小就崇拜的父親奈吉保威也參加了封爵典禮。 \n\r\n   但是當他要把這位王牌大賤諜之父以及英國最知名的情報員介紹給女王時，他竟然不見蹤影。奧斯汀沮喪到了極點，他的偶像又放了他鴿子，但是這時他的上司貝索卻告訴他奈吉原來是遭到一名天才罪犯－－也許他並不天才，不過他肯定是一個狠角色－－「夠Man吧」綁架。 \n\r\n   奧斯汀在沒有任何線索的情況下，被迫跟邪惡博士訂下魔鬼契約。他只要把關在最高設防監獄的邪惡博士轉到迷你咪囚禁的監獄，邪惡博士就會為奧斯汀指出一條明路。王牌大賤諜為了尋父，不得不答應他的要求，於是邪惡博士便叫他穿越時空回到1975年，原來熱愛迪斯可舞的「夠Man吧」在曼哈頓開了一家熱門舞廳69俱樂部。 \n\r\n   沒想到奧斯汀前腳一走，邪惡博士和迷你咪就成功越獄，當他回到七十年代，並再度和他的老情人風騷妖后在69俱樂部臥底調查，邪惡博士也緊跟著他追上來。邪惡博士和「夠Man吧」決定攜手合作，並佈下一場名為“除痔計畫”的陰謀，企圖阻止奧斯汀保威並毀滅世界。但是他們都不知道奧斯汀保威這次和邪惡博士訂下的魔鬼契約，竟然會揭發他們之間不為人知的秘密，而這兩個死對頭為什麼痛恨對方的原因也將揭曉。', 'http://www.niotv.com/epg_content.php?epg_no=1583227&content_id=&ch_id=46&epg_name=王牌大賤諜3-夠Man吧&stype=name', '06254', 0),
(5, '06/25', 'HBO', '06:00~07:40', '家有跳狗', '', '家庭溫馨', ' \r\n傑羅素(Jay Russell)', '', '(2000)溫馨喜劇「家有跳狗」是得獎暢銷作家威利莫里斯的童年自傳所改編，描述他與小狗史奇間的深刻友誼。這段童年往事不但改變了他的生活，並且成為他一生中最重要的時光。在1942年密西西比州亞肅鎮的八歲小男孩—威利身上。天性害羞沈靜的他一看到生人就渾身不自在，見到女孩子更是尷尬。於是威利成為學校中被玩弄的倒楣鬼，久而久之，自信心難以建立，加上是家中獨子，一個人過著安靜封閉的生活。 爸爸傑克（凱文貝肯飾）是個因傷光榮退役的軍人，看似堅強，其實脆弱，過度保護小威利，怕他受傷害。媽媽愛倫（黛安蓮恩飾）剛好相反，知道威利需要朋友建立信心，於是就在他九歲生日那一天，送了一隻可愛的小獵犬—史奇作為生日禮物。雖然爸爸極力反對，認為威利還負不起養狗的責任，但媽媽卻努力爭取，要幫威利找個知己。媽媽這招果然奏效，小狗史奇與威利從此形影不離，成了患難之交，但威利從沒想到，這隻狗不但建立他的信心，更長遠的影響了他的一生。 史奇活潑外向的個性，幫助威利追到校花麗芙，也與欺負他的小孩們打成一片，甚至加入了棒球隊，證明威利也有好動的一面。他們共同探險、解決麻煩，全鎮每個角落幾乎都有他們的足跡。史奇讓威利的成長不再寂寞，童年成為一生中最燦爛的歲月。因為史奇，威利不但發現了自己的潛能，更發現了豐富的人生。', 'http://www.niotv.com/epg_content.php?epg_no=1583228&content_id=&ch_id=46&epg_name=家有跳狗&stype=name', '06255', 0),
(6, '06/25', 'HBO', '07:40~09:30', '伊莉莎白：輝煌年代', '', '歷史傳記', '\r\n謝科卡普 (Shekhar Kapur)', '', '(2007)本片為曾獲得多項奧斯卡提名的《伊莉莎白》的續集，凱特布蘭琪主演。影片緊接著《伊莉莎白》沒有講完的史實，講述這位女王帶領英國走向世界霸主的過程，加入由克萊夫歐文所扮演的華特羅利角色。 \n\r\n1589年，伊莉莎白一世(凱特布蘭琪飾)統治英國將近30年，卻仍然受到王室成員背叛的威脅。這時位於對岸的歐洲諸國由西班牙國王菲利浦二世(荷帝莫拉飾)正率領一股天主教基本教義派的風暴襲捲歐洲。菲利浦二世仗著羅馬教廷宗教大審判的撐腰，以及西班牙在海上所向無敵的艦隊，對伊莉莎白一世及她統治的英國造成不容忽視的威脅，因為當時英國的國教已經改為基督新教，因此西班牙國王菲利浦二世一心想要讓伊莉莎白一世這名異端女王下台，讓英國重返羅馬天主教廷的榮耀。 \n\r\n伊莉莎白一世為了捍衛英國，不惜和勢力強大的菲利浦二世展開大戰，同時又不自主地愛上平民身份的華特羅利(克里夫歐文飾)，這段不可能有結果的戀情讓伊莉莎白一世身心備受煎熬。 \n\r\n她為了讓華特羅利待在她身邊，故意鼓勵她最寵愛的侍女貝絲(艾碧蔻妮希飾)和他交往。但是她的這種做法也讓自己陷入痛苦的深淵，因為她必須眼睜睜看著自己心愛的男人和她的侍女發展親蜜關係。 \n\r\n伊莉莎白女王深深受到相貌堂堂、熱愛冒險的華特羅利的吸引，對她來說，他不只是在心與靈上和她契合的對象，也代表了她從未嚐過的自由。但是她受限於英國王室的傳統，不能與平民百姓交往，只能抱著破碎的的心靈，被迫在成為一國之君和一個女人之間做出抉擇。 \n\r\n正當伊莉莎白一世蓄勢待發，準備和西班牙展開大戰的同時，她最信任的國務大臣法蘭西斯沃辛漢也繼續運用他高超的政治手腕，鞏固伊莉莎白一世絕對的權力。沃辛漢透過綿密複雜的情報網，揭發一場企圖推翻英國王位的暗殺行動，而且出乎他的意料之外，其中一名叛亂份子竟然是伊莉莎白的親表妹，蘇格蘭女王瑪麗斯圖亞特(珊曼莎摩頓飾)，而他不知不覺正將英國帶向毀滅之路。', 'http://www.niotv.com/epg_content.php?epg_no=1583229&content_id=&ch_id=46&epg_name=伊莉莎白：輝煌年代&stype=name', '06256', 0),
(7, '06/25', 'HBO', '09:30~10:00', '好萊塢好好看 #602', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583230&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '06257', 0),
(8, '06/25', 'HBO', '10:00~11:30', '奶爸安親班', '', '喜劇', '\r\n史提夫卡耳 (Steve Carr)', '', '(2003)查理(艾迪墨菲飾) 與好友兩人同時在一夕之間丟掉了飯碗，臉上無光的兩人雖然想趕緊找份像樣的工作，卻一直找不到.，所以只好待在家中照顧自己的小孩。一天，看著自己的小兒子，查理突然閃過了一個念頭：開一家「奶爸安親班」。在眾人都不看好的情況下，查理還是堅持己見，而從開張的第一天開始，查理才恍然大悟，照顧小孩的工作並不是一般人可以做的工作！而查理的麻煩並不只於此，更大的危機則是來自於同一學區超級貴族安親班的恐怖女董事 – 安潔莉卡赫斯頓！他要如何度過重重危機呢?」。', 'http://www.niotv.com/epg_content.php?epg_no=1583231&content_id=&ch_id=46&epg_name=奶爸安親班&stype=name', '06258', 0),
(9, '06/25', 'HBO', '11:30~13:00', '科學怪犬', '', '動畫', '\r\n提姆波頓 (Tim Burton)', '', '(2012)《魔境夢遊》怪才提姆波頓重拍自己28年前的黑白短片《科學怪犬》，此次以3D黑白動畫呈現溫馨動人的黑色喜劇。當維多與愛犬史巴基在科學實驗中展開新生之旅的同時，竟驚動小鎮上的街坊鄰居...\n\r\n   小男孩維多最好的朋友就是他的小狗史巴基，維多是一個瘋狂小科學家，成天不是與史巴基玩在一起就是做他的科學實驗。但有一天史巴基卻不幸在路上被車撞死，維多因失去愛犬傷心不已，他在課堂上看到老師用電力讓死青蛙動了起來，於是想用閃電讓史巴基復活。實驗成功了，史巴基死而復生。\n\r\n   不料，被維多同學發現了這件事，維多能讓動物起死回生的傳言在學校傳開，小朋友紛紛找來各種死去的寵物，參考維多的作法，結果各種古怪寵物全部都復活了，搞得小鎮天下大亂…\n\r\n   提姆波頓這次向多部恐怖片和科幻片致敬，採用了不少元素，例如主角維多的科學老師維古斯基，取材自《恐怖蠟像館》男星雲遜派斯；同學仔納索的髮型則模仿《科學怪人》主角，女同學則姓凡赫辛，連死而復生的古怪寵物，包括哥斯龜、吸血殭貓、類似小精靈的怪蝦等都會令影迷發出會心一笑。\n\r\n   提姆波頓當年拍攝此片時由真人真狗演出，但因劇情不適合小朋友而惹惱迪士尼公司。他也因缺少預算，不得不把規格縮為短片，如今圓夢拍成3D版，片中高度風格化的陰影設計讓整部片呈現黑色詭異卻又溫馨動人的氛圍。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583232&content_id=&ch_id=46&epg_name=科學怪犬&stype=name', '06259', 0),
(10, '06/25', 'HBO', '13:00~14:00', '無間警探_第2季 #1', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583233&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '062510', 0),
(11, '06/25', 'HBO', '14:00~15:55', '浪人47', '', '動作冒險', '\r\n卡爾里辛(Carl Rinsch) \r\n', '', '(2013)重拍1947年的同名日本電影。基努李維、真田廣之、淺野忠信、菊地凛子主演。以西方的敘述手法重新打造日本著名歷史「忠臣藏」的故事。\n\r\n本片由卡爾里辛執導，基努李維主演，以西方的敘述手法，融入獨特的奇幻特效和生猛異獸，重新改編18世紀日本江戶時代最悲壯的復仇事件「忠臣藏」。 \n\r\n1800年代的日本是一個虛無縹緲的國度，充滿暴戾之氣和懾人之美，也是歷史和幻想的交界處。一群日本武士因主子遇害身亡而慘遭流放，從此過著顛沛流離的生活，為了報仇並洗脫污名，他們決定向曾被放逐的混血浪人（基努李維飾）尋求協助；這名曾被驅逐而淪為奴隸的浪人是至今最致命的殺手，他將帶領這群落魄武士穿越妖魔蟄伏、危機重重的蠻荒異域，向仇敵步步追擊。 \n\r\n這個在日本家喻戶曉的故事曾經過不同年代的改編，如今又被賦予新意；47名浪人赤膽忠心、視死如歸的傳奇將再次驚奇呈現。\n\r\n除了巨星基努李維，這部3D史詩動作冒險片也號召了一群相當受歡迎的日本演員，包括《末代武士》真田廣之、《雷神索爾2：黑暗世界》淺野忠信、曾獲金獎提名的菊地凜子、《在世界的中心呼喊愛情 》柴崎幸。', 'http://www.niotv.com/epg_content.php?epg_no=1583234&content_id=&ch_id=46&epg_name=浪人47&stype=name', '062511', 0),
(12, '06/25', 'HBO', '15:55~17:25', '脫線教父', '', '喜劇', ' \r\n麥可瑞契 (Michael Ritchie)', '', '(1997)小女孩安娜貝爾(瑪拉威爾森飾，《小魔女》)對於自己的生活感到絕望透頂，一方面，他的哥哥永遠當她是長不大的小孩；另一方面，她那歌手兼演員的爸爸，竟決定放下賴以為生的計程車事業，參加好萊塢一齣大型音樂劇的試鏡，如果他不能拿下主角的位子，他們全家就要搬到偏僻的內布拉斯加州。對於一個七歲的紐約小女孩而言，還有什麼比這更糟的呢？ \n\r\n   於是，安娜貝爾開始向上天祈禱，懇求一個仙子教母下凡帶來奇蹟，幫助爸爸通過試鏡。在一個神奇的晚上，她的祈禱竟然有了回音...但是，下凡來的不是和藹可親的仙子教母，反倒是一個手執魔杖的中年教父莫瑞(馬丁蕭特飾，《星戰毀滅者》)。 \n\r\n   他一心想幫小安娜，但是他的魔法卻失靈了，每一次都造成爆笑烏龍的結果...雪上加霜的是，邪惡的仙子教母克勞蒂亞(凱薩琳透納飾，《瘋狂殺手俏媽咪》)滲入北美仙子教母協會一年一度的會議，打算偷取她們所有的魔杖與魔力，助長自己的勢力。此時，莫瑞法術再度失靈，竟然把安娜貝爾的爸爸變成了中央公園的一座雕像，如果24小時內他無法修正錯誤，爸爸就永遠也變不回來了！隨著邪惡教母克勞蒂亞一步步的逼近，脫線教父莫瑞是否能扭轉乾坤，實現安娜貝爾小小的心願呢？ ', 'http://www.niotv.com/epg_content.php?epg_no=1583235&content_id=&ch_id=46&epg_name=脫線教父&stype=name', '062512', 0),
(13, '06/25', 'HBO', '17:25~19:00', '不願面對的真相', '', '其他', '\r\n戴維斯古根漢 (Davis Guggenheim)', '', '(2006)我們坐在一枚定時炸彈上面，如果全世界大多數的科學家是正確的，人類只有十年的時間避免一場大災難，足以讓地球的氣候系統一片大亂，造成嚴重的氣候遽變，包括極端的氣候變化、水災、旱災、流行性傳染病大量散播以及致命熱浪，災情之嚴重是我們從來沒有經歷過的，而且完全是我們自己造成的。\n\r\n　如果這聽起來像杞人憂天，請重新考慮一次。導演戴維斯古根漢執導的紀錄片【不願面對的真相】在日舞影展大受歡迎，該片記錄一個人以他無比的熱誠、深具啟發性的談話，以及堅定不移的決心，大膽戳破關於全球暖化的迷思和誤解，並激勵每個人採取行動阻止情況惡化。這個人就是美國前任副總統艾爾高爾，他在2000年總統大選敗選之後，重新調整自我的生活方向，全心全意為全球暖化的問題付出時間與精力，希望能夠以他個人的努力，讓世人真正了解全球暖化的嚴重性，並且幫助世人拯救地球，阻止它走向自我毀滅的方向。【不願面對的真相】一片記錄了艾爾高爾在全世界各地的全球暖化巡迴演講，他在這些以幻燈片輔助的演講中，同時展現出風趣幽默以及認真嚴肅的一面，以輕鬆自然以及實事求是的態度、竭盡所能向一般老百姓說明地球正面臨一場“全球性的緊急狀況”，而我們這些老百姓在事情尚未惡化到無法挽救的地步，必須儘快採取行動阻止浩劫發生。\n\r\n　2005，美國有史以來最嚴重的暴風季終於過去，但是我們仍然可能接近一個“引爆點”，高爾以最坦率直接的方法解釋全球暖化的嚴重性。他時而引用令人驚訝的事實數據，時而預測未來將發生的嚴重後果，中間並穿插高爾個人的心路歷程。從他在大學時在課堂上看到大規模環保危機產生的可能性；到他身為年輕參議員，意氣風發之時卻差點痛失愛子，因而改變了他對人生的觀短；一直到他差一點就成為美國總統所受到的挫敗。但是他卻一點也沒有失意喪志，反而重新投入他這一生最重要的使命，也就是說服世人仍有時間做出改變，拯救我們唯一的家園－地球。\n\r\n　【不願面對的真相】一片捕捉了高爾的風趣幽默、博學多聞以及充滿希望的一面，讓他以感染度極高的演說，一針見血地提出一個最重要的事實，那就是世人不能再把全球暖化視為政治議題，而是人類文明面對最大的道德挑戰。\n\r\n　【不願面對的真相】一片由派拉蒙經典影片公司暨Participant製片公司出品；由戴維斯古根漢執導；主要人物是艾爾高爾。製片是蘿莉大衛、羅倫斯班德以及史考特柏恩斯；執行製片是傑夫史高、戴維斯古根漢、黛安', 'http://www.niotv.com/epg_content.php?epg_no=1583236&content_id=&ch_id=46&epg_name=不願面對的真相&stype=name', '062513', 0),
(14, '06/25', 'HBO', '19:00~21:00', '雲端情人', '', '愛情文藝', ' \r\n史派克瓊斯 (Spike Jonze)', '', '(2013)史派克瓊斯執導籌備3年，雲端世界全新虛擬情人浪漫題材，新紀世單身作家，在未來科幻和傳統浪漫之中，展開一段不尋常的愛情...\n\r\n本片獲得第86屆奧斯卡金像獎最佳原著劇本，《蘭花賊》導演史派克瓊斯執導，《為你鍾情》瓦昆菲尼克斯、《人生決勝球》艾美亞當絲、《千禧三部曲Ｉ：龍紋身的女孩》魯妮瑪拉、珊曼莎摩頓、奧莉薇亞懷爾德演出。 \n\r\n故事發生在近未來的洛衫磯，西奧多托姆利（喬昆菲尼克斯 飾）是個心思複雜又感情細膩的男人，靠替別人撰寫感人的私人信件維生。他結束了一段愛情長跑而心碎，迷戀上一個嶄新先進、操作簡易又獨特的人工智慧軟體。 \n\r\n在啟動軟體之後，他總能高興地跟「莎曼珊」，一個開朗的女性聲音（史嘉蕾喬韓森 飾）交流，她敏感、觀察入微又幽默風趣，而「莎曼珊」和西奧多對彼此的需求和慾望漸增，他們的友誼最終深入發展成了愛情。 \n\r\n《雲端情人》的概念在史派克瓊斯的心中已醞釀多年，最初的開端是10年前他在網路上讀到的一篇文章，描述的是一種人工智慧的即時通訊。他連結上去後和對方有一些對談，引發「有個人跟完全意識自主的類似存在發展出關係，那樣會發生什麼事呢？」的思考，於是決定朝這個方向想像一段愛情故事。\r\n延伸閱讀', 'http://www.niotv.com/epg_content.php?epg_no=1583237&content_id=&ch_id=46&epg_name=雲端情人&stype=name', '062514', 0),
(15, '06/25', 'HBO', '21:00~23:30', '美國黑幫', '', '歷史傳記', '\r\n雷德利史考特 (Ridley Scott)', '', '(2007)改編自真實事件的《美國黑幫》主要是在敘述，1970年代黑幫傳奇人物法蘭克盧卡斯從哈林街頭崛起竄升為黑道界的超級巨星，到後來終於被一名鍥而不捨的警察緝捕歸案的真實故事。\n\r\n　70年代成為美國毒品氾濫期，最主要的是當時的社會現況，當時紐約市警界貪污情形嚴重，加上越戰在美國內外造成慘重的結果，軍人返回美國，不是陣亡裝進屍袋，就是染上海洛因毒癮。而收賄嚴重加上執法單位的沒視，官官相護，人人都對想分一杯羹，讓黑手黨高枕無憂操作這個沒有競爭對手的市場，賣出幾千公斤的毒品給毒蟲。一群白人特權階級以幾億美元收買紐約的法官、律師與警察，讓他們對這層相互利益的關係不多追問。黑手黨組織無人能敵。\n\r\n　丹佐華盛頓飾演黑幫老大的司機法蘭克盧卡斯，在老大暴斃後篡位變老大，實現他的另類美國夢，開始接手大哥事業，掌控毒品交易大權。原本默默無聞的他，自小失學，但憑著在街頭打滾的經驗與機靈的腦袋，接手大位的他馬上定出一套有效率又嚴格的毒品經，他賣出一批批價格更好、純度更高的毒品，毫不留情的逞兇鬥狠，讓他黑道犯罪組織對他敬畏三分，也因此成為在黑道界迅速竄起的超級新星。\n\r\n　另一邊則是羅素克洛演的條子－李奇羅勃茲，他立刻察覺毒品圈的變化，有股黑色勢力正在掘起，作風強硬不願收賄的他，不知不覺中成了同行中被孤立的獨行俠，他漸漸注意到盧卡斯，而這兩人的衝突也就一觸即發，不只改變他們自己的人生，也改變了紐約市全體世代的命運...', 'http://www.niotv.com/epg_content.php?epg_no=1583238&content_id=&ch_id=46&epg_name=美國黑幫&stype=name', '062515', 0),
(16, '06/25', 'HBO', '23:30~01:00', '王牌大賤諜3-夠Man吧', '', '喜劇', '  \r\n傑洛奇(Jay Roach)', '', '(2002)這一天是奧斯汀保威最驕傲的一天，他被英國女王封為爵士，更讓他感到尾椎翹起來的是，他從小就崇拜的父親奈吉保威也參加了封爵典禮。 \n\r\n   但是當他要把這位王牌大賤諜之父以及英國最知名的情報員介紹給女王時，他竟然不見蹤影。奧斯汀沮喪到了極點，他的偶像又放了他鴿子，但是這時他的上司貝索卻告訴他奈吉原來是遭到一名天才罪犯－－也許他並不天才，不過他肯定是一個狠角色－－「夠Man吧」綁架。 \n\r\n   奧斯汀在沒有任何線索的情況下，被迫跟邪惡博士訂下魔鬼契約。他只要把關在最高設防監獄的邪惡博士轉到迷你咪囚禁的監獄，邪惡博士就會為奧斯汀指出一條明路。王牌大賤諜為了尋父，不得不答應他的要求，於是邪惡博士便叫他穿越時空回到1975年，原來熱愛迪斯可舞的「夠Man吧」在曼哈頓開了一家熱門舞廳69俱樂部。 \n\r\n   沒想到奧斯汀前腳一走，邪惡博士和迷你咪就成功越獄，當他回到七十年代，並再度和他的老情人風騷妖后在69俱樂部臥底調查，邪惡博士也緊跟著他追上來。邪惡博士和「夠Man吧」決定攜手合作，並佈下一場名為“除痔計畫”的陰謀，企圖阻止奧斯汀保威並毀滅世界。但是他們都不知道奧斯汀保威這次和邪惡博士訂下的魔鬼契約，竟然會揭發他們之間不為人知的秘密，而這兩個死對頭為什麼痛恨對方的原因也將揭曉。', 'http://www.niotv.com/epg_content.php?epg_no=1583239&content_id=&ch_id=46&epg_name=王牌大賤諜3-夠Man吧&stype=name', '062516', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150626`
--

CREATE TABLE IF NOT EXISTS `t20150626` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150626`
--

INSERT INTO `t20150626` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/26', 'HBO', '23:30~01:00', '王牌大賤諜3-夠Man吧', '', '喜劇', '  \r\n傑洛奇(Jay Roach)', '', '(2002)這一天是奧斯汀保威最驕傲的一天，他被英國女王封為爵士，更讓他感到尾椎翹起來的是，他從小就崇拜的父親奈吉保威也參加了封爵典禮。 \n\r\n   但是當他要把這位王牌大賤諜之父以及英國最知名的情報員介紹給女王時，他竟然不見蹤影。奧斯汀沮喪到了極點，他的偶像又放了他鴿子，但是這時他的上司貝索卻告訴他奈吉原來是遭到一名天才罪犯－－也許他並不天才，不過他肯定是一個狠角色－－「夠Man吧」綁架。 \n\r\n   奧斯汀在沒有任何線索的情況下，被迫跟邪惡博士訂下魔鬼契約。他只要把關在最高設防監獄的邪惡博士轉到迷你咪囚禁的監獄，邪惡博士就會為奧斯汀指出一條明路。王牌大賤諜為了尋父，不得不答應他的要求，於是邪惡博士便叫他穿越時空回到1975年，原來熱愛迪斯可舞的「夠Man吧」在曼哈頓開了一家熱門舞廳69俱樂部。 \n\r\n   沒想到奧斯汀前腳一走，邪惡博士和迷你咪就成功越獄，當他回到七十年代，並再度和他的老情人風騷妖后在69俱樂部臥底調查，邪惡博士也緊跟著他追上來。邪惡博士和「夠Man吧」決定攜手合作，並佈下一場名為“除痔計畫”的陰謀，企圖阻止奧斯汀保威並毀滅世界。但是他們都不知道奧斯汀保威這次和邪惡博士訂下的魔鬼契約，竟然會揭發他們之間不為人知的秘密，而這兩個死對頭為什麼痛恨對方的原因也將揭曉。', 'http://www.niotv.com/epg_content.php?epg_no=1583239&content_id=&ch_id=46&epg_name=王牌大賤諜3-夠Man吧&stype=name', '06261', 0),
(2, '06/26', 'HBO', '01:00~01:30', '好球天團_第1季 #1', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583240&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06262', 0),
(3, '06/26', 'HBO', '01:30~02:05', '救世鼎立戰_第1季 #1', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583241&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '06263', 0),
(4, '06/26', 'HBO', '02:05~03:40', '家庭派對：就在今夜', '', '喜劇', '\r\n達林斯科特(Darin Scott)\r\n演員', '', '(2013)即將高中畢業的Chris一直在苦惱到底怎樣慶祝自己的高中生涯，朋友給他提了個建議，大家一起在Chris家裡開一個盛大的派對，派對的意義在於從此大家都成了真正的成年人。這一天，Chris的父母也同意出遠門，並讓孩子有屬於自己的天地，一切都會像Chris想像的那樣順利嗎？', 'http://www.niotv.com/epg_content.php?epg_no=1583242&content_id=&ch_id=46&epg_name=家庭派對：就在今夜&stype=name', '06264', 0),
(5, '06/26', 'HBO', '03:40~06:00', '荒野生存', '', '歷史傳記', '\r\n西恩潘 (Sean Penn)', '', '(2007)《荒野生存》改編自著名作家喬恩·科萊考爾(Jon Krakauer)的散文集，是一個真實事件，說的是一個名叫克裡斯多弗的男子(埃米爾·赫斯基飾)1992年大學畢業後，毅然捨棄了所有的財產，投身到阿拉斯加州的茫茫荒野中，體驗回歸自然的生活。四個月後，人們在一個偏僻的野營地的一輛廢棄的公共汽車上，發現了他的屍體。', 'http://www.niotv.com/epg_content.php?epg_no=1583243&content_id=&ch_id=46&epg_name=荒野生存&stype=name', '06265', 0),
(6, '06/26', 'HBO', '06:00~08:30', '黑色豪門企業', '', '劇情', '\r\n薛尼波拉克(Sydney Pollack)', '', '(1993)本片改編自多產作家約翰葛里遜的小說，敘述一名懷抱野心的青年人陷入一場陰謀的迷宮之中。米契麥可迪（金球獎得主湯姆克魯斯，「落日殺神」、「末代武士」）是個哈佛法學院畢業的高材生，他拒絕了大城市的大型事務所，選擇到曼菲斯的一家小事務所，但對方提供他優渥的合夥人條件。他和妻子艾比（珍妮翠柏虹，「水世界」）被大筆的鈔票、名車、豪宅給誘惑，合夥人托勒（奧斯卡暨金球獎得主金哈克曼，「失控的陪審團」）對小夫妻多所照顧，但米契很快便發現這家事務所有許多不可告人的秘辛。眼前的大好機會竟然可能會使他喪命…', 'http://www.niotv.com/epg_content.php?epg_no=1583244&content_id=&ch_id=46&epg_name=黑色豪門企業&stype=name', '06266', 0),
(7, '06/26', 'HBO', '08:30~10:30', '雲端情人', '', '愛情文藝', ' \r\n史派克瓊斯 (Spike Jonze)', '', '(2013)史派克瓊斯執導籌備3年，雲端世界全新虛擬情人浪漫題材，新紀世單身作家，在未來科幻和傳統浪漫之中，展開一段不尋常的愛情...\n\r\n本片獲得第86屆奧斯卡金像獎最佳原著劇本，《蘭花賊》導演史派克瓊斯執導，《為你鍾情》瓦昆菲尼克斯、《人生決勝球》艾美亞當絲、《千禧三部曲Ｉ：龍紋身的女孩》魯妮瑪拉、珊曼莎摩頓、奧莉薇亞懷爾德演出。 \n\r\n故事發生在近未來的洛衫磯，西奧多托姆利（喬昆菲尼克斯 飾）是個心思複雜又感情細膩的男人，靠替別人撰寫感人的私人信件維生。他結束了一段愛情長跑而心碎，迷戀上一個嶄新先進、操作簡易又獨特的人工智慧軟體。 \n\r\n在啟動軟體之後，他總能高興地跟「莎曼珊」，一個開朗的女性聲音（史嘉蕾喬韓森 飾）交流，她敏感、觀察入微又幽默風趣，而「莎曼珊」和西奧多對彼此的需求和慾望漸增，他們的友誼最終深入發展成了愛情。 \n\r\n《雲端情人》的概念在史派克瓊斯的心中已醞釀多年，最初的開端是10年前他在網路上讀到的一篇文章，描述的是一種人工智慧的即時通訊。他連結上去後和對方有一些對談，引發「有個人跟完全意識自主的類似存在發展出關係，那樣會發生什麼事呢？」的思考，於是決定朝這個方向想像一段愛情故事。\r\n延伸閱讀', 'http://www.niotv.com/epg_content.php?epg_no=1583245&content_id=&ch_id=46&epg_name=雲端情人&stype=name', '06267', 0),
(8, '06/26', 'HBO', '10:30~13:00', '美國黑幫', '', '歷史傳記', '\r\n雷德利史考特 (Ridley Scott)', '', '(2007)改編自真實事件的《美國黑幫》主要是在敘述，1970年代黑幫傳奇人物法蘭克盧卡斯從哈林街頭崛起竄升為黑道界的超級巨星，到後來終於被一名鍥而不捨的警察緝捕歸案的真實故事。\n\r\n　70年代成為美國毒品氾濫期，最主要的是當時的社會現況，當時紐約市警界貪污情形嚴重，加上越戰在美國內外造成慘重的結果，軍人返回美國，不是陣亡裝進屍袋，就是染上海洛因毒癮。而收賄嚴重加上執法單位的沒視，官官相護，人人都對想分一杯羹，讓黑手黨高枕無憂操作這個沒有競爭對手的市場，賣出幾千公斤的毒品給毒蟲。一群白人特權階級以幾億美元收買紐約的法官、律師與警察，讓他們對這層相互利益的關係不多追問。黑手黨組織無人能敵。\n\r\n　丹佐華盛頓飾演黑幫老大的司機法蘭克盧卡斯，在老大暴斃後篡位變老大，實現他的另類美國夢，開始接手大哥事業，掌控毒品交易大權。原本默默無聞的他，自小失學，但憑著在街頭打滾的經驗與機靈的腦袋，接手大位的他馬上定出一套有效率又嚴格的毒品經，他賣出一批批價格更好、純度更高的毒品，毫不留情的逞兇鬥狠，讓他黑道犯罪組織對他敬畏三分，也因此成為在黑道界迅速竄起的超級新星。\n\r\n　另一邊則是羅素克洛演的條子－李奇羅勃茲，他立刻察覺毒品圈的變化，有股黑色勢力正在掘起，作風強硬不願收賄的他，不知不覺中成了同行中被孤立的獨行俠，他漸漸注意到盧卡斯，而這兩人的衝突也就一觸即發，不只改變他們自己的人生，也改變了紐約市全體世代的命運...', 'http://www.niotv.com/epg_content.php?epg_no=1583246&content_id=&ch_id=46&epg_name=美國黑幫&stype=name', '06268', 0),
(9, '06/26', 'HBO', '13:00~13:30', '好球天團_第1季 #1', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583247&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06269', 0),
(10, '06/26', 'HBO', '13:30~14:00', '救世鼎立戰_第1季 #1', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583248&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '062610', 0),
(11, '06/26', 'HBO', '14:00~16:00', '贖罪', '', '劇情', '\r\n喬萊特 (Joe Wright)', '', '(2007)二次大戰期間，一名年輕人為了逃避誤判的性侵牢獄之災而從軍，他必須活著才能回鄉與他的真愛重聚…凱拉奈莉與《納尼亞傳奇》詹姆斯麥艾維主演。 \n\r\n這個講述經歷了數十年的愛情與仇恨的故事，一個錯誤的誣告和想像影響著兩個家族與數人的一生，讓故事裡的主人翁人生巨變，從而走向不同且極端痛苦的分軌。 \n\r\n1935年英格蘭氣溫最高的一天二次大戰的陰影漸漸逼近，而白昂妮塔利斯（莎柔絲羅南飾）與家人在維多利亞哥德式的豪宅中，過著優渥的生活。他們全家一起共度週末時，長久以來壓抑的情緒因為酷熱逐漸浮上台面，形成一股令人不安的威脅與危險。 \n\r\n13歲的白昂妮塔利斯是個初出茅廬的作家，愛幻想，充滿想像力，她不經意的望見因受不了酷熱，而脫光衣服在自家噴水池戲水的大姐西希莉雅塔利斯(凱拉奈莉飾)，與恰巧經過的僕人兒子羅比(詹姆斯麥艾維飾)情意深長噯味的對望，而在腦裡產生了扭曲與怪誕的想像。羅比與西希莉雅塔利斯自小一同長大，青梅竹馬暗自相許，卻因為階級與身份而無法向對方表白，而一直保持著距離... \n\r\n就在二人決定跨越階級身份交往時，白昂妮塔利斯的表姐羅拉(Juno Temple飾)被強暴，一直在心中扭曲放大西希莉雅塔利斯有所不軌的白昂妮塔利斯，卻在此時出面指控兇手是羅比，不論他如何反駁，白昂妮塔利斯一口咬定並且以腦中想像的各種畫面指控他，羅比於是為了自己不曾犯過的罪刑入獄，這對情侶的感情也來不及發芽就告終結。 \n\r\n很快的二次大戰爆發，羅比也加入了軍隊上戰場從軍去，羅比在撤退時被俘，卻在此時與已成為紅十字會護士的白昂妮塔利斯相會，一切往事也漸漸浮出水面...為了再度回鄉見到真愛的羅比，除了要洗刷罪名，也得在這場兵荒馬亂的戰爭中想辦法存活下來.....。 \n\r\n曾改編同樣是文學名著「傲慢與偏見」的英國導演喬懷特(Joe Wright)，此次則改編英國作家伊恩·麥克尤恩(Ian McEwan)的同名愛情小說，並請到曾撰寫《沈靜的美國人》的克里斯多夫漢普頓擔任編劇，本片也是凱拉奈莉與喬懷特自《傲慢與偏見》後二度合作，片中綺拉奈特莉大膽裸露與精彩的演出，為本片入圍第65屆金球獎最佳影片(戲劇類)、最佳男主角(戲劇類)---詹姆斯麥艾維、最佳女主角(戲劇類)、最佳女配角(莎柔絲羅南)、最佳導演、最佳劇本和最佳配樂共七項大獎。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583249&content_id=&ch_id=46&epg_name=贖罪&stype=name', '062611', 0),
(12, '06/26', 'HBO', '16:00~17:40', '一路玩到掛', '', '喜劇', '\r\n羅勃雷納 (Rob Reiner)', '', '(2007)【一路玩到掛】由傑克尼克遜與摩根費里曼主演，兩位都是得過奧斯卡獎的演技派男星，導演是羅伯萊納。這部電影是一部既感人又充滿奇妙旅程的喜劇片，述說永遠不嫌晚的美好人生。\n\r\n卡特錢伯斯(摩根費里曼飾)在剛進大學時，他的哲學老師叫他們學生列出一份人生清單，寫出他們在過世前想做、想看、想體驗的所有事情。\n\r\n雖然卡特一直很想依照他的夢想和計畫實現這份人生清單，但是現實還是必須面對。他歷經婚姻、生兒育女、各種責任義務及46年的黑手工作，逐漸地，他的人生清單也僅僅成為一個甘苦的回憶，代表他失去的無數契機及他在修車時的白日夢。\n\r\n另一方面，億萬富翁艾德華柯爾(傑克尼克遜飾)則完全忽略他的人生清單。他從年輕到老年都忙著賺錢，並建立起自己的企業王國，然而他根本沒有空檔認真考慮自己的人生。\n\r\n很湊巧地，他們的人生都發生了轉折，像一記當頭棒地提醒他們該追求自己的人生。\n\r\n卡特與艾德華住進同一間病房，他們開始有許多時間思考接下來的人生，以及他們到底擁有什麼。雖然他們兩人的背景截然不同，但是他們很快就發現他們具有兩個共通點：第一點，他們都不瞭解自己，也不確定自己的人生抉擇是否正確；第二點，他們都希望好好利用人生的最後時光，完成一直想做卻沒做的事。\n\r\n此刻，他們的人生清單不再只是空想，而是等待他們實現的計畫。於是，這兩個原本互不相識的陌生人不管醫師的指示擅自出院，一起踏上他們現在可能才真正開始的人生歷程，從印度泰姬瑪哈陵到東非坦尚尼亞大草原塞倫蓋提，從最高級的餐廳到最低層的刺青店，從超炫的古董跑車到刺激的螺旋槳飛機，他們帶著自己的人生清單及滿腔熱情，追尋著各自的夢想。\n\r\n在展開雄偉美麗的世界之旅過程中，他們增加也刪減一些人生清單中的項目，因為他們決定要勇敢面對難題，就算這些問題的答案令人難耐。不知不覺中，他們兩人成為真心的患難之交，以詼諧、睿智、誠摯的態度真情對待彼此。\n\r\n有時，人生就是須要一個期限，使我們產生動力扭轉自己的人生。', 'http://www.niotv.com/epg_content.php?epg_no=1583250&content_id=&ch_id=46&epg_name=一路玩到掛&stype=name', '062612', 0),
(13, '06/26', 'HBO', '17:40~19:05', '海綿寶寶歷險記', '', '動畫', '\r\n史蒂芬海倫伯格 (Stephen Hillenburg)', '', '(2004)大人小孩都愛的海綿寶寶也有電影版囉！在風景優美的比基尼島海域下生活著一群特殊的海底生物，他們組成了一個不被世人所知曉的海底世界。這是一個充滿了快樂的王國，這裡的居民都過著無憂無慮的生活。\n\r\n　 住在一座大鳳梨房子裡的小海綿塊就是這個王國中的一員，他的朋友都稱他為「穿著方型短褲的海綿寶寶」。他每天都和朋友沉浸在狂歡派對和美味的餡餅裡，享受著這悠閒而自在的生活。然而這一天，海底王國平靜而快樂的生活被打亂了，國王海神的王冠突然被人偷走。種種跡象表明，偷走王冠的是一隻小小的，骯髒的臭蟲。\n\r\n 　原來這一切都是蟹老闆的死對頭「皮老闆」的邪惡計劃，它把罪嫁禍給蟹老闆，海神因而大發雷霆要處死蟹老闆，為解救蟹老闆，必須在海神限定的6天內將王冠找回來。於是海綿寶寶他邀請了笨拙但心地善良的海星朋友派大星一起去奪回王冠。向著未知的目的地貝殼城出發，海綿寶寶和派大星將有一場艱難的旅程，他們將要面臨到種種危險和考驗', 'http://www.niotv.com/epg_content.php?epg_no=1583251&content_id=&ch_id=46&epg_name=海綿寶寶歷險記&stype=name', '062613', 0),
(14, '06/26', 'HBO', '19:05~21:00', 'CIA追緝令', '', '動作冒險', '\r\n羅傑唐納森 (Roger Donaldson)', '', '(2003)柯林法洛飾演的詹姆斯克里頓是美國中央情報局最新招募來的新成員，在著名的CIA訓練營地，「The Farm」裡接受CIA老鳥─華特柏克(艾爾帕西諾飾演)的訓練。在歷經一連串非人的試驗之後，成績一向名列前矛的詹姆斯卻意外的刷下來，被迫退出CIA的陣容。\n\r\n　 就在詹姆斯遭到人生最大打擊而失魂落魄時，華特柏克找上門表示其實詹姆斯並未遭到CIA剔除，而是他另有重要的秘密任務。詹姆斯被賦予一項特別的臥底任務，必須潛在中情局裡找出CIA裡的的壞份子，但是卻又不能讓任何人發現，他唯一的依靠就是華特柏克。\n\r\n　 柯林法洛目前是好萊塢最炙手可熱的新星，2003年有許多他所參與的電影即將上映，而柯林法洛的角色越來越重要，表現也越來越出色，有挑戰湯姆克魯斯以及布萊德彼特的實力。', 'http://www.niotv.com/epg_content.php?epg_no=1583252&content_id=&ch_id=46&epg_name=CIA追緝令&stype=name', '062614', 0),
(15, '06/26', 'HBO', '21:00~22:55', '鋼鐵墳墓', '', '動作冒險', ' \r\n麥克哈夫斯強 (Mikael Hafstrom)', '', '(2013)席維斯史特龍、阿諾史瓦辛格兩大老牌動作巨星聯合演出動作驚悚片。史特龍這次飾演全世界最頂尖的安全系統設計師，企圖從依照自己所寫的維安設計準則而造的監獄裡逃脫。\n\r\n動作天王席維斯史特龍與阿諾史瓦辛格都是好萊塢的超級巨星，很難說哪一個才是美國動作片的真正經典形象代表；這是他們第一次成為合作夥伴、共同面對同一個敵人。 \n\r\n雷布瑞林（席維斯史特龍飾）是一名監獄興建與保安設計師，在全球業界無人能出其右，他同時也是頂尖的逃獄高手。收入驚人的他，實際工作內容就是偽裝成罪犯，被關入戒備森嚴的監獄，再設法逃脫，並將這座監獄的安管漏洞紀錄下來，依此而做強化改善。目前為止，美國聯邦監獄管理局安全防衛屬最高規格的監獄他都待過，越獄成功率高達百分之百。 \n\r\n有一天，一件特殊的案子找上了雷，希望他評量一座民間經營的體制外監獄「鋼鐵墳墓」，對方開出的酬勞是平常價碼的兩倍。這間監獄是根據雷自己寫的監獄維安設計指南而建造的，可以說，讓雷越獄成功的那些嚴密監獄的安全漏洞，在這座監獄裡通通都沒有。無論是報酬還是工作內容的挑戰度，這件案子都對雷極具誘惑力，於是他接下這件案子，準備「入獄」。 \n\r\n該監獄的所在位置極度保密，為了營造真實的監禁情境，雷在獄中將無法和自己在監獄外的工作團隊進行任何聯絡與溝通。入獄後，雷發現被關入「鋼鐵墳墓」中的罪犯都是世界上最為恐怖的危險份子，而且在這座建造的猶如迷宮的高科技監獄之中，監禁犯人的都是透明的玻璃牢房，不但隨時都有監視器監控著，一層又一層的重裝警衛配置更是做到滴水不漏，連雷都找不出破綻。但是這座監獄最可怕的，是以打擊不聽話的囚犯為樂的殘忍典獄長威拉哈柏（吉姆卡維佐飾）。 \n\r\n雷在獄中受到典獄長的注意，以各種手法折磨、打擊雷；當雷想使用在入獄前就設定好的脫逃暗號時，典獄長卻直說他聽不懂，這時，雷才發現自己已在不知不覺當中落入他人設下的陷阱，而且敵方的真實身分不明。萬不得已之下，雷向同樣被關在「鋼鐵墳墓」中的神秘大哥艾米羅麥爾（史瓦辛格飾）請求幫助，不但要從獄中的暴力與猜忌脫困，更要找出事件背後的真相。 \n\r\n本片不只是單純的動作片，更有設計巧妙的劇本，讓片中角色鬥狠也鬥智；尤其集結兩大動作巨星的卡司陣容更是一大賣點。', 'http://www.niotv.com/epg_content.php?epg_no=1583253&content_id=&ch_id=46&epg_name=鋼鐵墳墓&stype=name', '062615', 0),
(16, '06/26', 'HBO', '22:55~00:45', '超級選秀日', '', '劇情', ' \r\n伊凡萊蔓 (Ivan Reitman)', '', '(2014)面對球團內的壓力，敵對經理人的算計，甚至被開除的威脅，桑尼該如何在這超級選秀日中運籌帷幄、機關算盡，挑選出陣容最堅強的夢幻球隊呢？\n\r\n本片由《型男飛行日誌》製作團隊操刀，《飯飯之交》導演艾凡瑞特曼執導，《傑克萊恩︰詭影任務》凱文科斯納、《藥命俱樂部》珍妮佛嘉納領銜主演。 \n\r\n國家美式足球聯盟選秀日到來了，總經理桑尼威佛有權這天為克里夫蘭隊在第一輪優先挑選球員，但他必須面對上百個懷抱夢想的青年，並在專業和私人情感間做出正確決定。 \n\r\n同時，他也面臨球團內的壓力、敵對經理人的算計、被開除的威脅，要在這超級選秀日中運籌帷幄，挑選出陣容最堅強的夢幻球隊！ \n\r\n曾演出許多運動片的凱文科斯納表示並不想拍重複的故事，但他認為《超級選秀日》並未將重心放在球場上的比賽，而是探索比賽背後球隊營運的商業機密，因此有興趣演出，也拜訪了許多國家美式足球聯盟的球隊總經理。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583254&content_id=&ch_id=46&epg_name=超級選秀日&stype=name', '062616', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150627`
--

CREATE TABLE IF NOT EXISTS `t20150627` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150627`
--

INSERT INTO `t20150627` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/27', 'HBO', '22:55~00:45', '超級選秀日', '', '劇情', ' \r\n伊凡萊蔓 (Ivan Reitman)', '', '(2014)面對球團內的壓力，敵對經理人的算計，甚至被開除的威脅，桑尼該如何在這超級選秀日中運籌帷幄、機關算盡，挑選出陣容最堅強的夢幻球隊呢？\n\r\n本片由《型男飛行日誌》製作團隊操刀，《飯飯之交》導演艾凡瑞特曼執導，《傑克萊恩︰詭影任務》凱文科斯納、《藥命俱樂部》珍妮佛嘉納領銜主演。 \n\r\n國家美式足球聯盟選秀日到來了，總經理桑尼威佛有權這天為克里夫蘭隊在第一輪優先挑選球員，但他必須面對上百個懷抱夢想的青年，並在專業和私人情感間做出正確決定。 \n\r\n同時，他也面臨球團內的壓力、敵對經理人的算計、被開除的威脅，要在這超級選秀日中運籌帷幄，挑選出陣容最堅強的夢幻球隊！ \n\r\n曾演出許多運動片的凱文科斯納表示並不想拍重複的故事，但他認為《超級選秀日》並未將重心放在球場上的比賽，而是探索比賽背後球隊營運的商業機密，因此有興趣演出，也拜訪了許多國家美式足球聯盟的球隊總經理。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583254&content_id=&ch_id=46&epg_name=超級選秀日&stype=name', '06271', 0),
(2, '06/27', 'HBO', '00:45~02:30', '靈異第六感', '', '靈異驚悚', '\r\n奈沙馬蘭 (M.Night Shyamalan)', '', '(1999)麥爾康醫生(布魯斯威利飾)是一名傑出的兒童家庭心理學者，幫助過不少問題兒童走回正路，也因此獲得市政府的表揚。\n\r\n   不料，一名接受過麥爾康醫生治療，但未成功的青少年卻闖入麥爾康醫生家中，槍傷醫生後，再舉槍自盡。一年後，麥爾康醫生再度面臨一件類似的病例，這名叫做柯爾(海利喬奧斯蒙飾)的8歲小男生擁有陰陽眼，長久以來飽受冤死鬼魂的困擾，讓他十分害怕，這種恐怖的遭遇讓他無法對他人啟齒，連他的母親都無法了解為什麼科爾總是行為怪異。麥爾康對於自己無法解決去年那名自盡男孩的問題一直耿耿於懷，因此他決定盡全力來幫助柯爾。 \n\r\n   但是長期以來飽受心靈折磨與煎熬的柯爾，卻認定沒有人可以幫助他脫離現狀。在麥爾康醫生不斷的堅持下，終於柯爾逐漸打開心防，讓醫生了解自己的問題，也慢慢地接受他的建議。在治療柯爾的同時，麥爾康醫生發現自己的婚姻狀況出現問題，他的太太不但冷落他，而且似乎有了外遇，麥爾康同時面對工作上與婚姻上的兩個難題而備受困擾。儘管科爾在醫生的開導陪伴下逐漸接受自己擁有陰陽眼的事實，但是就在整件事似乎即將大功告成，功德圓滿之際，麥爾康醫生卻有一個更驚人的發現....', 'http://www.niotv.com/epg_content.php?epg_no=1583255&content_id=&ch_id=46&epg_name=靈異第六感&stype=name', '06272', 0),
(3, '06/27', 'HBO', '02:30~04:35', '戰火情人', '', '愛情文藝', '\r\n馬丁坎貝爾(Martin Campbell)', '', '(2003)一段在戰火中滋長的淒美愛情，一對在戰火中共患難的苦命鴛鴦。莎拉(奧斯卡暨金球獎得主安潔莉娜裘莉，「史密斯任務」、「古墓奇兵：風起雲湧」)是個嫁給英國工業鉅子的美國女子，過著安逸的生活，但是當英俊反骨的醫生尼克(榮獲奧斯卡暨金球獎提名的克里夫歐文，「偷情」、「萬惡城市」、「亞瑟王」)進入她的生活後，她的世界開始動搖。尼克積極地呼籲世人援助戰火頻仍的非洲，莎拉為他的熱情深深感動，因此莎拉展開了她的非洲之旅。這趟危險的旅程帶領她前往一個未知的世界，也讓她開始ㄧ段刻骨銘心的愛情。', 'http://www.niotv.com/epg_content.php?epg_no=1583256&content_id=&ch_id=46&epg_name=戰火情人&stype=name', '06273', 0),
(4, '06/27', 'HBO', '04:35~06:00', '餘燼追思', '', '劇情', '\r\nJim Simpson \r\n', '', '(2002)尼克（金球獎得主安東尼拉帕格利亞，《老大靠邊閃》）是紐約消防隊隊長，在911事件發生時，為了撤空紐約世貿大樓，他的12名隊友有8名喪生其中，他內心的傷痛可想而知。但是尼克是個不擅言語的人，如此便很難抒發他的情緒，經驗豐富的記者瓊安（雪歌妮薇佛，《異形》、《陰森林》）決心要幫助他。在911過後的連續幾天，瓊安訪問了尼克，藉此他得以用言語，來悼念那些英勇的救火兄弟。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583257&content_id=&ch_id=46&epg_name=餘燼追思&stype=name', '06274', 0),
(5, '06/27', 'HBO', '06:00~06:30', '好萊塢好好看 #602', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583258&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '06275', 0),
(6, '06/27', 'HBO', '06:30~07:55', '海綿寶寶歷險記', '', '動畫', '\r\n史蒂芬海倫伯格 (Stephen Hillenburg)', '', '(2004)大人小孩都愛的海綿寶寶也有電影版囉！在風景優美的比基尼島海域下生活著一群特殊的海底生物，他們組成了一個不被世人所知曉的海底世界。這是一個充滿了快樂的王國，這裡的居民都過著無憂無慮的生活。\n\r\n　 住在一座大鳳梨房子裡的小海綿塊就是這個王國中的一員，他的朋友都稱他為「穿著方型短褲的海綿寶寶」。他每天都和朋友沉浸在狂歡派對和美味的餡餅裡，享受著這悠閒而自在的生活。然而這一天，海底王國平靜而快樂的生活被打亂了，國王海神的王冠突然被人偷走。種種跡象表明，偷走王冠的是一隻小小的，骯髒的臭蟲。\n\r\n 　原來這一切都是蟹老闆的死對頭「皮老闆」的邪惡計劃，它把罪嫁禍給蟹老闆，海神因而大發雷霆要處死蟹老闆，為解救蟹老闆，必須在海神限定的6天內將王冠找回來。於是海綿寶寶他邀請了笨拙但心地善良的海星朋友派大星一起去奪回王冠。向著未知的目的地貝殼城出發，海綿寶寶和派大星將有一場艱難的旅程，他們將要面臨到種種危險和考驗', 'http://www.niotv.com/epg_content.php?epg_no=1583259&content_id=&ch_id=46&epg_name=海綿寶寶歷險記&stype=name', '06276', 0),
(7, '06/27', 'HBO', '07:55~09:55', '贖罪', '', '劇情', '\r\n喬萊特 (Joe Wright)', '', '(2007)二次大戰期間，一名年輕人為了逃避誤判的性侵牢獄之災而從軍，他必須活著才能回鄉與他的真愛重聚…凱拉奈莉與《納尼亞傳奇》詹姆斯麥艾維主演。 \n\r\n這個講述經歷了數十年的愛情與仇恨的故事，一個錯誤的誣告和想像影響著兩個家族與數人的一生，讓故事裡的主人翁人生巨變，從而走向不同且極端痛苦的分軌。 \n\r\n1935年英格蘭氣溫最高的一天二次大戰的陰影漸漸逼近，而白昂妮塔利斯（莎柔絲羅南飾）與家人在維多利亞哥德式的豪宅中，過著優渥的生活。他們全家一起共度週末時，長久以來壓抑的情緒因為酷熱逐漸浮上台面，形成一股令人不安的威脅與危險。 \n\r\n13歲的白昂妮塔利斯是個初出茅廬的作家，愛幻想，充滿想像力，她不經意的望見因受不了酷熱，而脫光衣服在自家噴水池戲水的大姐西希莉雅塔利斯(凱拉奈莉飾)，與恰巧經過的僕人兒子羅比(詹姆斯麥艾維飾)情意深長噯味的對望，而在腦裡產生了扭曲與怪誕的想像。羅比與西希莉雅塔利斯自小一同長大，青梅竹馬暗自相許，卻因為階級與身份而無法向對方表白，而一直保持著距離... \n\r\n就在二人決定跨越階級身份交往時，白昂妮塔利斯的表姐羅拉(Juno Temple飾)被強暴，一直在心中扭曲放大西希莉雅塔利斯有所不軌的白昂妮塔利斯，卻在此時出面指控兇手是羅比，不論他如何反駁，白昂妮塔利斯一口咬定並且以腦中想像的各種畫面指控他，羅比於是為了自己不曾犯過的罪刑入獄，這對情侶的感情也來不及發芽就告終結。 \n\r\n很快的二次大戰爆發，羅比也加入了軍隊上戰場從軍去，羅比在撤退時被俘，卻在此時與已成為紅十字會護士的白昂妮塔利斯相會，一切往事也漸漸浮出水面...為了再度回鄉見到真愛的羅比，除了要洗刷罪名，也得在這場兵荒馬亂的戰爭中想辦法存活下來.....。 \n\r\n曾改編同樣是文學名著「傲慢與偏見」的英國導演喬懷特(Joe Wright)，此次則改編英國作家伊恩·麥克尤恩(Ian McEwan)的同名愛情小說，並請到曾撰寫《沈靜的美國人》的克里斯多夫漢普頓擔任編劇，本片也是凱拉奈莉與喬懷特自《傲慢與偏見》後二度合作，片中綺拉奈特莉大膽裸露與精彩的演出，為本片入圍第65屆金球獎最佳影片(戲劇類)、最佳男主角(戲劇類)---詹姆斯麥艾維、最佳女主角(戲劇類)、最佳女配角(莎柔絲羅南)、最佳導演、最佳劇本和最佳配樂共七項大獎。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583260&content_id=&ch_id=46&epg_name=贖罪&stype=name', '06277', 0),
(8, '06/27', 'HBO', '09:55~11:45', 'CIA追緝令', '', '動作冒險', '\r\n羅傑唐納森 (Roger Donaldson)', '', '(2003)柯林法洛飾演的詹姆斯克里頓是美國中央情報局最新招募來的新成員，在著名的CIA訓練營地，「The Farm」裡接受CIA老鳥─華特柏克(艾爾帕西諾飾演)的訓練。在歷經一連串非人的試驗之後，成績一向名列前矛的詹姆斯卻意外的刷下來，被迫退出CIA的陣容。\n\r\n　 就在詹姆斯遭到人生最大打擊而失魂落魄時，華特柏克找上門表示其實詹姆斯並未遭到CIA剔除，而是他另有重要的秘密任務。詹姆斯被賦予一項特別的臥底任務，必須潛在中情局裡找出CIA裡的的壞份子，但是卻又不能讓任何人發現，他唯一的依靠就是華特柏克。\n\r\n　 柯林法洛目前是好萊塢最炙手可熱的新星，2003年有許多他所參與的電影即將上映，而柯林法洛的角色越來越重要，表現也越來越出色，有挑戰湯姆克魯斯以及布萊德彼特的實力。', 'http://www.niotv.com/epg_content.php?epg_no=1583261&content_id=&ch_id=46&epg_name=CIA追緝令&stype=name', '06278', 0),
(9, '06/27', 'HBO', '11:45~13:25', '醉鄉民謠', '', '劇情', '\r\n伊森柯恩 (Ethan Coen)', '', '(2013)本片榮獲2013年坎城影展評審團大獎及金球獎最佳影片、最佳男主角、最佳歌曲提名。由柯恩兄弟執導，改編自60年代民謠歌手勒維恩戴維斯親身經歷，凱莉墨里根、賈斯丁、奧斯卡伊薩克領銜演出。 \n\r\n   在紐約的寒冬中，失意歌手抱著橘貓，站在時代的交界，好運似乎永不臨頭。窮困潦倒的他沒錢沒房，只能在友人公寓沙發間寄居流浪，人際關係也同樣漂泊，心愛的人是別人的女友，家人更是輕視他的音樂夢。儘管生活一團亂，為了能在音樂巨擘前演出，他仍堅持搭上便車前往遙遠的芝加哥。 \n\r\n   曾以《巴頓芬克》奪下坎城金棕櫚獎的美國導演柯恩兄弟，這次將帶領觀眾回到巴布狄倫王國降臨之前的六○年代，看柯恩式幽默如何為影片塑造出荒誕又詩意的氛圍，一同感受追夢大不易的人生故事。 \n\r\n   電影配樂由葛萊美配樂大師提朋柏奈特(T-Bone Burnett)操刀，他曾是巴布狄倫的吉他手，更是多位知名歌手的製作人，包括艾爾頓強(Elton John)、里昂羅素(Leon Russell)、數烏鴉合唱團(Counting Crows)以及壁花合唱團(The Wallflowers)。《醉鄉民謠》則是他和柯恩兄弟第三度合作，榮獲了洛杉磯影評人協會最佳音樂獎，以及金球獎最佳原創曲提名之殊榮。', 'http://www.niotv.com/epg_content.php?epg_no=1583262&content_id=&ch_id=46&epg_name=醉鄉民謠&stype=name', '06279', 0),
(10, '06/27', 'HBO', '13:25~15:20', '鋼鐵墳墓', '', '動作冒險', ' \r\n麥克哈夫斯強 (Mikael Hafstrom)', '', '(2013)席維斯史特龍、阿諾史瓦辛格兩大老牌動作巨星聯合演出動作驚悚片。史特龍這次飾演全世界最頂尖的安全系統設計師，企圖從依照自己所寫的維安設計準則而造的監獄裡逃脫。\n\r\n動作天王席維斯史特龍與阿諾史瓦辛格都是好萊塢的超級巨星，很難說哪一個才是美國動作片的真正經典形象代表；這是他們第一次成為合作夥伴、共同面對同一個敵人。 \n\r\n雷布瑞林（席維斯史特龍飾）是一名監獄興建與保安設計師，在全球業界無人能出其右，他同時也是頂尖的逃獄高手。收入驚人的他，實際工作內容就是偽裝成罪犯，被關入戒備森嚴的監獄，再設法逃脫，並將這座監獄的安管漏洞紀錄下來，依此而做強化改善。目前為止，美國聯邦監獄管理局安全防衛屬最高規格的監獄他都待過，越獄成功率高達百分之百。 \n\r\n有一天，一件特殊的案子找上了雷，希望他評量一座民間經營的體制外監獄「鋼鐵墳墓」，對方開出的酬勞是平常價碼的兩倍。這間監獄是根據雷自己寫的監獄維安設計指南而建造的，可以說，讓雷越獄成功的那些嚴密監獄的安全漏洞，在這座監獄裡通通都沒有。無論是報酬還是工作內容的挑戰度，這件案子都對雷極具誘惑力，於是他接下這件案子，準備「入獄」。 \n\r\n該監獄的所在位置極度保密，為了營造真實的監禁情境，雷在獄中將無法和自己在監獄外的工作團隊進行任何聯絡與溝通。入獄後，雷發現被關入「鋼鐵墳墓」中的罪犯都是世界上最為恐怖的危險份子，而且在這座建造的猶如迷宮的高科技監獄之中，監禁犯人的都是透明的玻璃牢房，不但隨時都有監視器監控著，一層又一層的重裝警衛配置更是做到滴水不漏，連雷都找不出破綻。但是這座監獄最可怕的，是以打擊不聽話的囚犯為樂的殘忍典獄長威拉哈柏（吉姆卡維佐飾）。 \n\r\n雷在獄中受到典獄長的注意，以各種手法折磨、打擊雷；當雷想使用在入獄前就設定好的脫逃暗號時，典獄長卻直說他聽不懂，這時，雷才發現自己已在不知不覺當中落入他人設下的陷阱，而且敵方的真實身分不明。萬不得已之下，雷向同樣被關在「鋼鐵墳墓」中的神秘大哥艾米羅麥爾（史瓦辛格飾）請求幫助，不但要從獄中的暴力與猜忌脫困，更要找出事件背後的真相。 \n\r\n本片不只是單純的動作片，更有設計巧妙的劇本，讓片中角色鬥狠也鬥智；尤其集結兩大動作巨星的卡司陣容更是一大賣點。', 'http://www.niotv.com/epg_content.php?epg_no=1583263&content_id=&ch_id=46&epg_name=鋼鐵墳墓&stype=name', '062710', 0),
(11, '06/27', 'HBO', '15:20~17:10', '超級選秀日', '', '劇情', ' \r\n伊凡萊蔓 (Ivan Reitman)', '', '(2014)面對球團內的壓力，敵對經理人的算計，甚至被開除的威脅，桑尼該如何在這超級選秀日中運籌帷幄、機關算盡，挑選出陣容最堅強的夢幻球隊呢？\n\r\n本片由《型男飛行日誌》製作團隊操刀，《飯飯之交》導演艾凡瑞特曼執導，《傑克萊恩︰詭影任務》凱文科斯納、《藥命俱樂部》珍妮佛嘉納領銜主演。 \n\r\n國家美式足球聯盟選秀日到來了，總經理桑尼威佛有權這天為克里夫蘭隊在第一輪優先挑選球員，但他必須面對上百個懷抱夢想的青年，並在專業和私人情感間做出正確決定。 \n\r\n同時，他也面臨球團內的壓力、敵對經理人的算計、被開除的威脅，要在這超級選秀日中運籌帷幄，挑選出陣容最堅強的夢幻球隊！ \n\r\n曾演出許多運動片的凱文科斯納表示並不想拍重複的故事，但他認為《超級選秀日》並未將重心放在球場上的比賽，而是探索比賽背後球隊營運的商業機密，因此有興趣演出，也拜訪了許多國家美式足球聯盟的球隊總經理。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583264&content_id=&ch_id=46&epg_name=超級選秀日&stype=name', '062711', 0),
(12, '06/27', 'HBO', '17:10~19:30', '復仇者聯盟', '', '動作冒險', '\r\n喬斯溫登 (Joss Whedon)', '', '(2012)由漫威影業所推出的超級英雄系列電影，鋼鐵人、浩克、雷神索爾、美國隊長、鷹眼與黑寡婦現身，共同組成「復仇者聯盟」向邪惡勢力宣戰。\n\r\n本片耗資2.2億美元，由小勞勃道尼、克里斯伊凡、馬克魯法洛、克里斯漢斯沃、史嘉蕾喬韓森、傑瑞米雷納與山謬傑克森主演，喬斯溫登執導的漫威影業(Marvel Studio)年度鉅片，改編自1963年的同名暢銷漫畫。\n\r\n邪惡勢力悄悄集結，力量已龐大到極為驚人的地步，危機已非任何英雄能獨力面對。為了保護地球的安危，神盾局(S.H.I.E.L.D)局長尼克福瑞(山謬傑克森飾)費盡心力將各方超級英雄聚集一堂，包括鋼鐵人、綠巨人浩克、雷神索爾、鷹眼與黑寡婦，還有剛從冰獄裡甦醒的美國隊長。\n\r\n於是，「復仇者聯盟」就此組成，然而各自擁有強大神力或武器的超級英雄，必須能夠放下彼此之間的偏見，同心協力找到合作的模式，才有機會與邪惡勢力一博。而要阻止邪惡計畫的他們，團結的力量真能成功擊敗敵人？\n\r\n漫威影業(Marvel Studio)結合旗下著名漫畫人物，延伸出二部「復仇者」系列電影，本片為第二部，由《X戰警3：最後戰役》編劇塞克潘執筆撰寫劇本，而第一部為《美國隊長》。\n\r\n為推出《復仇者聯盟》系列，漫威影業早已為各路英雄推出電影，並在片尾留下伏筆，也因此飾演個別英雄人物的影星通通到齊。眾星雲集的程度前所未見。\n\r\n而性感女星史嘉蕾喬韓森飾演的頂尖間諜黑寡婦，則在眾多英雄中注入一點女人味。飾演綠巨人的馬克魯法洛則從默默無名的配角到入圍奧斯卡，終於接演首部商業大片，為飾演第三代浩克還特地減重15磅。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583265&content_id=&ch_id=46&epg_name=復仇者聯盟&stype=name', '062712', 0),
(13, '06/27', 'HBO', '19:30~21:00', '地心引力', '', '靈異驚悚', ' \r\n艾方索柯朗 (Alfonso Cuaron)', '', '(2013)《你他媽的也是》知名墨西哥導演艾方索柯朗執導，奧斯卡影后珊卓布拉克、喬治克魯尼主演。面對艱辛的太空任務，他們能如願返回地球與家人團聚嗎？\n\r\n本片是第86屆奧斯卡金像獎最大贏家，包括最佳導演、最佳配樂、最佳攝影、最佳剪輯、最佳視覺特效、最佳音效、最佳音效剪輯獎項，由《你他媽的也是》知名墨西哥導演艾方索柯朗耗時七年自編自導的作品，奧斯卡影后珊卓布拉克、喬治克魯尼主演，片中細膩呈現了人面對死亡的孤寂與恐懼。 \n\r\n在一次將太空人送至太空執行任務的行動之中，喬治克魯尼飾演一名最後一次出任務的資深太空人，珊卓布拉克飾演的史東博士則是第一次上太空。不料，他們在太空中遭遇危難，史東博士和太空站之間的繩索連結斷了……。 \n\r\n在因為無重力環境、而舉步維艱的狀態之下，有限的氧氣量壓縮他們的生存時間：他們能夠一起回到地球上嗎？史東博士有辦法再次見到她的女兒嗎？ \n\r\n為了呈現太空人的失重狀態，劇組設計12條鋼絲、不到1平分公尺的懸吊系統，將珊卓、克魯尼吊在空中。珊卓特地致電太空站和美國太空總署的太空人凱薩琳柯曼聊天，揣摩太空人的生活，', 'http://www.niotv.com/epg_content.php?epg_no=1583266&content_id=&ch_id=46&epg_name=地心引力&stype=name', '062713', 0),
(14, '06/27', 'HBO', '21:00~23:00', '哥吉拉', '', '科幻神怪', ' \r\n蓋瑞斯愛德華 (Gareth Edwards)', '', '(2014)闊別大銀幕十年，巨獸之王【哥吉拉】正宗回歸，經典嘶吼撼動全球，人類面對前所未有的浩劫，塵封真相即將公諸於世。\n\r\n影史上最傳奇的怪獸之王《哥吉拉》又回來了，由《異獸禁區》蓋瑞斯愛德華執導，由美日團隊首度攜手合作，《絕命毒師》布萊恩克萊斯頓主演。這次是哥吉拉第28次翻拍。影片保留原版哥吉拉的造型，但增加新角色，且跨越1954年到現代的三個不同時代，故事發生地主要搬到美國，夏威夷、賭城維加斯和舊金山將被怪獸掃為平地。最終大戰場面在舊金山中國城拍攝。 \n\r\n哥吉拉就像是一個隱世獨立的末代武士，不願出現在世人面前，但是自然界即將失衡，逼得牠不得不現身。而人類在面對哥吉拉如大自然反撲般排山倒海的力量時，儘管毫無招架之力，仍然呈現出驚人的勇氣與寬容。 \n\r\n有別於過去是實體模型，導演表示，這次全部是電腦特效，且是3D版。不過因為它並非像「哈比人」裡的火龍一樣會「說話」，也就不必要太多的表情，片中對它的面部特效鏡頭很少，大部分時間人們只能遠遠望去它身軀或看到局部。 \n\r\n哥吉拉的怒吼一向是牠的特徵。導演透露哥吉拉的吼聲來源於皮手套撫弄低音提琴，當然有後期變調混音，片場錄回聲時，用了高四米寬約一條街總功率10萬瓦的巨無霸音箱陣列，且一共錄製了50多種不同叫聲，最終選擇了一種聽起來最適合的聲音。 \n\r\n本片卡司包括亞倫泰勒強森、茱麗葉畢諾許、渡邊謙外，更請­來1954年演出日本電影《哥吉拉》演員寶田明參與演出。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583267&content_id=&ch_id=46&epg_name=哥吉拉&stype=name', '062714', 0),
(15, '06/27', 'HBO', '23:00~00:35', '立地成佛', '', '靈異驚悚', '\r\n菲利普凱蘭(Philippe Caland)\r\n', '', '(2014)深陷喪母之痛的男子注意到一本心理治療師的著作，他綁架了作者，並以他的精神理論行動與反應因果理論，來揭露心理治療師的所作所為...\n\r\n非洲裔奧斯卡獎得主佛瑞斯特惠塔克領銜主演的恐怖片，這是他繼《漣漪效應》後和導演Philippe Caland二度合作的電影作品。 \n\r\nTommy Carter曾因喝醉酒引起車禍險些喪命，幾年後他成為一名心理治療師和精神顧問，主張融合世界各宗教的精髓建立積極的人生，並出版一本傳播自己思想的書。 \n\r\n深陷喪母之痛的Angel Sanchez注意到了這本書，他開始努力研究，分析書中的因果報應理論，並綁架Tommy Carter，以他的精神理論行動與反應因果理論，來揭露Tommy Carter的所作所為..。\n\r\n一場酒駕車禍幾乎奪走湯米卡特的生命，多年後他已經是一名治療師/心靈諮商師，湯米主張世界宗教的融合與積極性。他成功地擴展了自己的諮商工作，並出了一本相當暢銷的書。某天，這本書吸引了安吉爾山契的注意，安吉爾是一名十分痛苦的男子，一直對母親”過早“離世無法釋懷。當卡特把山契當做自己的客戶，希望藉此替他負債累累的弟弟班籌一點錢時，情況卻隨即變得很糟糕。', 'http://www.niotv.com/epg_content.php?epg_no=1583268&content_id=&ch_id=46&epg_name=立地成佛&stype=name', '062715', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150628`
--

CREATE TABLE IF NOT EXISTS `t20150628` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150628`
--

INSERT INTO `t20150628` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/28', 'HBO', '23:00~00:35', '立地成佛', '', '靈異驚悚', '\r\n菲利普凱蘭(Philippe Caland)\r\n', '', '(2014)深陷喪母之痛的男子注意到一本心理治療師的著作，他綁架了作者，並以他的精神理論行動與反應因果理論，來揭露心理治療師的所作所為...\n\r\n非洲裔奧斯卡獎得主佛瑞斯特惠塔克領銜主演的恐怖片，這是他繼《漣漪效應》後和導演Philippe Caland二度合作的電影作品。 \n\r\nTommy Carter曾因喝醉酒引起車禍險些喪命，幾年後他成為一名心理治療師和精神顧問，主張融合世界各宗教的精髓建立積極的人生，並出版一本傳播自己思想的書。 \n\r\n深陷喪母之痛的Angel Sanchez注意到了這本書，他開始努力研究，分析書中的因果報應理論，並綁架Tommy Carter，以他的精神理論行動與反應因果理論，來揭露Tommy Carter的所作所為..。\n\r\n一場酒駕車禍幾乎奪走湯米卡特的生命，多年後他已經是一名治療師/心靈諮商師，湯米主張世界宗教的融合與積極性。他成功地擴展了自己的諮商工作，並出了一本相當暢銷的書。某天，這本書吸引了安吉爾山契的注意，安吉爾是一名十分痛苦的男子，一直對母親”過早“離世無法釋懷。當卡特把山契當做自己的客戶，希望藉此替他負債累累的弟弟班籌一點錢時，情況卻隨即變得很糟糕。', 'http://www.niotv.com/epg_content.php?epg_no=1583268&content_id=&ch_id=46&epg_name=立地成佛&stype=name', '06281', 0),
(2, '06/28', 'HBO', '00:35~02:45', '白宮末日', '', '動作冒險', '\r\n羅蘭艾馬瑞奇 (Roland Emmerich)', '', '(2013)《明天過後》、《2012》票房大導羅蘭艾姆立克再炸美國白宮！查尼塔圖、瑪姬葛倫霍主演。約翰如何拯救總統與危機不斷的國家？並確保心愛的女兒安然無恙？\n\r\n《明天過後》、《2012》羅蘭艾姆立克執導，與《蜘蛛人:驚奇再起2》編劇詹姆斯范德比爾特，聯手打造動作鉅片。由《舞棍俱樂部》查尼塔圖、《落日殺神》傑米福克斯、《黑暗騎士》瑪姬葛倫霍、《最後一封情書》理察詹金斯聯合演出。 \n\r\n擔任警察的約翰(查尼塔圖飾)，夢想成為駐白宮特工直接保護總統(傑米福克斯飾)。他為了不讓面試失敗的壞消息讓女兒失望，決定帶著女兒參加白宮導覽行程。沒想到在參觀過程中，白宮遭到一群配備重型軍械的神秘軍事組織佔領，總統陷入被劫持的危機。 \n\r\n臨危受命的約翰，隻身前往解救總統與化解國家危機，同時也必須確保心愛的女兒平安脫身。約翰在行動過程中，除了與上司（瑪姬葛倫霍飾）裡外聯手，更意外與謀略十足的總統大人並肩作戰，他們能否在差距懸殊的較量中擊退敵人，捍衛美國精神？ \n\r\n《白宮末日》劇本的創作者為《蜘蛛人:驚奇再起2》編劇-詹姆斯范德比爾特（James Vanderbilt），電影公司為了購買該劇本，支付高達300萬美元的高額費用。艾姆立克導演在《ID4：星際終結者3D》與《2012》以海嘯吞噬白宮後，此次以震驚世人的恐怖襲擊，再度讓美國白宮墜入末日。', 'http://www.niotv.com/epg_content.php?epg_no=1583269&content_id=&ch_id=46&epg_name=白宮末日&stype=name', '06282', 0),
(3, '06/28', 'HBO', '02:45~04:30', '醉後末日', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2013)導演艾德格萊特加上賽門佩吉與尼克佛羅斯特，這對銀幕活寶所組成的英國無厘頭鐵三角（《活人牲吃》《終棘警探》）就夠令人興奮了，再加上馬丁費里曼(《新世紀福爾摩斯》)與皮爾斯布洛斯南來搶戲，這部做為「血腥冰淇淋三部曲」最終回的《茫到世界盡頭》更加不能錯過！ \n\r\n多年前，五個意氣風發的小屁孩發誓要在一夜之間喝遍同一條路上的12間酒吧，卻在最後一間酒吧「世界盡頭」之前喝掛了！這個奇恥大辱讓已經變成老屁股的蓋瑞金耿耿於懷，時過二十年，他突然發神經把各奔東西的四位老友連哄帶騙揪出來，一同回到老家再次挑戰。當他們回到小鎮，似乎一點都沒變，卻有股說不出的不對勁，當他們一家一家闖關，逐步發現要挑戰的不只是喝到「世界盡頭」，更要挽救人類面臨世界末日的命運！ \n\r\n《茫到世界盡頭》是一部「玩到盡」的電影，醉醺醺的魯蛇大叔變成英雄就算了，劇情翻轉的速度簡直比翻書翻臉都要快，讓人目不暇給，拍案叫絕。奇幻影展為什麼這麼熱愛賽門佩吉這伙人，不是沒原因的。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583270&content_id=&ch_id=46&epg_name=醉後末日&stype=name', '06283', 0),
(4, '06/28', 'HBO', '04:30~06:00', '脫線教父', '', '喜劇', ' \r\n麥可瑞契 (Michael Ritchie)', '', '(1997)小女孩安娜貝爾(瑪拉威爾森飾，《小魔女》)對於自己的生活感到絕望透頂，一方面，他的哥哥永遠當她是長不大的小孩；另一方面，她那歌手兼演員的爸爸，竟決定放下賴以為生的計程車事業，參加好萊塢一齣大型音樂劇的試鏡，如果他不能拿下主角的位子，他們全家就要搬到偏僻的內布拉斯加州。對於一個七歲的紐約小女孩而言，還有什麼比這更糟的呢？ \n\r\n   於是，安娜貝爾開始向上天祈禱，懇求一個仙子教母下凡帶來奇蹟，幫助爸爸通過試鏡。在一個神奇的晚上，她的祈禱竟然有了回音...但是，下凡來的不是和藹可親的仙子教母，反倒是一個手執魔杖的中年教父莫瑞(馬丁蕭特飾，《星戰毀滅者》)。 \n\r\n   他一心想幫小安娜，但是他的魔法卻失靈了，每一次都造成爆笑烏龍的結果...雪上加霜的是，邪惡的仙子教母克勞蒂亞(凱薩琳透納飾，《瘋狂殺手俏媽咪》)滲入北美仙子教母協會一年一度的會議，打算偷取她們所有的魔杖與魔力，助長自己的勢力。此時，莫瑞法術再度失靈，竟然把安娜貝爾的爸爸變成了中央公園的一座雕像，如果24小時內他無法修正錯誤，爸爸就永遠也變不回來了！隨著邪惡教母克勞蒂亞一步步的逼近，脫線教父莫瑞是否能扭轉乾坤，實現安娜貝爾小小的心願呢？ ', 'http://www.niotv.com/epg_content.php?epg_no=1583271&content_id=&ch_id=46&epg_name=脫線教父&stype=name', '06284', 0),
(5, '06/28', 'HBO', '06:00~07:25', '科學怪犬', '', '動畫', '\r\n提姆波頓 (Tim Burton)', '', '(2012)《魔境夢遊》怪才提姆波頓重拍自己28年前的黑白短片《科學怪犬》，此次以3D黑白動畫呈現溫馨動人的黑色喜劇。當維多與愛犬史巴基在科學實驗中展開新生之旅的同時，竟驚動小鎮上的街坊鄰居...\n\r\n   小男孩維多最好的朋友就是他的小狗史巴基，維多是一個瘋狂小科學家，成天不是與史巴基玩在一起就是做他的科學實驗。但有一天史巴基卻不幸在路上被車撞死，維多因失去愛犬傷心不已，他在課堂上看到老師用電力讓死青蛙動了起來，於是想用閃電讓史巴基復活。實驗成功了，史巴基死而復生。\n\r\n   不料，被維多同學發現了這件事，維多能讓動物起死回生的傳言在學校傳開，小朋友紛紛找來各種死去的寵物，參考維多的作法，結果各種古怪寵物全部都復活了，搞得小鎮天下大亂…\n\r\n   提姆波頓這次向多部恐怖片和科幻片致敬，採用了不少元素，例如主角維多的科學老師維古斯基，取材自《恐怖蠟像館》男星雲遜派斯；同學仔納索的髮型則模仿《科學怪人》主角，女同學則姓凡赫辛，連死而復生的古怪寵物，包括哥斯龜、吸血殭貓、類似小精靈的怪蝦等都會令影迷發出會心一笑。\n\r\n   提姆波頓當年拍攝此片時由真人真狗演出，但因劇情不適合小朋友而惹惱迪士尼公司。他也因缺少預算，不得不把規格縮為短片，如今圓夢拍成3D版，片中高度風格化的陰影設計讓整部片呈現黑色詭異卻又溫馨動人的氛圍。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583272&content_id=&ch_id=46&epg_name=科學怪犬&stype=name', '06285', 0),
(6, '06/28', 'HBO', '07:25~08:45', '史酷比：格鬥狂熱迷', '', '動畫', '\r\n布蘭登維耶蒂 (Brandon Vietti)', '', '(2014)薛奇和史酷奇贏得世界摔角大賽的入場券，大夥坐上車準備到世界摔角城參與這場盛會。然而，一隻神秘的幽靈熊出現，威脅要破壞比賽。史酷奇、薛奇、葳瑪、黛芬和弗雷德必須和世界摔角大賽的超級明星Triple H、約翰希南、肯恩、米茲、布羅狄斯克雷、桑提諾馬瑞拉、辛卡拉及艾珍李合作破解此案。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583273&content_id=&ch_id=46&epg_name=史酷比：格鬥狂熱迷&stype=name', '06286', 0),
(7, '06/28', 'HBO', '08:45~10:15', '愛情無限譜', '', '愛情文藝', '\r\n彼得蘇列特 (Peter Sollett)', '', '(2008)一場演唱會與五分鐘的約會，從此改變兩個陌生人，他們徹夜未眠在約紐街頭尋找喜愛樂隊的演唱會，並且陷入愛河！ \n\r\n尼克(麥可塞拉飾)是個高中樂團的貝斯手，剛結束一段心碎的戀情，對剛分手的女友始終舊情難捨，但沒想到女友早就忘了他，分手沒幾天就帶著新男友在一場演唱會中趴趴走，讓他深受打擊。 \n\r\n尼克在演唱會中結識了諾拉(Kat Dennings飾)，陰錯陽差之下而走在一起，同樣熱愛音樂的兩人，決定一同尋找喜愛樂團的秘密演唱會，在這個充滿驚喜的冒險夜晚中，兩人越來越投機，情感也慢慢的加溫....。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583274&content_id=&ch_id=46&epg_name=愛情無限譜&stype=name', '06287', 0),
(8, '06/28', 'HBO', '10:15~11:45', '阿爾法爸爸', '', '喜劇', '\r\nDeclan Lowney \r\n', '', '(2013)艾倫帕特奇（史帝夫庫根 飾演）因為醜聞事件讓事業盪到谷底，他無法再主持全國性的脫口秀節目，只好回老家重新做起電台主播。而他在電台策畫了一個叫做《阿爾法爸爸》的新節目，就在他極力挽回自己的公眾人物形象時，卻被捲入一宗暴力事件，讓局勢再次變得複雜..。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583275&content_id=&ch_id=46&epg_name=阿爾法爸爸&stype=name', '06288', 0),
(9, '06/28', 'HBO', '11:45~13:15', '地心引力', '', '靈異驚悚', ' \r\n艾方索柯朗 (Alfonso Cuaron)', '', '(2013)《你他媽的也是》知名墨西哥導演艾方索柯朗執導，奧斯卡影后珊卓布拉克、喬治克魯尼主演。面對艱辛的太空任務，他們能如願返回地球與家人團聚嗎？\n\r\n本片是第86屆奧斯卡金像獎最大贏家，包括最佳導演、最佳配樂、最佳攝影、最佳剪輯、最佳視覺特效、最佳音效、最佳音效剪輯獎項，由《你他媽的也是》知名墨西哥導演艾方索柯朗耗時七年自編自導的作品，奧斯卡影后珊卓布拉克、喬治克魯尼主演，片中細膩呈現了人面對死亡的孤寂與恐懼。 \n\r\n在一次將太空人送至太空執行任務的行動之中，喬治克魯尼飾演一名最後一次出任務的資深太空人，珊卓布拉克飾演的史東博士則是第一次上太空。不料，他們在太空中遭遇危難，史東博士和太空站之間的繩索連結斷了……。 \n\r\n在因為無重力環境、而舉步維艱的狀態之下，有限的氧氣量壓縮他們的生存時間：他們能夠一起回到地球上嗎？史東博士有辦法再次見到她的女兒嗎？ \n\r\n為了呈現太空人的失重狀態，劇組設計12條鋼絲、不到1平分公尺的懸吊系統，將珊卓、克魯尼吊在空中。珊卓特地致電太空站和美國太空總署的太空人凱薩琳柯曼聊天，揣摩太空人的生活，', 'http://www.niotv.com/epg_content.php?epg_no=1583276&content_id=&ch_id=46&epg_name=地心引力&stype=name', '06289', 0),
(10, '06/28', 'HBO', '13:15~15:15', '哥吉拉', '', '科幻神怪', ' \r\n蓋瑞斯愛德華 (Gareth Edwards)', '', '(2014)闊別大銀幕十年，巨獸之王【哥吉拉】正宗回歸，經典嘶吼撼動全球，人類面對前所未有的浩劫，塵封真相即將公諸於世。\n\r\n影史上最傳奇的怪獸之王《哥吉拉》又回來了，由《異獸禁區》蓋瑞斯愛德華執導，由美日團隊首度攜手合作，《絕命毒師》布萊恩克萊斯頓主演。這次是哥吉拉第28次翻拍。影片保留原版哥吉拉的造型，但增加新角色，且跨越1954年到現代的三個不同時代，故事發生地主要搬到美國，夏威夷、賭城維加斯和舊金山將被怪獸掃為平地。最終大戰場面在舊金山中國城拍攝。 \n\r\n哥吉拉就像是一個隱世獨立的末代武士，不願出現在世人面前，但是自然界即將失衡，逼得牠不得不現身。而人類在面對哥吉拉如大自然反撲般排山倒海的力量時，儘管毫無招架之力，仍然呈現出驚人的勇氣與寬容。 \n\r\n有別於過去是實體模型，導演表示，這次全部是電腦特效，且是3D版。不過因為它並非像「哈比人」裡的火龍一樣會「說話」，也就不必要太多的表情，片中對它的面部特效鏡頭很少，大部分時間人們只能遠遠望去它身軀或看到局部。 \n\r\n哥吉拉的怒吼一向是牠的特徵。導演透露哥吉拉的吼聲來源於皮手套撫弄低音提琴，當然有後期變調混音，片場錄回聲時，用了高四米寬約一條街總功率10萬瓦的巨無霸音箱陣列，且一共錄製了50多種不同叫聲，最終選擇了一種聽起來最適合的聲音。 \n\r\n本片卡司包括亞倫泰勒強森、茱麗葉畢諾許、渡邊謙外，更請­來1954年演出日本電影《哥吉拉》演員寶田明參與演出。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583277&content_id=&ch_id=46&epg_name=哥吉拉&stype=name', '062810', 0),
(11, '06/28', 'HBO', '15:15~17:05', '世界Battle', '', '歌舞音樂', ' \r\n李貝森(Benson Lee)\r\n', '', '(2013)一群美國的街舞少年組隊，準備參加世界街舞大賽，然而在特訓的過程當中，這些選手們卻大小爭執不斷；舞蹈教練有辦法可以擺平一切、引領他們奪下冠軍嗎？本片根據真實故事改編。\n\r\n本片的時空背景是2011年在法國舉辦的“壹年尬壹次”街舞大賽，電影故事是根據當時參賽的美國隊的真實經歷改編而成。電影找來許多真正的舞者參與演出，讓片中的舞蹈場面十分有看頭。 \n\r\n本片中的世界決賽場景，還可看見來自台灣的參賽隊伍，這些選手們還將在舞台上揮舞巨大的青天白日滿地紅旗幟，可說是送給台灣觀眾的一個小驚喜！ \n\r\n美國隊已經有十五年不曾在“壹年尬壹次”世界大賽中拿到冠軍了，眼看距離比賽只剩三個月的時間，洛杉磯的嘻哈界大亨唐帝找來前冠軍隊的教練布雷克（喬許哈洛威飾），並集結美國的頂尖街舞舞者，在這三個月當中進行密集訓練。 \n\r\n在教練布雷克的魔鬼特訓之下，這批選手雖然個個都十分努力地精益求精，但是年輕又自信十足的他們爭吵不斷，難以達成良好的合作效果。布雷克該採用什麼樣的辦法，才能夠讓這些舞者團結一致、培養默契，好讓美國隊獲得冠軍呢？ \n\r\n電影特地找來《不可能的任務：鬼影行動》喬許哈洛威飾演布雷克教練，而嘻哈歌手克里斯小子更為了本片染了一頭金髮，原本舞蹈功力就十分堅強的他，在片中飾演一名常惹麻煩、又愛炫燿的B-Boy。', 'http://www.niotv.com/epg_content.php?epg_no=1583278&content_id=&ch_id=46&epg_name=世界Battle&stype=name', '062811', 0),
(12, '06/28', 'HBO', '17:05~19:15', '鋼鐵人3', '', '科幻神怪', '\r\n沙恩布萊克 (Shane Black)', '', '(2013)《鋼鐵人》系列第三集，根據漫威漫畫中最著名的超級英雄之一鋼鐵人的故事改編。由《吻兩下打兩槍》沙恩布萊克執導，小勞勃道尼與葛妮絲派特洛、唐其鐸等原班人馬再續演出，此次加入奧斯卡影帝班金斯利飾演的滿大人，堪稱是繼《黑暗騎士》小丑之後最聰明的反派角色。 \n\r\n在鋼鐵人與眾將士英雄們從外星人手上拯救世界後，難道地球就和平了嗎？然而一股邪惡勢力仍蠢蠢欲動……此次鋼鐵人東尼史塔克，將再次大展身手解除危機，但他卻遭到能力毫無極限的中國巫師「滿大人」 (班金斯利飾)摧毀了他的生活，並對著心愛的女友小辣椒(葛妮絲派特洛飾)說出難以入眠的心事：「我無法入眠，就算睡著了也會做惡夢。」史塔克只能強忍悲痛，靠著精密的高科技裝備尋找幕後主謀，踏上考驗勇氣的冒險艱辛之旅。 \n\r\n當史塔克最終找到強敵，並憑藉睿智予以反擊之際，他卻發現了一個巨大的問題：隨著戰火的升高，到底是身上的鋼鐵戰衣造就了他，還是他成就了這套鋼鐵戰衣？ \n\r\n【鋼鐵人】首次出現於漫威漫畫1963年出版的【懸疑傳說】第39期，隨後從1968年5月的【無敵鋼鐵人】第1期之後，即擁有獨立漫畫系列。在該系列漫畫作品被改編成為電影作品之後，此次《鋼鐵人3》為第一部由中美兩國聯手合拍的超級英雄電影，將分成美國版本、國際版本以及中國版本，范冰冰與王學圻只會在中國版本出現，中國版本會有較多北京拍攝的場景。', 'http://www.niotv.com/epg_content.php?epg_no=1583279&content_id=&ch_id=46&epg_name=鋼鐵人3&stype=name', '062812', 0),
(13, '06/28', 'HBO', '19:15~21:00', '國定殺戮日：無法無天', '', '靈異驚悚', '\r\n詹姆斯狄莫納哥(James DeMonaco)\r\n', '', '(2013)未來的美國有條法令：每年都有十二個小時可以自由犯罪而不犯法；要是有陌生人在你家門口因被追殺而大聲求救，你願意冒險解除保全讓他進屋嗎？伊森霍克主演。\n\r\n本片成本僅三百萬美元，卻在全球締造了超過7800萬美元的票房，投資報酬率超過26倍，是2013年暑假最賺錢的電影，金牌編劇詹姆斯狄莫納哥編導，伊森霍克主演。 \n\r\n影片時空背景是未來的美國，為了釋放國人心中的暴戾之氣，美國政府規定，每年會有十二小時每個人可以自由地犯罪殺人，不必負責也不用接受法律制裁，而且在這十二小時當中，警局和醫院的運作也將完全停擺。 \n\r\n每年3月21日晚上七點至3月22日早上七點，一年一度的「十二小時」又來了，詹姆士薩汀（伊森霍克飾）是一戶四口之家的家長，生活富足的他們在這十二小時中將會開啟整棟屋子的安全裝置，任何人都進不來，待在屋中等這十二小時過去是這家人的選擇。詹姆斯和他的妻子瑪莉（琳納海蒂飾）固然不加入自由犯罪的行列，卻也教導他們的孩子們這是「必要之惡」。 \n\r\n晚間，一名男子在這家人的屋子前方的街道奔跑喊叫，聲稱他被追殺，希望有人可以提供地方讓他躲藏，可是沒有任何一戶人家開門。詹姆士的孩子心軟了，擅自打開保全系統讓那名男子進入家中，卻將追殺那名男子的一群人引至這戶人家門口。這群人不但成功闖入這戶人家家中，還聲稱他們一個都跑不掉……。', 'http://www.niotv.com/epg_content.php?epg_no=1583280&content_id=&ch_id=46&epg_name=國定殺戮日：無法無天&stype=name', '062813', 0),
(14, '06/28', 'HBO', '21:00~23:10', '怒海劫', '', '劇情', ' \r\n保羅葛林葛瑞斯 (Paul Greengrass)', '', '(2013)2009年，發生了兩百年來首件美國貨輪挾持事件，船長為了保護船員安全，自願作為海盜的人質……。真實事件改編，由「神鬼認證」系列導演保羅格林葛萊斯執導。\n\r\n本片改編自真人實事，「神鬼認證」系列導演保羅格林葛萊斯執導，湯姆漢克飾演自願擔任海盜肉票的船長，影片場景幾乎全在船上，情節緊湊，毫無冷場。\n\r\n  本片改編自2009年4月一起深受媒體關注的發生在公海上的新聞事件，貨輪船長同時也是兩個孩子的父親的理察菲利浦為了保護自己的船員離開非洲海岸，而向四名索馬利海盜投降。菲利浦企圖逃亡失敗後，在美國特種部隊海豹部隊的狙擊手射殺其中三名海盜後得到營救。 \n\r\n2009年，美國貨輪阿拉巴馬號在海上遭到挾持，對方是惡名昭彰的索馬利亞海盜！這是兩百年來第一艘美國貨輪遭到洗劫的事件。由湯姆漢克出飾的船長菲利浦為了保護其餘的船員安全，自願獨自一人作為海盜的人質。接著，海盜和美軍對峙了幾天，雙方僵持不下；最後是由歐巴馬總統下令，派遣美國海軍精銳「海豹」突擊隊執行救援任務，在狙擊手射殺了三名海盜之後，順利讓人質平安獲救。 \n\r\n湯姆漢克為了演好這個真實角色，湯姆漢克多次拜訪菲利浦船長本人，務求資料考證真切及詳實。導演保羅格林葛萊斯對此事件有其獨到的角度，除了船長成為人質的那生死存亡的五天之中、和索馬利亞海盜的微妙關係與緊張威脅感，同時也呈現出經濟全球化所帶來的影響與衝擊。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583281&content_id=&ch_id=46&epg_name=怒海劫&stype=name', '062814', 0),
(15, '06/28', 'HBO', '23:10~01:00', '醉後末日', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2013)導演艾德格萊特加上賽門佩吉與尼克佛羅斯特，這對銀幕活寶所組成的英國無厘頭鐵三角（《活人牲吃》《終棘警探》）就夠令人興奮了，再加上馬丁費里曼(《新世紀福爾摩斯》)與皮爾斯布洛斯南來搶戲，這部做為「血腥冰淇淋三部曲」最終回的《茫到世界盡頭》更加不能錯過！ \n\r\n多年前，五個意氣風發的小屁孩發誓要在一夜之間喝遍同一條路上的12間酒吧，卻在最後一間酒吧「世界盡頭」之前喝掛了！這個奇恥大辱讓已經變成老屁股的蓋瑞金耿耿於懷，時過二十年，他突然發神經把各奔東西的四位老友連哄帶騙揪出來，一同回到老家再次挑戰。當他們回到小鎮，似乎一點都沒變，卻有股說不出的不對勁，當他們一家一家闖關，逐步發現要挑戰的不只是喝到「世界盡頭」，更要挽救人類面臨世界末日的命運！ \n\r\n《茫到世界盡頭》是一部「玩到盡」的電影，醉醺醺的魯蛇大叔變成英雄就算了，劇情翻轉的速度簡直比翻書翻臉都要快，讓人目不暇給，拍案叫絕。奇幻影展為什麼這麼熱愛賽門佩吉這伙人，不是沒原因的。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583282&content_id=&ch_id=46&epg_name=醉後末日&stype=name', '062815', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150629`
--

CREATE TABLE IF NOT EXISTS `t20150629` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150629`
--

INSERT INTO `t20150629` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/29', 'HBO', '23:10~01:00', '醉後末日', '', '喜劇', '\r\n埃德加賴特 (Edgar Wright)', '', '(2013)導演艾德格萊特加上賽門佩吉與尼克佛羅斯特，這對銀幕活寶所組成的英國無厘頭鐵三角（《活人牲吃》《終棘警探》）就夠令人興奮了，再加上馬丁費里曼(《新世紀福爾摩斯》)與皮爾斯布洛斯南來搶戲，這部做為「血腥冰淇淋三部曲」最終回的《茫到世界盡頭》更加不能錯過！ \n\r\n多年前，五個意氣風發的小屁孩發誓要在一夜之間喝遍同一條路上的12間酒吧，卻在最後一間酒吧「世界盡頭」之前喝掛了！這個奇恥大辱讓已經變成老屁股的蓋瑞金耿耿於懷，時過二十年，他突然發神經把各奔東西的四位老友連哄帶騙揪出來，一同回到老家再次挑戰。當他們回到小鎮，似乎一點都沒變，卻有股說不出的不對勁，當他們一家一家闖關，逐步發現要挑戰的不只是喝到「世界盡頭」，更要挽救人類面臨世界末日的命運！ \n\r\n《茫到世界盡頭》是一部「玩到盡」的電影，醉醺醺的魯蛇大叔變成英雄就算了，劇情翻轉的速度簡直比翻書翻臉都要快，讓人目不暇給，拍案叫絕。奇幻影展為什麼這麼熱愛賽門佩吉這伙人，不是沒原因的。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583282&content_id=&ch_id=46&epg_name=醉後末日&stype=name', '06291', 0),
(2, '06/29', 'HBO', '01:00~02:45', '陰兒房第2章：陰魂守舍', '', '靈異驚悚', ' \r\n詹姆斯溫 (James Wan)', '', '(2013)令人毛骨悚然的《陰兒房》續集。受幽靈侵擾的藍伯特一家人試圖挖掘那個導致他們與惡靈產生危險連結的神秘的童年秘密。他們必須依靠家人的力量驅逐緊跟他們不放的惡靈，同時揭露這個秘密，但一切都必須趕在它繼續奪命之前。\n\r\n《厲陰宅》華裔導演溫子仁和編劇雷沃納爾再度合作，加上《陰兒房》原班人馬，有口皆碑的幕前幕後人員合力拍攝《陰兒房第２章:陰魂守舍》，延續第一集的故事與風格。 \n\r\n蘭伯特一家滿心歡喜地準備開始新生活，卻在某天，蘭伯特家的兒子收到一件禮物，在那之後，他們所期待的新生活開始起了變化……。蘭伯特家的屋子開始出現無法以科學解釋的詭異現象，像是家中忽然出現一名輕飄飄的白衣女子，留下一抹詭異的微笑就消失不見……等事件。 \n\r\n蘭伯特家開始著手調查，漸漸整理出事情的輪廓，並發現這一連串靈異現象的背後隱藏著不為人知的秘密。然而，就在挖掘秘密的過程當中，蘭伯特家卻在無意間與「另一個世界」產生了危險的連結……。 \n\r\n本片配樂採用同一首童謠貫穿全片，暗指片中關於童年陰影的背後原因；至於溫子仁導演在《奪魂鋸》中利用密閉空間營造驚悚氣氛的手法也在本片中重現。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583283&content_id=&ch_id=46&epg_name=陰兒房第2章：陰魂守舍&stype=name', '06292', 0),
(3, '06/29', 'HBO', '02:45~04:10', '化妝間那些事', '', '喜劇', ' \r\nMJ狄蘭尼(M.J. Delaney)\r\n演員', '', '(2013)和大學同學重聚的珊重新評估自己的生活，她編造出一個完美的表象，來說服自己和朋友她已經擁有了一切。 \n\r\n然而當她那三個不按牌理出牌的熱心好友插手時，她精心的偽裝便開始在菸酒及化妝間裡的胡鬧行為下瓦解。面對一些殘酷真相的同時，珊必須努力對自己坦承，並認真評估她真正想要的生活。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583284&content_id=&ch_id=46&epg_name=化妝間那些事&stype=name', '06293', 0),
(4, '06/29', 'HBO', '04:10~06:00', '世界Battle', '', '歌舞音樂', ' \r\n李貝森(Benson Lee)\r\n', '', '(2013)一群美國的街舞少年組隊，準備參加世界街舞大賽，然而在特訓的過程當中，這些選手們卻大小爭執不斷；舞蹈教練有辦法可以擺平一切、引領他們奪下冠軍嗎？本片根據真實故事改編。\n\r\n本片的時空背景是2011年在法國舉辦的“壹年尬壹次”街舞大賽，電影故事是根據當時參賽的美國隊的真實經歷改編而成。電影找來許多真正的舞者參與演出，讓片中的舞蹈場面十分有看頭。 \n\r\n本片中的世界決賽場景，還可看見來自台灣的參賽隊伍，這些選手們還將在舞台上揮舞巨大的青天白日滿地紅旗幟，可說是送給台灣觀眾的一個小驚喜！ \n\r\n美國隊已經有十五年不曾在“壹年尬壹次”世界大賽中拿到冠軍了，眼看距離比賽只剩三個月的時間，洛杉磯的嘻哈界大亨唐帝找來前冠軍隊的教練布雷克（喬許哈洛威飾），並集結美國的頂尖街舞舞者，在這三個月當中進行密集訓練。 \n\r\n在教練布雷克的魔鬼特訓之下，這批選手雖然個個都十分努力地精益求精，但是年輕又自信十足的他們爭吵不斷，難以達成良好的合作效果。布雷克該採用什麼樣的辦法，才能夠讓這些舞者團結一致、培養默契，好讓美國隊獲得冠軍呢？ \n\r\n電影特地找來《不可能的任務：鬼影行動》喬許哈洛威飾演布雷克教練，而嘻哈歌手克里斯小子更為了本片染了一頭金髮，原本舞蹈功力就十分堅強的他，在片中飾演一名常惹麻煩、又愛炫燿的B-Boy。', 'http://www.niotv.com/epg_content.php?epg_no=1583285&content_id=&ch_id=46&epg_name=世界Battle&stype=name', '06294', 0),
(5, '06/29', 'HBO', '06:00~07:30', '阿爾法爸爸', '', '喜劇', '\r\nDeclan Lowney \r\n', '', '(2013)艾倫帕特奇（史帝夫庫根 飾演）因為醜聞事件讓事業盪到谷底，他無法再主持全國性的脫口秀節目，只好回老家重新做起電台主播。而他在電台策畫了一個叫做《阿爾法爸爸》的新節目，就在他極力挽回自己的公眾人物形象時，卻被捲入一宗暴力事件，讓局勢再次變得複雜..。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583286&content_id=&ch_id=46&epg_name=阿爾法爸爸&stype=name', '06295', 0),
(6, '06/29', 'HBO', '07:30~09:00', '鎖命橫財', '', '動作冒險', '\r\n哈里克路本肯斯 (Henrik Ruben Genz)', '', '', 'http://www.niotv.com/epg_content.php?epg_no=1583287&content_id=&ch_id=46&epg_name=鎖命橫財&stype=name', '06296', 0),
(7, '06/29', 'HBO', '09:00~10:00', '無間警探_第2季 #2', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583288&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '06297', 0),
(8, '06/29', 'HBO', '10:00~10:30', '好球天團_第1季 #2', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583289&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06298', 0),
(9, '06/29', 'HBO', '10:30~11:00', '救世鼎立戰_第1季 #2', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583290&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '06299', 0),
(10, '06/29', 'HBO', '11:00~13:15', '怒海劫', '', '劇情', ' \r\n保羅葛林葛瑞斯 (Paul Greengrass)', '', '(2013)2009年，發生了兩百年來首件美國貨輪挾持事件，船長為了保護船員安全，自願作為海盜的人質……。真實事件改編，由「神鬼認證」系列導演保羅格林葛萊斯執導。\n\r\n本片改編自真人實事，「神鬼認證」系列導演保羅格林葛萊斯執導，湯姆漢克飾演自願擔任海盜肉票的船長，影片場景幾乎全在船上，情節緊湊，毫無冷場。\n\r\n  本片改編自2009年4月一起深受媒體關注的發生在公海上的新聞事件，貨輪船長同時也是兩個孩子的父親的理察菲利浦為了保護自己的船員離開非洲海岸，而向四名索馬利海盜投降。菲利浦企圖逃亡失敗後，在美國特種部隊海豹部隊的狙擊手射殺其中三名海盜後得到營救。 \n\r\n2009年，美國貨輪阿拉巴馬號在海上遭到挾持，對方是惡名昭彰的索馬利亞海盜！這是兩百年來第一艘美國貨輪遭到洗劫的事件。由湯姆漢克出飾的船長菲利浦為了保護其餘的船員安全，自願獨自一人作為海盜的人質。接著，海盜和美軍對峙了幾天，雙方僵持不下；最後是由歐巴馬總統下令，派遣美國海軍精銳「海豹」突擊隊執行救援任務，在狙擊手射殺了三名海盜之後，順利讓人質平安獲救。 \n\r\n湯姆漢克為了演好這個真實角色，湯姆漢克多次拜訪菲利浦船長本人，務求資料考證真切及詳實。導演保羅格林葛萊斯對此事件有其獨到的角度，除了船長成為人質的那生死存亡的五天之中、和索馬利亞海盜的微妙關係與緊張威脅感，同時也呈現出經濟全球化所帶來的影響與衝擊。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583291&content_id=&ch_id=46&epg_name=怒海劫&stype=name', '062910', 0),
(11, '06/29', 'HBO', '13:15~15:00', '我的野蠻網友', '', '喜劇', '\r\n亞當夏克曼(Adam Shankman)', '', '(2003)一名孤獨的中產階級男子(史提夫馬丁)在網路上遇人不淑，對象竟是監獄中的女囚犯(昆恩露提法)，當她假釋出獄後開始纏上了他，對他一成不變的平淡生活造成了嚴重衝擊。', 'http://www.niotv.com/epg_content.php?epg_no=1583292&content_id=&ch_id=46&epg_name=我的野蠻網友&stype=name', '062911', 0),
(12, '06/29', 'HBO', '15:00~16:45', '今天暫時停止', '', '劇情', ' \r\n哈洛雷米斯(Harold Ramis)', '', '(1993)如果你有一天醒來，發現自己從此將日復一日，過著完全一樣的日子，你會有何反應？性格"顧人怨"的氣象播報員菲爾(比爾莫瑞，「王牌保齡球」)便面臨了這令人哭笑不得的詭異情境；菲爾奉命到一處小鎮報導當地頗富盛名的"土撥鼠日"盛會，在短短的一天之中，周遭所有人都領教到他令人不敢恭維的壞脾氣，包括美麗的製作人莉塔(安蒂麥道威爾，「妳是我今生的新娘」)。\n\r\n  原本打算採訪完當天便趕回城市的一行人，卻因大風雪而被迫在鎮上停留一日，然而，第二天早上醒來後不久，菲爾便發現自己不知為何原因，竟被困在二月二日這一天！他要用什麼方法才能擺脫這個可怕的夢魘？這部充滿奇想和現代寓言意味的傑出喜劇片，曾獲得英國金像獎最佳原著劇本以及倫敦影評人協會年度最佳劇本。', 'http://www.niotv.com/epg_content.php?epg_no=1583293&content_id=&ch_id=46&epg_name=今天暫時停止&stype=name', '062912', 0),
(13, '06/29', 'HBO', '16:45~18:40', '蒙娜麗莎的微笑', '', '家庭溫馨', '\r\n麥可紐威(Mike Newell)', '', '(2003)故事背景是在50年代，思想前衛的藝術史老師凱薩琳華森（奧斯卡暨金球獎得主茱莉亞羅勃茲，「瞞天過海」、「偷情」）有一個任務，就是讓衛斯里女子大學的學生能活出自己的人生。即使聰明如衛斯里女子大學的學生，她們的人生目標還是只有一件事：結婚生子。貝蒂華倫（克絲汀鄧斯特，「網住愛情」、「蜘蛛人」）對於女性的傳統角色深信不移，時常挑戰凱薩琳的想法。瓊安布蘭德溫（茱莉亞史緹爾，「神鬼認證2：神鬼疑雲」、「麻雀變王妃」）則不知畢業後該馬上和男友結婚，還是實現自己的夢想去上法學院。康妮貝克（珍妮佛古德溫，「征服偶像」）根本連結婚都沒想過，她只希望能趕快談場戀愛。吉賽兒李維（瑪姬蓋倫海，「停機40天」、「蘭花賊」）則是其中對性最開放的一個學生，但是一碰到她心儀的義大利文老師就緊張的小鹿亂撞。在凱薩琳的帶領下，這四個學生瞭解只要有勇氣真誠地面對自己，就能走出屬於自己的路。', 'http://www.niotv.com/epg_content.php?epg_no=1583294&content_id=&ch_id=46&epg_name=蒙娜麗莎的微笑&stype=name', '062913', 0),
(14, '06/29', 'HBO', '18:40~21:00', '超人：鋼鐵英雄', '', '科幻神怪', '\r\n查克史奈德 (Zack Snyder)', '', '(2013)《300壯士：斯巴達的逆襲》查克史奈德導演，改編DC漫畫的經典人物超人的故事，由《黑暗騎士》、《全面啟動》克里斯多夫諾蘭擔任製片與編劇。《戰神世紀》亨利卡維爾 、艾美亞當斯、羅素克洛、《托斯卡尼艷陽下》黛安蓮恩、凱文科斯納聯合演出。 \n\r\n一位年輕男孩得知他的超凡能力並不源自地球。長大成人後，他四處飄泊意圖發掘他的身世和他被送來地球的使命。但他內心的英雄必須破繭而出，才能拯救世界免於被毀滅，並成為全人類共同的希望象徵。 \n\r\n電影將從超人的身世開始說起，在地球長大的克拉克肯特(亨利卡維爾飾)原是克利普頓星球的居民，剛出生時被取名為凱艾爾，不久便因家鄉「氪星」發生災難而被親生父母(羅素克洛與茱莉亞奧蒙德分飾)送往地球，被肯特夫婦收養(凱文科斯納與黛安蓮恩分飾)。他屬於哪個世界？他該為哪個世界奮戰？這些是超人不斷面對的問題，他的選擇會決定這個他稱為故鄉的星球之命運。 \n\r\n此次身為超人的克拉克肯特，除了延續行俠仗義的英雄之路，他還將面對另外兩名同樣來自氪星的敵手：薩德將軍(麥可夏儂飾)，以及精通近身格鬥技巧的費歐拉(安潔陶依飾)對抗，仇視男性的費歐拉不僅讓超人無法還手，甚至還讓眾人心中的大英雄跌破眾人眼鏡，大吃苦頭落荒而逃...... \n\r\n查克史奈德導演表示，《超人：鋼鐵英雄》不再與以前的超人電影有任何關係，亦非《超人再起》的續集，是一部重新開啟系列的電影，查克講究拳拳到肉的火爆快感，而克里斯多夫諾蘭則重視超級英雄的心理層面，兩人運用各自專長，以黑暗和猶如打遊戲機的風格，聚焦超人自我身份的認知，帶給觀眾耳目一新的超人時代。', 'http://www.niotv.com/epg_content.php?epg_no=1583295&content_id=&ch_id=46&epg_name=超人：鋼鐵英雄&stype=name', '062914', 0),
(15, '06/29', 'HBO', '21:00~22:00', '無間警探_第2季 #2', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583296&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '062915', 0),
(16, '06/29', 'HBO', '22:00~22:30', '好球天團_第1季 #2', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583297&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '062916', 0),
(17, '06/29', 'HBO', '22:30~23:00', '救世鼎立戰_第1季 #2', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583298&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '062917', 0),
(18, '06/29', 'HBO', '23:00~00:40', '空中危機', '', '劇情', '\r\n羅伯史溫基 (Robert Schwentke)', '', '(2005)希區考克式懸疑驚悚巨獻，金獎影后茱蒂佛斯特繼「顫慄空間」後，久休三年重出銀幕再展驚悚戲路，夥拍「綁票通緝令」億萬製片，在三萬多呎高空的客機機艙，打造一幕幕驚心動魄場面，全球超過二億二千萬美元票房。\n\r\n航空工程師凱莉（茱蒂佛斯特）帶著六歲女兒茱莉亞，搭乘自己設計的新型飛機從柏林返回美國紐約。上機後母女兩人一起入睡，但是一覺醒來卻發現女兒茱莉亞不在身邊，凱莉在機艙裡遍尋不著女兒，於是她要求機長瑞奇（西恩賓）及機組人員進行地毯式搜索。凱莉懷疑女兒遭到綁架，但是機組人員與柏林聯絡後，卻傳回茱莉亞其實早在七天前死亡，並沒有隨著凱莉登機的消息。整起事件的真相究竟為何？六歲的茱莉亞怎麼會憑空消失？凱莉到底應該相信自己還是別人？', 'http://www.niotv.com/epg_content.php?epg_no=1583299&content_id=&ch_id=46&epg_name=空中危機&stype=name', '062918', 0);

-- --------------------------------------------------------

--
-- 資料表結構 `t20150630`
--

CREATE TABLE IF NOT EXISTS `t20150630` (
  `movie_id` int(11) NOT NULL,
  `date` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_channel` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `movie_time` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameCH` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `movie_nameEN` char(20) COLLATE utf8_unicode_ci NOT NULL,
  `type` char(8) COLLATE utf8_unicode_ci NOT NULL,
  `movie_director` char(40) COLLATE utf8_unicode_ci NOT NULL,
  `movie_actor` char(200) COLLATE utf8_unicode_ci NOT NULL,
  `movie_main` varchar(1000) COLLATE utf8_unicode_ci NOT NULL,
  `address` char(255) COLLATE utf8_unicode_ci NOT NULL,
  `php_movie_id` char(10) COLLATE utf8_unicode_ci NOT NULL,
  `click` int(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 資料表的匯出資料 `t20150630`
--

INSERT INTO `t20150630` (`movie_id`, `date`, `movie_channel`, `movie_time`, `movie_nameCH`, `movie_nameEN`, `type`, `movie_director`, `movie_actor`, `movie_main`, `address`, `php_movie_id`, `click`) VALUES
(1, '06/30', 'HBO', '23:00~00:40', '空中危機', '', '劇情', '\r\n羅伯史溫基 (Robert Schwentke)', '', '(2005)希區考克式懸疑驚悚巨獻，金獎影后茱蒂佛斯特繼「顫慄空間」後，久休三年重出銀幕再展驚悚戲路，夥拍「綁票通緝令」億萬製片，在三萬多呎高空的客機機艙，打造一幕幕驚心動魄場面，全球超過二億二千萬美元票房。\n\r\n航空工程師凱莉（茱蒂佛斯特）帶著六歲女兒茱莉亞，搭乘自己設計的新型飛機從柏林返回美國紐約。上機後母女兩人一起入睡，但是一覺醒來卻發現女兒茱莉亞不在身邊，凱莉在機艙裡遍尋不著女兒，於是她要求機長瑞奇（西恩賓）及機組人員進行地毯式搜索。凱莉懷疑女兒遭到綁架，但是機組人員與柏林聯絡後，卻傳回茱莉亞其實早在七天前死亡，並沒有隨著凱莉登機的消息。整起事件的真相究竟為何？六歲的茱莉亞怎麼會憑空消失？凱莉到底應該相信自己還是別人？', 'http://www.niotv.com/epg_content.php?epg_no=1583299&content_id=&ch_id=46&epg_name=空中危機&stype=name', '06301', 0),
(2, '06/30', 'HBO', '00:40~02:10', '星光大盜', '', '劇情', '\r\n蘇菲亞柯波拉 (Sofia Coppola)', '', '(2013)改編自震驚全美的竊盜案，由《愛情不用翻譯》蘇菲亞柯波拉執導，真實事件的受害者芭黎絲希爾頓不但入鏡，更大方借出豪宅讓劇組拍攝，其它如奧蘭多布­隆、克斯汀鄧斯特等明星也都露臉客串。 \n\r\n蕾貝卡(張凱蒂飾演)、馬克(伊瑟瑞爾布薩德飾演)、妮琪(艾瑪華森飾演)、克蘿伊(­克萊兒茱莉安飾演)、小珊(塔莎法蜜嘉)是一群住在洛杉磯高級地區的青少年，他們家境­富裕、崇尚名牌，下課後就去夜店狂歡，他們沒有人生目標，只在乎當下的享樂。 \n\r\n最迷戀時尚名牌的蕾貝卡突發奇想：我們為什麼不去偷好萊塢明星的家？她請馬克從網­路上查資料，沒想到輕而易舉找到芭黎絲希爾頓的豪宅地址，再利用八卦網站得知她何時出­國不在家，準備好好大幹一筆。 \n\r\n某天深夜，當他們一進這位拜金女郎的豪宅，全都看傻了眼­，滿屋子的華服、名牌包、高跟鞋，及各式bling bling的珠寶首飾，讓他們宛如置身天堂，他們隨心所欲的幹走所有想要的東西，把門­關上，完全神不知鬼不覺。 \n\r\n科波拉在著手撰寫劇本前，聽了薩爾斯訪問實際星光大盜成員的謄本。因為現有的資料已經夠多了，她選擇虛構他們的行為，並擷取自己的童年經驗，去想像這些青少年會有什麼感受。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583300&content_id=&ch_id=46&epg_name=星光大盜&stype=name', '06302', 0),
(3, '06/30', 'HBO', '02:10~04:10', '蒙娜麗莎的微笑', '', '家庭溫馨', '\r\n麥可紐威(Mike Newell)', '', '(2003)故事背景是在50年代，思想前衛的藝術史老師凱薩琳華森（奧斯卡暨金球獎得主茱莉亞羅勃茲，「瞞天過海」、「偷情」）有一個任務，就是讓衛斯里女子大學的學生能活出自己的人生。即使聰明如衛斯里女子大學的學生，她們的人生目標還是只有一件事：結婚生子。貝蒂華倫（克絲汀鄧斯特，「網住愛情」、「蜘蛛人」）對於女性的傳統角色深信不移，時常挑戰凱薩琳的想法。瓊安布蘭德溫（茱莉亞史緹爾，「神鬼認證2：神鬼疑雲」、「麻雀變王妃」）則不知畢業後該馬上和男友結婚，還是實現自己的夢想去上法學院。康妮貝克（珍妮佛古德溫，「征服偶像」）根本連結婚都沒想過，她只希望能趕快談場戀愛。吉賽兒李維（瑪姬蓋倫海，「停機40天」、「蘭花賊」）則是其中對性最開放的一個學生，但是一碰到她心儀的義大利文老師就緊張的小鹿亂撞。在凱薩琳的帶領下，這四個學生瞭解只要有勇氣真誠地面對自己，就能走出屬於自己的路。', 'http://www.niotv.com/epg_content.php?epg_no=1583301&content_id=&ch_id=46&epg_name=蒙娜麗莎的微笑&stype=name', '06303', 0),
(4, '06/30', 'HBO', '04:10~04:35', '好萊塢好好看 #603', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1583302&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '06304', 0),
(5, '06/30', 'HBO', '04:35~06:00', '尖頭外星人', '', '喜劇', '\r\n史帝夫巴倫 (Steve Barron)', '', '(1993)紐約時報推薦本片為最溫馨有趣的喜劇，故事主要敘述一個外星人家族試著融入地球生活的故事。男主角丹艾奎洛飾演外星人家族的大家長，他幽默而帶有喜感的搞笑演出，在紐約郵報獲得有極佳的口碑。珍寇頓飾演艾奎洛的妻子，而麥可馬金飾演移民局官員，準備毫不留情地將這些”非法移民”驅逐出境。', 'http://www.niotv.com/epg_content.php?epg_no=1583303&content_id=&ch_id=46&epg_name=尖頭外星人&stype=name', '06305', 0),
(6, '06/30', 'HBO', '06:00~07:35', '小屁蛋出任務', '', '喜劇', ' \r\n艾利克斯柴姆(Alex Zamm)\r\n演員', '', '(2014)不受時空限制的小搗蛋們史潘奇、艾佛法、史代米、波奇、巴克威和黛拉回來了！當他們鍾愛的鄰家奶奶即將讓當地一家地產開發商奪走她的麵包店時，大夥透過包含才藝表演在內的各種異想天開的計劃，想籌錢幫助老奶奶，並解救他們在奶奶家裡的秘密基地。 \n', 'http://www.niotv.com/epg_content.php?epg_no=1583304&content_id=&ch_id=46&epg_name=小屁蛋出任務&stype=name', '06306', 0),
(7, '06/30', 'HBO', '07:35~09:20', '我的野蠻網友', '', '喜劇', '\r\n亞當夏克曼(Adam Shankman)', '', '(2003)一名孤獨的中產階級男子(史提夫馬丁)在網路上遇人不淑，對象竟是監獄中的女囚犯(昆恩露提法)，當她假釋出獄後開始纏上了他，對他一成不變的平淡生活造成了嚴重衝擊。', 'http://www.niotv.com/epg_content.php?epg_no=1583305&content_id=&ch_id=46&epg_name=我的野蠻網友&stype=name', '06307', 0),
(8, '06/30', 'HBO', '09:20~11:00', '空中危機', '', '劇情', '\r\n羅伯史溫基 (Robert Schwentke)', '', '(2005)希區考克式懸疑驚悚巨獻，金獎影后茱蒂佛斯特繼「顫慄空間」後，久休三年重出銀幕再展驚悚戲路，夥拍「綁票通緝令」億萬製片，在三萬多呎高空的客機機艙，打造一幕幕驚心動魄場面，全球超過二億二千萬美元票房。\n\r\n航空工程師凱莉（茱蒂佛斯特）帶著六歲女兒茱莉亞，搭乘自己設計的新型飛機從柏林返回美國紐約。上機後母女兩人一起入睡，但是一覺醒來卻發現女兒茱莉亞不在身邊，凱莉在機艙裡遍尋不著女兒，於是她要求機長瑞奇（西恩賓）及機組人員進行地毯式搜索。凱莉懷疑女兒遭到綁架，但是機組人員與柏林聯絡後，卻傳回茱莉亞其實早在七天前死亡，並沒有隨著凱莉登機的消息。整起事件的真相究竟為何？六歲的茱莉亞怎麼會憑空消失？凱莉到底應該相信自己還是別人？', 'http://www.niotv.com/epg_content.php?epg_no=1583306&content_id=&ch_id=46&epg_name=空中危機&stype=name', '06308', 0),
(9, '06/30', 'HBO', '11:00~11:30', '好球天團_第1季 #2', '', '喜劇', '\r\n巨石強森(The Rock) (Dwayne Johnson)', '', '(2015)是由彼得博格執導，Carmelo Oquendo、巨石強森等主演的喜劇，圍繞一群足球運動員和他們的家人、朋友的故事。\n\r\n該劇講述了一群橄欖球員的職業生涯與私人生活。巨石強森在劇中出演一名退役的橄欖球員。夏天看這部劇再合適不過，肌肉、熱血、沙灘、美女、名利場無不讓人熱血沸騰。激情與汗水齊飛，權力與欲望交融，HBO此劇大有看齊《嘻哈帝國》的野心。', 'http://www.niotv.com/epg_content.php?epg_no=1583307&content_id=&ch_id=46&epg_name=好球天團_第1季&stype=name', '06309', 0),
(10, '06/30', 'HBO', '11:30~12:00', '救世鼎立戰_第1季 #2', '', '喜劇', '\r\n提姆羅賓斯 (Tim Robbins)', '', '(2015)每集半小時的全新黑色喜劇影集，劇情焦點在一場地緣政治上的危機及其對三個完全不同及絕望的男子的影響：美國國務卿華特賴森；謙卑的外交官艾歷克斯塔伯特；頂尖的海軍戰鬥機飛行員柴克堤爾森。這三個向現況妥協的關鍵人物必須設法度過目前的混亂，同時避免第三次世界大戰的發生。', 'http://www.niotv.com/epg_content.php?epg_no=1583308&content_id=&ch_id=46&epg_name=救世鼎立戰_第1季&stype=name', '063010', 0),
(11, '06/30', 'HBO', '12:00~13:00', '無間警探_第2季 #2', '', '劇情', '\r\n柯林法洛 (Colin Farrell)', '', '(2015)榮獲艾美獎肯定的HBO偵探影集再度以全新一季回歸，劇中三名警官和一名職業罪犯必須應付兇案背後的複雜陰謀。\n\r\n第2季「無間警探」將會展開一個全新的篇章，故事發生在加州，由柯林法洛飾演一個在腐敗的警察單位工作的警察Ray Velcoro，本身也欠下鉅額賭債；文斯范恩飾演Frank Semyon，一個計劃金盆洗手的罪犯；瑞秋麥亞當斯飾演一位堅守道德規範的警探Ani Bezzerides；泰勒基奇飾演曾是退伍軍人的騎警Paul Woodrugh；而凱莉雷利將會演出 Frank 的妻子Jordan Semyon。', 'http://www.niotv.com/epg_content.php?epg_no=1583309&content_id=&ch_id=46&epg_name=無間警探_第2季&stype=name', '063011', 0),
(12, '06/30', 'HBO', '13:00~15:25', '超人：鋼鐵英雄', '', '科幻神怪', '\r\n查克史奈德 (Zack Snyder)', '', '(2013)《300壯士：斯巴達的逆襲》查克史奈德導演，改編DC漫畫的經典人物超人的故事，由《黑暗騎士》、《全面啟動》克里斯多夫諾蘭擔任製片與編劇。《戰神世紀》亨利卡維爾 、艾美亞當斯、羅素克洛、《托斯卡尼艷陽下》黛安蓮恩、凱文科斯納聯合演出。 \n\r\n一位年輕男孩得知他的超凡能力並不源自地球。長大成人後，他四處飄泊意圖發掘他的身世和他被送來地球的使命。但他內心的英雄必須破繭而出，才能拯救世界免於被毀滅，並成為全人類共同的希望象徵。 \n\r\n電影將從超人的身世開始說起，在地球長大的克拉克肯特(亨利卡維爾飾)原是克利普頓星球的居民，剛出生時被取名為凱艾爾，不久便因家鄉「氪星」發生災難而被親生父母(羅素克洛與茱莉亞奧蒙德分飾)送往地球，被肯特夫婦收養(凱文科斯納與黛安蓮恩分飾)。他屬於哪個世界？他該為哪個世界奮戰？這些是超人不斷面對的問題，他的選擇會決定這個他稱為故鄉的星球之命運。 \n\r\n此次身為超人的克拉克肯特，除了延續行俠仗義的英雄之路，他還將面對另外兩名同樣來自氪星的敵手：薩德將軍(麥可夏儂飾)，以及精通近身格鬥技巧的費歐拉(安潔陶依飾)對抗，仇視男性的費歐拉不僅讓超人無法還手，甚至還讓眾人心中的大英雄跌破眾人眼鏡，大吃苦頭落荒而逃...... \n\r\n查克史奈德導演表示，《超人：鋼鐵英雄》不再與以前的超人電影有任何關係，亦非《超人再起》的續集，是一部重新開啟系列的電影，查克講究拳拳到肉的火爆快感，而克里斯多夫諾蘭則重視超級英雄的心理層面，兩人運用各自專長，以黑暗和猶如打遊戲機的風格，聚焦超人自我身份的認知，帶給觀眾耳目一新的超人時代。', 'http://www.niotv.com/epg_content.php?epg_no=1583310&content_id=&ch_id=46&epg_name=超人：鋼鐵英雄&stype=name', '063012', 0),
(13, '06/30', 'HBO', '15:25~17:00', '不願面對的真相', '', '其他', '\r\n戴維斯古根漢 (Davis Guggenheim)', '', '(2006)我們坐在一枚定時炸彈上面，如果全世界大多數的科學家是正確的，人類只有十年的時間避免一場大災難，足以讓地球的氣候系統一片大亂，造成嚴重的氣候遽變，包括極端的氣候變化、水災、旱災、流行性傳染病大量散播以及致命熱浪，災情之嚴重是我們從來沒有經歷過的，而且完全是我們自己造成的。\n\r\n　如果這聽起來像杞人憂天，請重新考慮一次。導演戴維斯古根漢執導的紀錄片【不願面對的真相】在日舞影展大受歡迎，該片記錄一個人以他無比的熱誠、深具啟發性的談話，以及堅定不移的決心，大膽戳破關於全球暖化的迷思和誤解，並激勵每個人採取行動阻止情況惡化。這個人就是美國前任副總統艾爾高爾，他在2000年總統大選敗選之後，重新調整自我的生活方向，全心全意為全球暖化的問題付出時間與精力，希望能夠以他個人的努力，讓世人真正了解全球暖化的嚴重性，並且幫助世人拯救地球，阻止它走向自我毀滅的方向。【不願面對的真相】一片記錄了艾爾高爾在全世界各地的全球暖化巡迴演講，他在這些以幻燈片輔助的演講中，同時展現出風趣幽默以及認真嚴肅的一面，以輕鬆自然以及實事求是的態度、竭盡所能向一般老百姓說明地球正面臨一場“全球性的緊急狀況”，而我們這些老百姓在事情尚未惡化到無法挽救的地步，必須儘快採取行動阻止浩劫發生。\n\r\n　2005，美國有史以來最嚴重的暴風季終於過去，但是我們仍然可能接近一個“引爆點”，高爾以最坦率直接的方法解釋全球暖化的嚴重性。他時而引用令人驚訝的事實數據，時而預測未來將發生的嚴重後果，中間並穿插高爾個人的心路歷程。從他在大學時在課堂上看到大規模環保危機產生的可能性；到他身為年輕參議員，意氣風發之時卻差點痛失愛子，因而改變了他對人生的觀短；一直到他差一點就成為美國總統所受到的挫敗。但是他卻一點也沒有失意喪志，反而重新投入他這一生最重要的使命，也就是說服世人仍有時間做出改變，拯救我們唯一的家園－地球。\n\r\n　【不願面對的真相】一片捕捉了高爾的風趣幽默、博學多聞以及充滿希望的一面，讓他以感染度極高的演說，一針見血地提出一個最重要的事實，那就是世人不能再把全球暖化視為政治議題，而是人類文明面對最大的道德挑戰。\n\r\n　【不願面對的真相】一片由派拉蒙經典影片公司暨Participant製片公司出品；由戴維斯古根漢執導；主要人物是艾爾高爾。製片是蘿莉大衛、羅倫斯班德以及史考特柏恩斯；執行製片是傑夫史高、戴維斯古根漢、黛安', 'http://www.niotv.com/epg_content.php?epg_no=1583311&content_id=&ch_id=46&epg_name=不願面對的真相&stype=name', '063013', 0),
(14, '06/30', 'HBO', '17:00~18:45', '超級大間諜', '', '喜劇', '\r\n布朗溫休斯 (Bronwen Hughes)', '', '(1996)喜歡電影「秘密花園」和「小公主」的觀眾也必定會喜歡這部由布朗文休斯(「觸電之旅」)執導的家庭溫馨喜劇。本片的主人翁是一個膽子大志氣高的小偵探哈麗威爾許(蜜雪兒雀柏格，「G型神探」)，立志成為一名間諜。她最喜歡拿著她的寶貝筆記本，在家附近四處窺探，紀錄養貓的鄰居，花園很詭異的女人，和中國餐廳的動靜。然而事情卻沒這麼簡單。她玩得太過火，甚至連她的父母和同學都成了她偵查的對象，心生不滿的同學決定要執行他們的「反間諜任務」，哈麗當然也予以反擊。身兼演員與脫口秀主持人二職的蘿絲歐唐納在片中演出哈麗的瘋狂保姆。', 'http://www.niotv.com/epg_content.php?epg_no=1711225&content_id=&ch_id=46&epg_name=超級大間諜&stype=name', '063014', 0),
(15, '06/30', 'HBO', '18:45~19:15', '好萊塢好好看 603', '', '其他', '', '', '每個星期，「好萊塢好好看」為觀眾揭露三部強檔電影的幕後，為您捕捉拍攝時的鏡頭，同時訪問演員和製片。', 'http://www.niotv.com/epg_content.php?epg_no=1711226&content_id=&ch_id=46&epg_name=好萊塢好好看&stype=name', '063015', 0),
(16, '06/30', 'HBO', '19:15~21:00', '玩命關頭', '', '動作冒險', '\r\n羅勃柯恩 (Rob Cohen)', '', '(2001)唐米尼杜洛城街頭賽車界的老大哥，他身邊有一群忠心耿耿的手下，他白天忙著組裝高性能跑車，晚上則是開著他的愛車，動輒以一次一萬元的賭注和別人軋車。 布萊恩對賽車極有興趣，有一次他開了一輛超炫的跑車想和唐老大一較高下，也希望得到他的青睞，當比賽結束，布萊恩輸得一塌塗地之後，警方接獲風聲前來取締，布萊恩救了唐老大一命，於是他就被納入唐老大的權力核心，唐老大的妹妹蜜雅也對布萊恩產生好感，但是他們都不知道布萊恩其實是一名臥底警探。 布萊恩滲入賽車圈的目的是調查一連串的卡車搶案，嫌犯都是開著跑車的蒙面人，警方和聯邦調查局希望能儘早逮到搶匪，以免卡車司機採取激烈的手段對這些搶匪進行報復行動，其中最有嫌疑的就是唐老大和強尼。 正當唐老大和強尼形成水火不相容的情勢，布萊恩和唐老大兄妹的關係卻越來越深，他不但和唐老大結為好友，更忍不住對蜜雅產生好感，但是他也同時承受來自警方和FBI的壓力，必須儘快查出誰才是真正的搶匪，他在天人交戰之際，在法律和友情之間，必須做出困難的決定。', 'http://www.niotv.com/epg_content.php?epg_no=1583313&content_id=&ch_id=46&epg_name=玩命關頭&stype=name', '063016', 0),
(17, '06/30', 'HBO', '21:00~23:00', '哥吉拉', '', '科幻神怪', ' \r\n蓋瑞斯愛德華 (Gareth Edwards)', '', '(2014)闊別大銀幕十年，巨獸之王【哥吉拉】正宗回歸，經典嘶吼撼動全球，人類面對前所未有的浩劫，塵封真相即將公諸於世。\n\r\n影史上最傳奇的怪獸之王《哥吉拉》又回來了，由《異獸禁區》蓋瑞斯愛德華執導，由美日團隊首度攜手合作，《絕命毒師》布萊恩克萊斯頓主演。這次是哥吉拉第28次翻拍。影片保留原版哥吉拉的造型，但增加新角色，且跨越1954年到現代的三個不同時代，故事發生地主要搬到美國，夏威夷、賭城維加斯和舊金山將被怪獸掃為平地。最終大戰場面在舊金山中國城拍攝。 \n\r\n哥吉拉就像是一個隱世獨立的末代武士，不願出現在世人面前，但是自然界即將失衡，逼得牠不得不現身。而人類在面對哥吉拉如大自然反撲般排山倒海的力量時，儘管毫無招架之力，仍然呈現出驚人的勇氣與寬容。 \n\r\n有別於過去是實體模型，導演表示，這次全部是電腦特效，且是3D版。不過因為它並非像「哈比人」裡的火龍一樣會「說話」，也就不必要太多的表情，片中對它的面部特效鏡頭很少，大部分時間人們只能遠遠望去它身軀或看到局部。 \n\r\n哥吉拉的怒吼一向是牠的特徵。導演透露哥吉拉的吼聲來源於皮手套撫弄低音提琴，當然有後期變調混音，片場錄回聲時，用了高四米寬約一條街總功率10萬瓦的巨無霸音箱陣列，且一共錄製了50多種不同叫聲，最終選擇了一種聽起來最適合的聲音。 \n\r\n本片卡司包括亞倫泰勒強森、茱麗葉畢諾許、渡邊謙外，更請­來1954年演出日本電影《哥吉拉》演員寶田明參與演出。 ', 'http://www.niotv.com/epg_content.php?epg_no=1583314&content_id=&ch_id=46&epg_name=哥吉拉&stype=name', '063017', 0),
(18, '06/30', 'HBO', '23:00~00:40', '思維空間', '', '靈異驚悚', '\r\n侯黑鐸拉多 (Jorge Dorado)', '', '(2013)由男星馬克史壯飾演的主角約翰華盛頓是一名偵探，他擁有進入人們心智和記憶(特別是協助當事人回憶與案件相關的細節)的獨特能力。 \n\r\n約翰接下麻煩少女安娜的案件。安娜遭指控犯下三人兇案。為了解開圍繞在安娜周邊的謎團，約翰將進入她的內心，設法找出真相：安娜真有能力殺人嗎？或在她記憶某處藏有關鍵的線索？', 'http://www.niotv.com/epg_content.php?epg_no=1583315&content_id=&ch_id=46&epg_name=思維空間&stype=name', '063018', 0);

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`board_id`);

--
-- 資料表索引 `counthit`
--
ALTER TABLE `counthit`
  ADD PRIMARY KEY (`name`);

--
-- 資料表索引 `send_emil`
--
ALTER TABLE `send_emil`
  ADD PRIMARY KEY (`countid`);

--
-- 資料表索引 `t20150610`
--
ALTER TABLE `t20150610`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150611`
--
ALTER TABLE `t20150611`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150612`
--
ALTER TABLE `t20150612`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150613`
--
ALTER TABLE `t20150613`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150614`
--
ALTER TABLE `t20150614`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150615`
--
ALTER TABLE `t20150615`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150616`
--
ALTER TABLE `t20150616`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150617`
--
ALTER TABLE `t20150617`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150621`
--
ALTER TABLE `t20150621`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150622`
--
ALTER TABLE `t20150622`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150623`
--
ALTER TABLE `t20150623`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150624`
--
ALTER TABLE `t20150624`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150625`
--
ALTER TABLE `t20150625`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150626`
--
ALTER TABLE `t20150626`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150627`
--
ALTER TABLE `t20150627`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150628`
--
ALTER TABLE `t20150628`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150629`
--
ALTER TABLE `t20150629`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 資料表索引 `t20150630`
--
ALTER TABLE `t20150630`
  ADD PRIMARY KEY (`movie_id`,`movie_channel`,`movie_nameCH`,`type`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `comment`
--
ALTER TABLE `comment`
  MODIFY `board_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=7;
--
-- 使用資料表 AUTO_INCREMENT `send_emil`
--
ALTER TABLE `send_emil`
  MODIFY `countid` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=13;
--
-- 使用資料表 AUTO_INCREMENT `t20150610`
--
ALTER TABLE `t20150610`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=15;
--
-- 使用資料表 AUTO_INCREMENT `t20150611`
--
ALTER TABLE `t20150611`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=15;
--
-- 使用資料表 AUTO_INCREMENT `t20150612`
--
ALTER TABLE `t20150612`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=19;
--
-- 使用資料表 AUTO_INCREMENT `t20150613`
--
ALTER TABLE `t20150613`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150614`
--
ALTER TABLE `t20150614`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150615`
--
ALTER TABLE `t20150615`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=21;
--
-- 使用資料表 AUTO_INCREMENT `t20150616`
--
ALTER TABLE `t20150616`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=17;
--
-- 使用資料表 AUTO_INCREMENT `t20150617`
--
ALTER TABLE `t20150617`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=2;
--
-- 使用資料表 AUTO_INCREMENT `t20150621`
--
ALTER TABLE `t20150621`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150622`
--
ALTER TABLE `t20150622`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=20;
--
-- 使用資料表 AUTO_INCREMENT `t20150623`
--
ALTER TABLE `t20150623`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=17;
--
-- 使用資料表 AUTO_INCREMENT `t20150624`
--
ALTER TABLE `t20150624`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150625`
--
ALTER TABLE `t20150625`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=17;
--
-- 使用資料表 AUTO_INCREMENT `t20150626`
--
ALTER TABLE `t20150626`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=17;
--
-- 使用資料表 AUTO_INCREMENT `t20150627`
--
ALTER TABLE `t20150627`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150628`
--
ALTER TABLE `t20150628`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=16;
--
-- 使用資料表 AUTO_INCREMENT `t20150629`
--
ALTER TABLE `t20150629`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=19;
--
-- 使用資料表 AUTO_INCREMENT `t20150630`
--
ALTER TABLE `t20150630`
  MODIFY `movie_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=19;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
